{"description":"The concepts focused on in this set are still those of  \"Point of Origin\"  as this is a continuation of Star Block Set, or Blocking Set 1. This set also teaches coordination while focusing on your blocks.","steps":[{"description":"Star Block Set (right side):","steps":["Execute a right upward block.","Leaving your hand as the focal point, turn it into a right inward block.","From the inside, rotate at the shoulder so now it is a right extended outward block.","From there, circle it down until it is a right downward block.","From there, go into reverse motion and execute a right inward downward block.","Execute a right back elbow (used as a block to protect your ribs).","Execute a right push-down block.","Chamber."]},{"description":"Star Block Set (left side):","steps":["Execute a left upward block.","Leaving your hand as the focal point, execute a left inward block.","Rotating at the shoulder, execute a left extended outward block.","Circle it across your chest and out so you execute a left downward block.","Execute a left inward downward block.","Execute a left back elbow (used as a block to protect your ribs).","Execute a left push-down block.","Chamber."]},{"description":"Star Block Set (both sides at once):","steps":["Execute an upward X-block (a left and a right upward block).","Rotate and execute a left and a right inward block so that they cross in front of you.","Rotating at the shoulders, simultaneously execute a left and right extended outward block.","Circle both arms in and simultaneously execute a left and right outward downward block.","Simultaneously execute a left and a right inward downward block, flowing into back elbow strikes with the left and right elbows. (Chambering both.)","Execute a downward X-block with palms open and down (left and right push-down blocks)."]},{"description":"Star Block Set (simultaneous opposition):","steps":["Simultaneously execute a left upward block as you execute a right push-down block.","Simultaneously execute a left inward block as you execute a right back elbow.","Simultaneously execute a left extended outward block as you execute a right outward downward block (making sure to block in front of the groin).","Simultaneously execute a left outward downward block as you execute a right extended outward block.","Simultaneously execute a left inward downward block flowing into a left back elbow strike as you simultaneously execute a right inward block.","Simultaneously execute a left push-down block as you execute a right upward block.","Chamber."]},{"description":"Star Block Set (simultaneous opposition): [other side]","steps":["Simultaneously execute a left push-down block as you execute a right upward block.","Simultaneously execute a left back elbow as you execute a right inward block.","Simultaneously execute a left outward downward block as you execute a right extended outward block.","Simultaneously execute a left extended outward block as you execute a right outward downward block.","Simultaneously execute a left inward block as you execute a right inward downward block, flowing into a right back elbow strike.","Simultaneously execute a left upward block as you execute a right push-down block.","Chamber."]},{"description":"The Rest of the Set","steps":["Pivot into a right forward bow facing 3 o'clock as you execute a right universal block.","Pivot into a right neutral bow facing 3 o'clock as you execute a left universal block towards 1:30.","Pivot into a left forward bow facing 9 o'clock as you execute a left universal block.","Pivot into a left neutral bow facing 9 o'clock as you execute a right universal block towards 10:30.","Pivot back into a horse stance facing 12 o'clock as you simultaneously execute a right upward block and a left inward downward block (palm down).","Simultaneously execute a left upward block and a right inward downward block (palm down).","Simultaneously execute a right upward parry and a left inward downward block (palm up).","Simultaneously execute a left upward parry and a right inward downward block (palm up).","Pivot into a right forward bow facing 3 o'clock as you execute a right outward downward parry.","Pivot in place into a right neutral bow facing 3 o'clock as you execute a right outward parry followed immediately by a left outward hooking parry (waiter's block).","Pivot into a left forward bow facing 9 o'clock as you execute a left outward downward parry and a right inward parry.","Pivot in place into a left neutral bow facing 9 o'clock as you execute a left outward parry followed immediately by a right outward hooking parry (waiter's block).","Pivot back into a horse stance facing 12 o'clock. Bring your right foot into a one-leg stance as you simultaneously execute a right outward downward pary (palm out) and a left inward parry.","Drop your right foot back into a horse stance facing 12 o'clock. Bring your left foot up into a one-leg stance as you simultaneously execute a left outward downward parry (palm out) and a right inward parry.","Drop your left foot back to 6 o'clock into a right forward bow facing 12 o'clock as you execute a downward X-block (hands open).","Slide your right foot back to 3 o'clock into a horse stance facing 12 o'clock as you simultaneously execute a left and a right outward downward parry.","Simultaneously execute a left and a right outward hooking parry (waiter's block).","Simultaneously execute a left and a right push-down block."]}]}