{
	"description": "Unless stated, you will want to chamber the arm that is not executing a strike.",
	"steps": ["Execute a right hand spear to your attacker's eyes.",
	"Execute a left hand spear to your attacker's eyes.",
	"Execute a mid-range right vertical hand spear to the attacker's mid-section.",
	"Execute a midrange left vertical hand spear to the attacker's midsection",
	"Execute a short-range right hand spear (palm up) to the attacker's midsection",
	"Execute a short-range left hand spear (palm up) to the attacker's midsection",
	"Execute a right inward elbow to your attacker's jaw. (Your right hand should be a closed two-finger spear over your left shoulder.)",
	"Execute a left inward elbow to your attacker's jaw. (Your left hand should be a closed two-finger spear over your right shoulder.)",
	"Bring the two fingers of your right hand to your left at your shoulder. Execute two downward finger slices that whip into your attacker's eyes and rake down.",
	"Execute, with both hands, two vertical closed two-finger spears to your attacker's eyes.",
	"Execute a cross block to your attacker's bladder (These are two palm heel strikes, with one hand over the other.)",
	"Circle your hands in (towards your body) and stab out with two vertical one-finger eye pokes that cross with one arm over the other.",
	"Execute a right hand crane finger-whip to your attacker's eyes as your left hand checks at the groin.",
	"Execute a left hand crane finger-whip to your attacker's eyes as your right hand checks at the groin.",
	"Execute a right hand crane finger-whip from your right hip into your attacker's groin as your left hand checks at your groin.",
	"Execute a left hand crane finger-whip from your left hip into your attacker's groin as your right hand check at your groin.",
	"As you chamber your left hand, execute a right hand closed two-finger spear (palm up) to your attacker's left eye. Rake it to the left using only your wrist. Rotate your wrist so as you are now raking back to the right, with your palm down. Rotate it again and scoop out the eye, pulling your hand back into chamber as a crane.",
	"Execute a left closed two-finger spear (palm up) to your attacker's right eye. Rake it to the right using only your wrist. Rotate your wrist so as you are now raking back to the left, with your palm down. Rotate it again and scoop out the eye, pulling your hand back into chamber as a crane.",
	"Execute a right palm heel strike to your attacker's face. Rotate your wrist to the left, so you rake across their face in a counterclockwise motion as a claw. Rotate your wrist back to the right so you are now raking across their face in a clockwise motion. Rotate your wrist once again to counterclockwise so you are raking the face again.",
	"Execute a left palm heel strike to your attacker's face. Rotate your wrist clockwise as a claw and rake their face. Rotate your wrist back counterclockwise and rake their face. Rotate your wrist again in a clockwise motion and rake across their face again.",
	"Execute a right overhead claw towards 12 o'clock as you simultaneously execute a left underhand claw to 6 o'clock.",
	"Execute a left overhead claw towards 12 o'clock as you simultaneously execute a right underhand claw to 6 o'clock.",
	"Execute simultaneous underhand claws; a right claw towards 12 o'clock and a left claw towards 6 o'clock.",
	"Execute simultaneous underhand claws; a left claw towards 12 o'clock and a right claw towards 12 o'clock.",
	"Execute a double thumb thrust into your attacker's eyes at 12 o'clock.",
	"Execute two thumb thrusts; one towards 9 o'clock and one towards 3 o'clock.",
	"Execute a right closed two-finger poke to their left eye at 12 o'clock; execute a left closed two-finger poke to their right eye at 12 o'clock.",
	"Set into a meditative horse stance. Close."]
}