{"steps":["From your horse stance, step to 12 o'clock with your right foot into a right forward bow while executing a right hand spear to eye level. Your left hand will check under your right elbow.","Execute a front to back stance change into a left forward bow facing 12 o'clock as you simultaneously execute a left hand spear eye level. Your right hand will check under your left elbow.","Step back with your left foot to 6 o'clock into a right neutral bow facing 12 o'clock as you execute a right vertical hand spear to solar plexus level.","Execute a front to back stance change into a left neutral bow facing 12 o'clock as you simultaneously execute a left mid-range vertical hand spear to solar plexus level.","Step your right foot to 12 o'clock into a right neutral bow facing 12 o'clock as you execute a short-range right inverted hand spear (palm up) at solar plexus level.","Execute a front to back stance change into a left neutral bow facing 12 o'clock as you execute a short-range inverted left hand spear at solar plexus level.","Slide your left foot back into a horse stance facing 12 o'clock as you execute a left back elbow and a right closed two-finger spear over your left shoulder.","Slide your left foot to your right. Step out to 3 o'clock with your right foot into a horse stance facing 12 o'clock as you execute a right back elbow and a left closed two-finger spear over your right shoulder.","Slide your right foot to your left. Step out to 9 o'clock with your left foot into a horse stance facing 12 o'clock. Execute finger whips into your attacker's eyes and rake down.","Execute, with both hands, two vertical closed two-finger spears to your attacker's eyes.","Step to 12 o'clock with your right foot and turn into a right rotating twist stance as you execute a right closed two-finger poke to 1:30 at eye level. Your left hand will check under your right elbow.","Step back to 3 o'clock with your right foot into a transitory horse stance facing 12 o'clock maintaining your hand positions.","Step to 12 o'clock with your left foot and turn into a left rotating twist stance as you execute a left closed two-finger poke to 10:30 at eye level. Your right hand will check under your left elbow.","Step back to 9 o'clock with your left foot into a horse stance facing 12 o'clock maintaining your hand positions.","Step to 12 o'clock with your right foot into a right neutral bow facing 12 o'clock as you execute a right overhead finger whip to face level. Your left hand will check under your left elbow.","Step your left foot to 12 o'clock into a left neutral bow facing 12 o'clock as you execute a left overhead finger whip to face level. Your right hand will check under your left elbow.","Slide your left foot back into a right cat stance facing 1:30. As you plant, simultaneously execute a left inward downward block (palm up) and a right outward downward parry in the shape of a crane. [Your parry is complete at the right hip].","Step your right foot to 1:30 into a right neutral bow facing 1:30 as you execute a right underhand finger whip at groin level.","Slide your right foot back to your left into a left cat stance facing 10:30. As you plant, simultaneously execute a right inward downward block (palm up) and a left outward downward parry in the shape of a crane. [Your parry is complete at the left hip].","Step to 10:30 with your left foot into a left neutral bow facing 10:30 as you execute a left underhand finger whip to groin level.","Step your left foot back to 7:30 so you are in a right neutral bow facing 1:30 as you execute a right outward downward parry in the shape of a crane. Circle the parry into a right two-finger slice. Your left hand will check under your right elbow.","Execute a right outward two-finger slice. Your left hand will remain in check.","Step your right foot to 4:30 so you are in a left neutral bow facing 10:30 as you execute a left outward downward parry in the shape of a crane. Circle the parry into a left two-finger slice. Your right hand will check under your left elbow.","Execute a left outward two-finger slice. Your right hand will remain in check.","Step your left foot to your right and out to 9 o'clock into a left forward bow facing 9 o'clock as you execute a left inward downward diagonal parry into a horizontal check as you simultaneously execute a right inward overhand claw to eye level.","Execute a right outward overhand claw to eye level.","Step your right foot to your left and out to 3 o'clock into a right forward bow facing 3 o'clock as you execute a right inward downward diagonal parry into a horizontal check as you simultaneously execute a left inward overhand claw to eye level.","Execute a left outward overhand claw to eye level.","Turn into a right rotating twist stance facing 10:30 as you simultaneously execute a left underhand claw to 4:30 and a right overhand claw to 10:30.","Slide your right foot to your left and out to 1:30. Turn into a left rotating twist stance (rotating clockwise) facing 1:30 as you simultaneously execute a right underhand claw to 7:30 and a left overhand claw to 1:30.","Pivot into a left neutral bow facing 7:30 as you execute a left underhand claw to groin level at 1:30 and a right underhand claw to groin level at 7:30.","Slide your left foot back to your right and then step out to 4:30 with your right foot into a right neutral bow facing 4:30 as you execute a right underhand claw to groin level at 10:30 and a left underhand claw to groin level at 4:30.","Slide your right foot to your left into an attention stance facing 12 o'clock as you execute two underhand claws to groin level.","Pull your hands in and cross them out as you execute two finger flicks at every level that turn into two outward thumb hooks at eye level. (The thumb hooks will cause your hands to become uncrossed).","Cross your hands (palm down this time) and do two outward overhand claws (that uncross your hands) as you step out into a horse stance facing 12 o'clock.","Slide your right foot to your left into a right cat stance facing 12 o'clock while executing a right closed two-finger spear at eye level. Your left hand will check under your right elbow.","Switch into a left cat stance facing 12 o'clock as you execute a left closed two-finger spear at eye level. Your right hand will check under your left elbow.","Slide your left foot to your right into an attention stance (knees bent) as you execute a downward x-block.","Straighten your knees as you execute a left and right closed two-finger poke to 12 o'clock. Circle your arms in and thrust out a left and right thumb hook to 9 and 3 o'clock.","Slide your left foot to 9 o'clock into a horse stance"]}