{"steps":[{"description":"Opening:","steps":["Bow","Do the full Kenpo Salutation up to the prayer of forgiveness. Slide your left foot to your right as your hands drop (palms up and fingers pointed towards each other.) Reverse the close into a double pushdown for purposes of category completion."]},{"description":"Set 1: Glancing Lance (Front: Right Knife Thrust)","steps":["An attacker at 12 o'clock comes at you with a right knife thrust towards your abdomen.","Step back with the right foot to 7:30 in a left neutral bow with a right outward handsword to the outside of your attacker's wrist as you execute a left inward handsword to your attacker's right elbow. Immediately grab your attacker's right wrist with your right hand as you execute a left palm strike to your attacker's elbow joint. Note: This move has the intent of diverting, seizing, controlling, and disarming your attacker.","Execute a right front kick to 12 o'clock to your attacker's groin.","Land towards 12 o'clock as you execute a right two finger inward hook to your attacker's eyes. (Your left hand should be checking at their right arm).","Immediately hop onto your left foot towards 9 o'clock into a left one-legged stance as your right arm circles counterclockwise as you execute a right outward downward parry which hooks on top and outside of your attacker' right elbow. Simultaneously execute a left palm heel strike to your attacker's right shoulder. Note: This should turn them counterclockwise setting up the availability of the next moves.","Execute a right knife-edge kick to your attacker's right knee.","Land in a right neutral bow between your attacker's legs as you execute a right two finger inward hook to your attacker's eyes while your left hand slides from your attacker's shoulder to check his right arm.","Circle your left arm clockwise and execute a left inward middle knuckle to your attacker's left mastoid. This middle knuckle makes contact a fraction of a section before executing a right inward elbow to your attacker's right ribs. (Your left hand will check at your attacker's shoulders).","Bring the left foot to the right in attention stance facing 12 o'clock as the hands clear downward, outward, and then into pushdowns."]},{"description":"Set 2: Glancing Lance (Front: Left Knife Thrust)","steps":["An attacker from 12 o'clock comes at you with a left knife thrust.","Step back with the left foot to 4:30 into a right neutral bow with a left outward handsword to the outside of your attacker's wrist as you execute a right inward handsword to your attacker's left elbow. Immediately grab your attacker's left wrist with your left hand as you execute a right palm strike to your attacker's elbow joint. Note: This move has the intent of diverting, seizing, controlling, and disarming your attacker.","Execute a left front kick to 12 o'clock to your attacker's groin.","Land towards 12 o'clock as you execute a left two finger inward hook to your attacker's eyes. (Your right hand should be checking at their left arm).","Immediately hop onto your right foot towards 3 o'clock into a right one-legged stance as your left arm circles counterclockwise as you execute a left outward downward parry which hooks on top and outside of your attacker' left elbow. Simultaneously execute a right palm heel strike to your attacker's left shoulder. Note: This should turn them clockwise setting up the availability of the next moves.","Execute a left knife-edge kick to your attacker's left knee.","Land in a left neutral bow between your attacker's legs as you execute a left two finger inward hook to your attacker's eyes while your right hand slides from your attacker's shoulder to check his left arm.","Circle your right arm clockwise and execute a right inward middle knuckle to your attacker's right mastoid. This middle knuckle makes contact a fraction of a section before executing a left inward elbow to your attacker's left ribs. (Your right hand will check at your attacker's shoulders)."]},{"description":"Set 3: Unfurling Crane (Left Kick & Right Knife Thrust from 3:00)","steps":["An attacker at 3 o'clock comes at you with a left kick.","From your left neutral bow, cover into a right cat stance facing 3 o'clock. As you cover, execute a right outward downward parry to the inside of your attacker's left kicking leg. (Your left hand will check at your solar plexus.","As your attacker follow through with his right knife thrust, execute a right inward parry followed by a left outward parry to the inside of your attacker's right arm. Instantly execute a right front kick to your attacker's groin.","Plant your right foot into a right neutral bow facing 3 o'clock as your right hand circles counterclockwise and executes a right middle knuckle strike to the inside of your attacker's right arm. Having continued the flow of your left arm, follow your right middle knuckle with a left outward parry to the inside of your attacker's right arm. Continue the flow with your right hand and execute a right inward elbow to your attacker's lower rib cage.","Execute a left inward overhead claw to your attacker's nose as you follow immediately with a right rolling backfist to your attacker's face. Reverse the motion and pull your left foot to your right as you execute a right back hammerfist to your attacker's groin.","Now that you are in close to your attacker, execute a right obscure elbow. Follow the path of travel and turn it into an upward underhand claw to your attacker's face. Simultaneous with this motion, execute a left palm strike to your attacker's solar plexus as you execute a right front scoop kick to your attacker's groin.","This is the Unfurling Crane moment as you should be in a one-legged stance and your right hand above your head. Execute a right knife-edge kick to the inside of your attacker's right knee. A fraction of a second later, execute a right inward handsword to the left side of your attacker's neck."]},{"description":"Set 4: Unfurling Crane (Right Kick and Left Knife Thrust from 9:00)","steps":["An attacker at 9 o'clock comes at you with a right kick.","Land in a transitory right neutral bow facing 3 o'clock, cover into a left cat stance facing 9 o'clock. As you cover, execute a left outward downward parry to the inside of your attacker's right kicking leg. (Your right hand will check at your solar plexus.","As your attacker follow through with his left knife thrust, execute a left inward parry followed by a right outward parry to the inside of your attacker's left arm. Instantly execute a left front kick to your attacker's groin.","Plant your left foot into a left neutral bow facing 3 o'clock as your left hand circles counterclockwise and executes a left middle knuckle strike to the inside of your attacker's left arm. Having continued the flow of your right arm, follow your left middle knuckle with a right outward parry to the inside of your attacker's left arm. Continue the flow with your left hand and execute a left inward elbow to your attacker's lower rib cage.","Execute a right inward overhead claw to your attacker's nose as you follow immediately with a left rolling backfist to your attacker's face. Reverse the motion and pull your right foot to your left as you execute a left back hammerfist to your attacker's groin.","Now that you are in close to your attacker, execute a left obscure elbow. Follow the path of travel and turn it into an upward underhand claw to your attacker's face. Simultaneous with this motion, execute a right palm strike to your attacker's solar plexus as you execute a left front scoop kick to your attacker's groin.","This is the Unfurling Crane moment as you should be in a one-legged stance and your left hand above your head. Execute a left knife-edge kick to the inside of your attacker's left knee. A fraction of a second later, execute a left inward handsword to the right side of your attacker's neck.","Land in a transitory left neutral bow facing 9 o'clock."]},{"description":"Set 5: Clipping The Storm (From 12 o'clock: Right Club Thrust)","steps":["An attacker at 12 o'clock comes at you with a right club thrust.","Step your right foot to 7:30 into a left neutral bow facing 1:30 as you execute a right outward downward forearm parry to your attacker's right arm. As you settle into your stance, execute a left inward downward handsword to your attacker's right forearm. (Your right hand is now cocked at your right ear).","Pivot into a left forward bow as you execute a right downward handsword strike to the outside of your attacker's wrist. (Your left hand cocks palm in at your left ear).","Step your right to the outside of your attacker's right leg in a right cat stance as you execute a left outward inverted middle knuckle to your attacker's sternum. (Your right hand will slide down your attacker's right arm as a waiter check.)","Step your right foot to 1:30 into a right neutral bow behind your attacker's right leg as you execute right thrusting palm strike under your attacker's chin. (Your left hand will be at your attacker's right arm)."]},{"description":"Set 6: Clipping The Storm (Front: Left Club Thrust)","steps":["An attacker at 12 o'clock comes at you with a left club thrust.","Step your left foot to 4:30 into a right neutral bow facing 10:30 as you execute a left outward downward forearm parry to your attacker's left arm. As you settle into your stance, execute a right inward downward handsword to your attacker's left forearm. (Your left hand is now cocked at your left ear).","Pivot into a right forward bow as you execute a left downward handsword strike to the outside of your attacker's wrist. (Your right hand cocks palm in at your right ear).","Step your left to the outside of your attacker's left leg in a left cat stance as you execute a right outward inverted middle knuckle to your attacker's sternum. (Your left hand will slide down your attacker's left arm as a waiter check.)","Step your left foot to 10:30 into a left neutral bow behind your attacker's left leg as you execute left thrusting palm strike under your attacker's chin. (Your right hand will be at your attacker's left arm)."]},{"description":"Set 7: Thrusting Lance (Front: Low Right Knife Thrust)","steps":["An attacker at 12 o'clock comes at you with a low left knife thrust.","From your left neutral bow facing 10:30, step your left foot back to 6 o'clock into a right neutral bow facing 12 o'clock as you execute a right inward handsword to your attacker's radial nerve. Your right hand should immediately grab your attacker's right wrist in case the knife was not dropped.","Having disarmed your attacker, push drag forward as you execute a left underhand palm strike and grab to your attacker's groin. (Your right hand is still maintaining the right wrist grab).","Step your right foot back to 6 o'clock into a left neutral bow facing 12 o'clock. As you step, turn your attacker's wrist clockwise and manipulate your attacker's right arm with a lock and twist. Note: Be sure to use small circle on this and to keep the knife blade (if your attacker actually still has the blade) pointing away from you and towards your attacker.","Execute a left front kick to your attacker's left ribcage followed with a right front snap kick to your attacker's sternum.","Land forward into a right neutral bow facing 12 o'clock as you execute a right underhand stiff rising back knuckle under your attacker's chin while your left hand checks at your attacker's right shoulder.","As your strike passes through your attacker's head, reverse the motion and execute a right downward backfist to your attacker's nose.","Circle your right arm in a figure 8 manner. Follow through with your right backfist into a right inward hammerfist to your attacker's face. Immediately execute a right outward backfist to your attacker's right face."]},{"description":"Set 8: Thrusting Lance (Front: Low Left Knife Thrust)","steps":["An attacker at 12 o'clock comes at you with a low left knife thrust.","From your right neutral bow facing 12 o'clock,and within the flow of motion from the right backfist, step your right foot back to 6 o'clock into a left neutral bow facing 12 o'clock as you execute a left inward handsword to your attacker's radial nerve. Your left hand should immediately grab your attacker's left wrist in case the knife was not dropped.","Having disarmed your attacker, push drag forward as you execute a right underhand palm strike and grab to your attacker's groin. (Your left hand is still maintaining the left wrist grab).","Step your left foot back to 6 o'clock into a right neutral bow facing 12 o'clock. As you step, turn your attacker's wrist counterclockwise and manipulate your attacker's left arm with a lock and twist. Note: Be sure to use small circle on this and to keep the knife blade (if your attacker actually still has the blade) pointing away from you and towards your attacker.","Execute a right front kick to your attacker's right ribcage followed with a left front snap kick to your attacker's sternum.","Land forward into a left neutral bow facing 12 o'clock as you execute a left underhand stiff rising back knuckle under your attacker's chin while your right hand checks at your attacker's left shoulder.","As your strike passes through your attacker's head, reverse the motion and execute a left downward backfist to your attacker's nose.","Circle your left arm in a figure 8 manner. Follow through with your left backfist into a left inward hammerfist to your attacker's face. Immediately execute a left outward backfist to your attacker's left face."]},{"description":"Set 9: Raining Lance (Flank: Right Overhead Knife)","steps":["An attacker at 9 o'clock comes at you with a right overhead knife.","From your left neutral bow facing 12 o'clock and within the flow of motion from your backfist, step your left foot to 9 o'clock into a left neutral bow facing 9 o'clock as you execute a left inward parry to the outside of your attacker's right arm.","With the overhead attack still in motion, pivot clockwise into a horse stance facing 12 o'clock as your right hand assists your left into guiding your attacker's knife hand. Without losing momentum, pivot into a left neutral bow as you stab the knife into your attacker's right thigh.","Pivot into a left forward bow facing 9 o'clock as you execute a right inward elbow to your attacker's sternum to hold them vertical while your left hand continues to pin your attacker's right hand to their wounded thigh.","Pivot into a left neutral bow as your left hand tracks up your attacker's right arm into a palm up tiger's mouth strike to your attacker's throat. Simultaneous with this action, your right hand will switch and continue to press down on the knife in your attacker's thigh as well as check off their right hand.","Switch hands again, this time your left forearm pressing your attacker's thigh as your left hand grabs and squeezes your attacker's testicles. Simultaneously your right will circle counterclockwise and be palm up at your right shoulder. Execute a right tiger's mouth, using the forefinger and thumb to squeeze your attacker's eyes."]},{"description":"Set 10: Raining Lance (Flank: Left Overhead Knife)","steps":["An attacker from 3 o'clock comes at you with a left overhead knife attack.","From your left neutral bow facing 9 o'clock, cover your right foot back so you are in a right neutral bow facing 3 o'clock. Simultaneous with this step, continue the counterclockwise motion of the right tiger's mouth and execute a right inward parry to the outside of your attacker's left arm.","With the overhead attack still in motion, pivot clockwise into a horse stance facing 12 o'clock as your left hand assists your right into guiding your attacker's knife hand. Without losing momentum, pivot into a right neutral bow as you stab the knife into your attacker's left thigh.","Pivot into a right forward bow facing 3 o'clock as you execute a left inward elbow to your attacker's sternum to hold them vertical while your right hand continues to pin your attacker's left hand to their wounded thigh.","Pivot into a right neutral bow as your right hand tracks up your attacker's left arm into a palm up tiger's mouth strike to your attacker's throat. Simultaneous with this action, your left hand will switch and continue to press down on the knife in your attacker's thigh as well as check off their left hand.","Switch hands again, this time your right forearm pressing your attacker's thigh as your right hand grabs and squeezes your attacker's testicles. Simultaneously your left will circle counterclockwise and be palm up at your left shoulder. Execute a left tiger's mouth, using the forefinger and thumb to squeeze your attacker's eyes."]},{"description":"Set 11: Capturing The Storm (Front: Right Step-Through Overhead Club)","steps":["An attacker at 12 o'clock comes at you with a right step-through overhead club attack.","Step your left foot to 12 o'clock into a left neutral bow facing 12 o'clock as simultaneously execute a cross block (with your right wrist on top of your left) against your attacker's right arm. Note: For the sake of your head, angle your cross block off towards 1:30 so you are outside your attacker's line of attack.","Instantly grab your attacker's right wrist with both of your hands (left hand facing you, right facing away).","While maintaining the hold on your attacker's wrist, control and guide your attacker's wrist down, in a clockwise motion, so that your attacker's club strikes their own right knee. Continue to circle your attacker's right arm clockwise as you step towards 12 o'clock with your right foot into a front crossover. (This is done as your attacker's right arm is guided up and over your left shoulder above your head).","Retain the grab to your attacker's right wrist with your left hand as your right hand grabs the free end of your attacker's club.","Unwind from your crossover and step your left foot to 12 o'clock so you are in a right neutral bow facing 6 o'clock. As you settle into your stance bring your right hand, club included, down on to your attacker's right elbow.","Without hesitation, have your club circle clockwise, contouring up your attacker's right arm, strikes the back of your attacker's head and continues its clockwise arc, striking through the right knee.","Reverse the motion of your circle, so that your club strikes to the back of your attacker's right knee and continues in a counterclockwise arc.","As the club strikes the front of your attacker's head, simultaneously step your left leg to 6 o'clock into a front crossover as you sweep your attacker's right leg."]},{"description":"Set 12: Capturing The Storm (Rear: Left Step-Through Overhead Club)","steps":["An attacker at 6 o'clock comes at you with a left step-through overhead club attack.","Continuing the flow of motion from your crossover, step your right leg to 6 o'clock into a right neutral bow facing 6 o'clock as you simultaneously execute a cross block (with your left wrist on top of your right) against your attacker's left arm. Note: For the sake of your head, angle your cross block off towards 4:30 so you are outside your attacker's line of attack.","Instantly grab your attacker's left wrist with both of your hands (right hand facing you, left facing away).","While maintaining the hold on your attacker's wrist, control and guide your attacker's wrist down, in a clockwise motion, so that your attacker's club strikes their own left knee. Continue to circle your attacker's left arm counterclockwise as you step towards 6 o'clock with your left foot into a front crossover. (This is done as your attacker's left arm is guided up and over your right shoulder above your head).","Retain the grab to your attacker's left wrist with your right hand as your left hand grabs the free end of your attacker's club.","Unwind from your crossover and step your right foot to 6 o'clock so you are in a left neutral bow facing 12 o'clock. As you settle into your stance bring your left hand, club included, down on to your attacker's left elbow.","Without hesitation, have your club circle counterclockwise, contouring up your attacker's left arm, striking the back of your attacker's head and continues its counterclockwise arc, striking through the left knee.","Reverse the motion of your circle, so that your club strikes to the back of your attacker's left knee and continues in a clockwise arc.","As the club strikes the front of your attacker's head, simultaneously step your right leg to 12 o'clock into a front crossover as you sweep your attacker's left leg."]},{"description":"Set 13: Circling The Storm (Front: Right Club Thrust)","steps":["An attacker at 12 o'clock comes at you with a right club thrust towards your mid-section.","Continue the flow of motion from the sweep and step your left foot to 12 o'clock into a left neutral bow facing 12 o'clock as you simultaneously execute a left inward block to the outside of your attacker's right arm. (Your right hand is chambered at your right hip.)","Step your right foot to 11 o'clock as you simultaneously execute a right inward elbow to your attacker's lower ribs. Utilize torque as you rotate counterclockwise into a left neutral bow facing 6 o'clock as you execute a left outward elbow to your attacker's solar plexus. (Your right hand will check at your attacker's right arm).","Hop to 12 o'clock with your left foot into a left one-legged stance as you simultaneously execute a right inward palm claw to your attacker's face. (Your left hand will now positionally check low.)","Execute a right knife-edge kick to the back of your attacker's left knee.","Land your right foot to 6 o'clock into a right neutral bow as you continue the flow of your right claw and execute a right downward outward underhand claw to the back and underside of your attacker's groin. (Your left hand should check across your attacker's back with your fingers pointing to your right.)","Circle your right hand counterclockwise and execute a right inward palm claw to your attacker's face while maintaining the left check across your attacker's back.","When your right hand completes its strike, have it drop to a positional check against your attacker's arms as your left leg executes a left front crossover sweep to 6 o'clock. As you settle into the twist stance, execute a left underhand claw to the back and underside of your attacker's groin."]},{"description":"Set 14: Circling the Storm (Rear: Left Club Thrust)","steps":["An attacker at 6 o'clock comes at you with a left club thrust to your midsection","Continue the flow of motion from the sweep and step your right foot to 6 o'clock into a right neutral bow facing 6 o'clock as you simultaneously execute a right inward block to the outside of your attacker's left arm. (Your left hand is chambered at your left hip.)","Step your left foot to 7 o'clock as you simultaneously execute a left inward elbow to your attacker's lower ribs. Utilize torque as you rotate clockwise into a right neutral bow facing 12 o'clock as you execute a right outward elbow to your attacker's solar plexus. (Your left hand will check at your attacker's left arm).","Hop to 6 o'clock with your right foot into a right one-legged stance as you simultaneously execute a left inward palm claw to your attacker's face. (Your right hand will now positionally check low.)","Execute a left knife-edge kick to the back of your attacker's right knee.","Land your left foot to 12 o'clock into a left neutral bow as you continue the flow of your left claw and execute a left downward outward underhand claw to the back and underside of your attacker's groin. (Your right hand should check across your attacker's back with your fingers pointing to your left.)","Circle your left hand clockwise and execute a left inward palm claw to your attacker's face while maintaining the right check across your attacker's back.","When your left hand completes its strike, have it drop to a positional check against your attacker's arms as your right leg executes a right front crossover sweep to 12 o'clock. As you settle into the twist stance, execute a right underhand claw to the back and underside of your attacker's groin."]},{"description":"Set 15: Escape From The Storm (Flank: Right Step-Through Overhead Club)","steps":["An attacker at 3 o'clock comes at you with a right step-through overhead club.","From your twist stance, leap to 3 o'clock first with your left foot then your right into a right neutral bow facing 3 o'clock as you execute a left inward parry to the outside of your attacker's arm while you simultaneously execute a right palm strike to your attacker's jaw. (Your right arm should end under and inside your attacker's right arm.)","Step your left foot to 3 o'clock into a left close kneel as you strike your attacker's solar plexus with a right vertical elbow. (Be sure to continue checking your attacker's right arm with your left hand).","While in your left close kneel, execute a right underhand claw to your attacker's groin.","Without hesitation, pivot clockwise and step your right foot to 3 o'clock into a left neutral bow facing 9 o'clock as you pull your attacker's right leg toward you with your right hand while simultaneously pushing forward at your attacker's right hip. (As you do this move, slide your right hand to your attacker's knee).","Execute a right front crossover to 9 o'clock into a low right front twist stance. As you settle into this stance, drop your attacker's right knee across your right, breaking it. Note: Watch the angle of contact between your right leg and your attacker's leg. A correct Angle of Incidence will insure optimal power.","Execute a left inward palm strike to the inside of your attacker's right thigh to clear their leg off your right knee.","Pivot counterclockwise into a right close kneel stance as you execute a right underhand crane strike (palm up) to your attacker's groin. (Your left hand should check across your attacker's hips).","Continue to pivot counterclockwise into a right reverse close kneel stance as you loop your right hand counterclockwise as well and strike again to your attacker's groin with a right underhand crane strike (palm up). (Your left hand should remain checking at your attacker's hip).","Execute a left front crossover towards your attacker into a low left front twist stance. As you settle, execute a left underhand crane strike (palm up) to your attacker's groin. (Your right hand is now checking across your attacker's hips)."]},{"description":"Set 16: Escape from the Storm (Flank: Left Step-Through Overhead Club)","steps":["An attacker at 9 o'clock comes at you with a left step-through overhead club.","From your twist stance, leap to 9 o'clock first with your right foot then your left into a left neutral bow facing 9 o'clock as you execute a right inward parry to the outside of your attacker's arm while you simultaneously execute a left palm strike to your attacker's jaw. (Your left arm should end under and inside your attacker's left arm.)","Step your right foot to 9 o'clock into a right close kneel as you strike your attacker's solar plexus with a left vertical elbow. (Be sure to continue checking your attacker's left arm with your right hand).","While in your right close kneel, execute a left underhand claw to your attacker's groin.","Without hesitation, pivot counterclockwise and step your left foot to 9 o'clock into a right neutral bow facing 3 o'clock as you pull your attacker's left leg toward you with your left hand while simultaneously pushing forward at your attacker's left hip. (As you do this move, slide your left hand to your attacker's knee).","Execute a left front crossover to 3 o'clock into a low left front twist stance. As you settle into this stance, drop your attacker's left knee across your left, breaking it. Note: Watch the angle of contact between your left leg and your attacker's leg. A correct Angle of Incidence will insure optimal power.","Execute a right inward palm strike to the inside of your attacker's left thigh to clear their leg off your left knee.","Pivot clockwise into a left close kneel stance as you execute a left underhand crane strike (palm up) to your attacker's groin. (Your right hand should check across your attacker's hips).","Continue to pivot clockwise into a left reverse close kneel stance as you loop your left hand clockwise as well and strike again to your attacker's groin with a left underhand crane strike (palm up). (Your right hand should remain checking at your attacker's hip).","Execute a right front crossover towards your attacker into a low right front twist stance. As you settle, execute a right underhand crane strike (palm up) to your attacker's groin. (Your left hand is now checking across your attacker's hips)."]},{"description":"Set 17: Entwined Lance (Front: Right Step-Through Knife Thrust)","steps":["An attacker at 12 o'clock comes at you with a right step-through knife thrust.","Step your left foot to 12 o'clock as you pivot into a left front rotating twist stance. As you step, have your left hand hook as a waiter hand to the inside of your attacker's right wrist. (Your right hand cocks at your right hip).","Without hesitation step your right foot to 12 o'clock into a right fighting horse stance as you execute a right palm strike to your attacker's jaw. Note: Your right knee should buckle the inside of your attacker's right knee and your left hand should grab your attacker's right wrist.","Execute a right front crossover sweep to your attacker's right leg. As you sweep, slide your right hand down your attacker's right arm to control their right wrist.","Shift into a left one-legged stance as you simultaneously execute a left two-finger poke to your attacker's eyes.","Execute a right knife-kick to your attacker's left knee.","Land in a right neutral bow facing 12 o'clock as you convert your left finger poke into a left hand grab of your attacker's right wrist. Simultaneously execute a right backfist to your attacker's right ribs."]},{"description":"Set 18: Entwined Lance (Front: Left Step-Through Knife Thrust)","steps":["An attacker at 12 o'clock comes at you with a left step-through knife thrust.","Step your right foot to 12 o'clock as you pivot into a right front rotating twist stance. As you step, have your right hand hook as a waiter hand to the inside of your attacker's left wrist. (Your left hand cocks at your left hip).","Without hesitation step your left foot to 12 o'clock into a left fighting horse stance as you execute a left palm strike to your attacker's jaw. Note: Your left knee should buckle the inside of your attacker's left knee and your right hand should grab your attacker's left wrist.","Execute a left front crossover sweep to your attacker's left leg. As you sweep, slide your left hand down your attacker's left arm to control their left wrist.","Shift into a right one-legged stance as you simultaneously execute a right two-finger poke to your attacker's eyes.","Execute a left knife-kick to your attacker's right knee.","Land in a left neutral bow facing 12 o'clock as you convert your right finger poke into a right hand grab of your attacker's left wrist. Simultaneously execute a left backfist to your attacker's left ribs."]},{"description":"Set 19: Capturing The Rod (Right Hand Gun from 3 o'clock)","steps":["An attacker at 3 o'clock puts a gun in their right hand against your chest.","Step your right foot to 3 o'clock into a right neutral bow while you pivot your upper body to face 12 o'clock in order to get out of the line of fire. Simultaneous with this motion, execute a left outward parry while grabbing the pistol at chamber or hammer with your right hand.","With your right hand controlling the pistol, execute a left two-finger poke to your attacker's eyes. Snap your left hand back to assist your right hand by grabbing under the barrel and trigger guard of the pistol.","Step your right foot to 9 o'clock into a left neutral bow facing 3 o'clock as both of your hands twist your attacker's wrist and gun clockwise. Complete the twist and lock so that you force the handle towards you and the barrel towards your attacker's head or body.","Immediately pivot into a left forward bow you have your right hand yank the gun away from your attacker's grip while your left hand still checks the pistol hand simultaneous with a right front kick to your attacker's groin.","Land in a right neutral bow facing 3 o'clock as you execute a right stiff arm lifting strike with the butt of the gun. (This strike should go up and diagonal to the right as it hits your attacker's jaw)."]},{"description":"Set 20: Capturing the Rod (Left Hand Gun from 9 o'clock)","steps":["An attacker at 9 o'clock with a gun in their left hand puts the pistol against your chest.","Step your left foot to 9 o'clock into a left neutral bow while you pivot your upper body to face 12 o'clock in order to get out of the line of fire. Simultaneous with this motion, execute a right outward parry while grabbing the pistol at chamber or hammer with your left hand.","With your left hand controlling the pistol, execute a right two-finger poke to your attacker's eyes. Snap your right hand back to assist your left hand by grabbing under the barrel and trigger guard of the pistol.","Step your left foot to 3 o'clock into a right neutral bow facing 9 o'clock as both of your hands twist your attacker's wrist and gun counterclockwise. Complete the twist and lock so that you force the handle towards you and the barrel towards your attacker's head or body.","Immediately pivot into a right forward bow you have your left hand yank the gun away from your attacker's grip while your right hand still checks the pistol hand simultaneous with a left front kick to your attacker's groin.","Land in a left neutral bow facing 9 o'clock as you execute a left stiff arm lifting strike with the butt of the gun. (This strike should go up and diagonal to the left as it hits your attacker's jaw)."]},{"description":"Set 21: Broken Rod (Right Hand Gun from Behind (4:30 in the form))","steps":["An attacker at 4:30 has a gun in their right hand against your back.","From your left neutral bow facing 9 o'clock, pivot clockwise into a right transitional front rotating twist stance as your right foot moves towards 4:30. To make sure you are out of your attacker's line of fire, you will be pivoting on your left foot while simultaneously executing a right outward hooking parry (waiter hand) to the outside of your attacker's wrist.","Without hesitation, step your left foot to 4:30 into a left neutral bow making sure that your left leg checks the inside of your attacker's right knee. Simultaneously grab your attacker's right hand including the pistol as you execute a left uppercut to the underside of your attacker's elbow to break your attacker's elbow and control where the gun is pointed.","Slightly step your left foot to 10:30 as your right foot steps to 4:30 into a right neutral bow to aid you in buckling the inside of your attacker's right knee. Simultaneous with this step, have your left hand gravitationally check your attacker's right shoulder as your right hand pulls the gun from your attacker's hand.","Execute a right upward strike to your attacker's chin with the pistol. In the same flow of motion, loop the pistol clockwise and strike diagonally down to your left with the butt of the pistol."]},{"description":"Set 22: Broken Rod (Left Hand Gun from Behind (7:30 in the form))","steps":["An attacker at 7:30 has a gun in their left hand against your back.","From your right neutral bow facing 4:30 pivot counterclockwise into a left transitional front rotating twist stance as your left foot moves towards 7:30. To make sure you are out of your attacker's line of fire, you will be pivoting on your right foot while simultaneously executing a left outward hooking parry (waiter hand) to the outside of your attacker's wrist.","Without hesitation, step your right foot to 4:30 into a right neutral bow making sure that your right leg checks the inside of your attacker's left knee. Simultaneously grab your attacker's left hand, including the pistol, with your left hand as you execute a right uppercut to the underside of your attacker's elbow to break your attacker's elbow and control where the gun is pointed.","Slightly step your right foot to 1:30 as your left foot steps to 7:30 into a left neutral bow to aid you in buckling the inside of your attacker's left knee. Simultaneous with this step, have your right hand gravitationally check your attacker's left shoulder as your left hand pulls the gun from your attacker's hand.","Execute a left upward strike to your attacker's chin with the pistol. In the same flow of motion, loop the pistol counterclockwise and strike diagonally down to your right with the butt of the pistol."]},{"description":"Set 23: Defying The Rod (Right Hand Gun from Front (1:30 in the form))","steps":["An attacker at 1:30 has a gun in their right hand pointed at you.","From your left neutral bow facing 7:30, step your left foot 1:30 and pivot counterclockwise into a left front rotating twist stance as you simultaneously execute a left outward hooking parry (waiter's hand) to the inside and top of your attacker's right hand. (Your right hand is near your solar plexus).","Without hesitation, grab your attacker's right hand at the pistol as you simultaneously execute a right front kick to your attacker's groin with a right two finger eye poke to your attacker's eyes.","Plant your right foot to 1:30 into a right neutral bow as you buckle to the inside of your attacker's right knee and execute a right inward strike to the inside of your attacker's right forearm. Note: To add to the momentum of this inward strike, have your left hand yank their right arm down and to your left.","Instantly execute a right upward flapping elbow to the underside of your attacker's chin.","Have your right hand grab the gun from your attacker as you maintain control of their arm with your left hand. Immediately have your right foot step to 7:30 into a left neutral bow facing 1:30 as you execute a right outward and diagonally downward strike to the back and left side of your attacker's neck. Note: This should hook your attacker's neck between the gun and your hand.","Anchor your right elbow to push your attacker down. Simultaneously execute a right front knee kick to your attacker's chest. Simultaneous with this knee strike, continue to circle the butt of the pistol and your hand counterclockwise and execute a right inward overhead hammering strike with the butt of the gun to your attacker's spine.","Plant your right foot to 1:30 into a right neutral bow facing 1:30 as your hands are up guarding."]},{"description":"Set 24: Defying the Rod (Left Hand Gun from Front (1:30 in the form))","steps":["An attacker at 10:30 has a gun in their left pointing at you.","From your right neutral bow facing 1:30, step your right foot 10:30 and pivot clockwise into a right front rotating twist stance as you simultaneously execute a right outward hooking parry (waiter's hand) to the inside and top of your attacker's left hand. (Your left hand is near your solar plexus).","Without hesitation, grab your attacker's left hand at the pistol as you simultaneously execute a left front kick to your attacker's groin with a left two finger eye poke to your attacker's eyes.","Plant your left foot to 10:30 into a left neutral bow as you buckle to the inside of your attacker's left knee and execute a left inward strike to the inside of your attacker's left forearm. Note: To add to the momentum of this inward strike, have your right hand yank their left arm down and to your right.","Instantly execute a left upward flapping elbow to the underside of your attacker's chin.","Have your left hand grab the gun from your attacker as you maintain control of their arm with your right hand. Immediately have your left foot step to 4:30 into a right neutral bow facing 10:30 as you execute a left outward and diagonally downward strike to the back and right side of your attacker's neck. Note: This should hook your attacker's neck between the gun and your hand.","Anchor your left elbow to push your attacker down. Simultaneously execute a left front knee kick to your attacker's chest. Simultaneous with this knee strike, continue to circle the butt of the pistol and your hand clockwise and execute a left inward overhead hammering strike with the butt of the gun to your attacker's spine.","Plant your right foot to 1:30 into a right neutral bow facing 1:30 as your hands are up guarding."]},{"description":"Set 25: Twisted Rod (Right Gun from 3 o'clock)","steps":["An attacker at 3 o'clock has a gun in their right hand pointed towards your midsection","From your right neutral bow facing 10:30, step into a left rear crossover towards 4:30 and instantly spring out of your twist stance by having your right foot step to 1:30 and then pivot clockwise into a right front rotating twist stance, facing 3 o'clock. As you pivot into your twist stance, execute a right outward hooking parry (waiter's hand) to the outside and on top of your attacker's right hand at the pistol.","Step your left foot to 3 o'clock into a left neutral bow facing 3 o'clock as you simultaneously grab your attacker's gun with your left hand. Note: For the sake of not getting shot, keep your stance to the outside of your attacker's right arm.","Step your right foot to 3 o'clock into a right neutral bow as you pin and press the back of your attacker's right hand with your right forearm. (You will push with your right hand and pull with your left. The end result is that you have forced your attacker's pistol to point back at their face).","Pivot into a left forward bow facing 9 o'clock as you twist and break your attacker's right wrist and cause them to fall onto their back.","Execute a right shovel kick (striking first with ball of foot and following through to strike with heel) to your attacker's right ribs.","Follow through with the kick to a greater height and come crashing down with a right heel stomp to your attacker's left shoulder.","Plant your right foot just above your attacker's shoulder. Pivot counterclockwise into a left close kneel as you drop your right knee in to your attacker's throat. As you strike to the throat, execute a right two-finger poke to your attacker's eyes."]},{"description":"Set 26: Twisted Rod (Left Gun from 9 o'clock)","steps":["An attacker at 9 o'clock has a gun in their left hand pointed towards your midsection","From your left close kneel, step into a right rear crossover towards 7:30 and instantly spring out of your twist stance by having your left foot step to 10:30 and then pivot counterclockwise into a left front rotating twist stance, facing 9 o'clock. As you pivot into your twist stance, execute a left outward hooking parry (waiter's hand) to the outside and on top of your attacker's left hand at the pistol.","Step your right foot to 9 o'clock into a right neutral bow facing 9 o'clock as you simultaneously grab your attacker's gun with your right hand. Note: For the sake of not getting shot, keep your stance to the outside of your attacker's left arm.","Step your left foot to 9 o'clock into a left neutral bow as you pin and press the back of your attacker's left hand with your left forearm. (You will push with your left hand and pull with your right. The end result is that you have forced your attacker's pistol to point back at their face).","Pivot into a right forward bow facing 3 o'clock as you twist and break your attacker's left wrist and cause them to fall onto their back.","Execute a left shovel kick (striking first with ball of foot and following through to strike with heel) to your attacker's left ribs.","Follow through with the kick to a greater height and come crashing down with a left heel stomp to your attacker's right shoulder.","Plant your left foot just above your attacker's shoulder. Pivot clockwise into a right close kneel as you drop your left knee in to your attacker's throat. As you strike to the throat, execute a left two-finger poke to your attacker's eyes."]},{"description":"Set 27: Hand Isolations","steps":["Step your left foot to 4:30 into a rear crossover. Spring from your twist stance by stepping your right foot to 3 o'clock into a horse stance facing 12 o'clock","As you settle into your horse stance the isolations begin. Execute a right outward parry and grab simultaneous with a left inward horizontal palm strike.","Execute a right outward downward parry (crane shape) simultaneous with a left inward parry.","Execute a left outward parry and grab simultaneous with a right inward horizontal palm strike.","Execute a left outward downward parry (crane shape) simultaneous with a right inward parry.","Execute a right outward hooking parry (waiter hand) followed by a left grab, followed by a right inward break.","Execute a left outward hooking parry (waiter hand) followed by a right grab, followed by a left inward break."]},{"description":"Closing","steps":["As the left inward elbow strikes, pull it back into the first move of the full Kenpo salutation. Go through the Salutation and stop at the praying hands.","Have your left foot slide to your right into an attention stance as your hands drop (palm up). Have them circle, (right arm counterclockwise; left clockwise) into a final position as double push down blocks in front of your groin.","Place hands natural to an attention stance.","Bow."]}]}