{"steps":[{"description":"Set 1: Destructive Fans (Left Flank- Right Step-Through Punch)","steps":["An attacker from 9 o'clock throws a right step-through punch.","Step your left foot towards 8:30 into a horse stance facing 12 o'clock as you simultaneously execute a right outward parry and a left inward parry to your attacker's punch. Your right hand continues its clockwise motion as you settle into your stance and execute a right inward hammerfist (palm up) to your attacker's solar plexus. (Your left hand will remain at your attacker's right elbow as a bracing angle check.)","Execute a left front crossover towards 3 o'clock to sweep against the inside of your attacker's right leg as you chamber your hands at your left hip, right over left.","From your crossover, pivot clockwise and execute a right outward backfist to your attacker's ribs. Continue this motion and execute a right spinning stiff-leg sweep to your attacker's right leg. Note: This is a circular to linear sweep. Your sweep will buckle the back of your attacker's right leg.","Settle into a right forward facing 9 o'clock as you execute a right punch to their face. (Your left hand will be positioned underneath your punch."]},{"description":"Set 2: Destructive Fans (Right Flank- Left Step-Through Punch)","steps":["An attacker from 3 o'clock comes at you with a left step-through punch.","From the Point of Contact of your right punch, step your right foot to 3:30 into a horse stance facing 12 o'clock as you simultaneously execute a left outward parry and a right inward parry to your attacker's punch. Your left hand continues its counterclockwise motion as you settle into your stance and execute a left hammerfist (palm up) to your attacker's solar plexus. (Your right hand will remain at your attacker's left elbow as a bracing angle check.)","Execute a right front crossover to 9 o'clock to sweep against the inside of your attacker's left leg. As you sweep, chamberyour hands at your right hip, left over right.","From your crossover, pivot counterclockwise and execute a left outward backfist to your attacker's ribs. Continue this motion and execute a left spinning stiff-leg sweep to your attacker's left leg. Note: This is a circular to linear sweep. Your sweep will buckle the back of your attacker's left leg.","Settle into a left forward bow facing 3 o'clock as you execute a left punch to your attacker's face. Your right hand will be checking under your left punch."]},{"description":"Set 3: Dance of Death (Front- Right Step-Through Kick / Punch)","steps":["An attacker at 12 o'clock throws a right step-through kick / right straight punch combination.","Have your right foot slide to your left and then step to 6 o'clock into a left neutral bow facing 12 o'clock as you execute a left outward downward parry to the inside of your attacker's kick. Immediately execute a left inward parry to the outside of your attacker's right punch.","Pivot into a left forward bow facing 12 o'clock as you execute a right reverse handsword to your attacker's groin. Note: Your left hand will remain a bracing angle check on your attacker's right arm.","Switch your hands so your right is now high against your attacker's right arm and your left is low. Execute a right step-through knee kick to your attacker's groin.","Land in a right neutral bow facing 12 o'clock as you simultaneously execute a right inward elbow as you grab the back of your attacker's right knee and pull towards you. Note: This move should knock them on their back. The pull and strike must counteract each other to be effective.","Execute a right backfist to your attacker's left knee. Note: This is done in case of an unintentional move; their left leg may come up when they are dropped to the ground.","Drop into a right wide kneel stance and take advantage of marriage of gravity and execute a right inward handsword onto your attacker's groin.","Release your left hand and slide it from the outside of your attacker's right heel to the top of their toes. Simultaneously grab your attacker's right heel with your right hand.","Twist clockwise as you roll them over onto their stomach. You are also pivoting from a wide kneel to a right neutral bow.","Release your attacker's leg and execute a left stomp to your attacker's lower spine.","Plant your right foot to 4:30 so you are standing to the side of your attacker's body.","Execute a left stomp so it pinches the right side of your attacker's right side. Drop into a left wide kneel as you utilize marriage of gravity and execute a right handsword down on the back of your attacker's neck. Note: You will actually check your attacker's right shoulder blade as you sink into your stance.","Raise up into a one-legged stance as you execute a right stomp to your attacker's upper spine.","Step your left foot to 10:30 by your attacker's head. Execute a right rear kick to your attacker's head."]},{"description":"Set 4: Dance of Death (Rear- Left Step-Through Kick / Punch)","steps":["An attacker at 6 o'clock throws a left step-through kick / left straight punch combination.","Step your right foot into a right front crossover facing 10:30. (During your step, your hands should check low. Have your left foot step back to 12 o'clock into a right neutral bow facing 6 o'clock as you execute a left outward downward parry to the outside of your attacker's kick. Immediately execute a right inward parry to the outside of your attacker's left punch.","Pivot into a right forward bow facing 6 o'clock as you execute a left reverse handsword to your attacker's groin. Note: Your right hand will remain a bracing angle check on your attacker's left arm.","Switch your hands so your left is now high against your attacker's left arm and your right is low. Execute a left step-through knee kick to your attacker's groin.","Land in a left neutral bow facing 6 o'clock as you simultaneously execute a left inward elbow as you grab the back of your attacker's left knee and pull towards you. Note: This move should knock them on their back. The pull and strike must counteract each other to be effective.","Execute a left backfist to your attacker's right knee. Note: This is done in case of an unintentional move; their right leg may come up when they are dropped to the ground.","Drop into a left wide kneel stance and take advantage of marriage of gravity and execute a left inward handsword onto your attacker's groin.","Release your right hand and slide it from the outside of your attacker's left heel to the top of their toes. Simultaneously grab your attacker's left heel with your left hand.","Twist counterclockwise as you roll them over onto their stomach. You are also pivoting from a wide kneel to a right neutral bow.","Release your attacker's leg and execute a right stomp to your attacker's lower spine.","Plant your left foot to 7:30 so you are standing to the side of your attacker's body.","Execute a right stomp so it pinches the left side of your attacker's left side. Drop into a right wide kneel as you utilize marriage of gravity and execute a left handsword down on the back of your attacker's neck. Note: You will actually check your attacker's left shoulder blade as you sink into your stance.","Raise up into a one-legged stance as you execute a left stomp to your attacker's upper spine.","Step your right foot to 1:30 by your attacker's head. Execute a left rear kick to your attacker's head."]},{"description":"Set 5: Leap of Death (Front- Right Step-Through Punch)","steps":["From the Point of Contact of your kick, execute a left front crossover towards 7:30.","An attacker at 9 o'clock comes at you with a right step-through punch.","Pivot clockwise and step your right foot to 3 o'clock into a left neutral bow facing 9 o'clock as you simultaneously execute a right outward parry to your attacker's punch.","Utilize borrowed force and ride this motion into a left reverse bow as you execute a left palm strike to your attacker's elbow.","Pivot into a left forward bow facing 9 o'clock as you execute a left backfist into your attacker's ribs.","Reverse the flow of your motion for a second time as you pivot back into a left reverse bow and simultaneously deliver a left palm strike to your attacker's right shoulder. Note: Push your attacker down to the ground so they are laying on their stomach.","Leap into the air above your attacker. Land in a diamond stance on your attacker so your heels strike your attacker's kidneys. (Right foot to right kidney; left to left.)","Slide your feet off your attacker's kidneys and take advantage of your attacker's reaction by executing simultaneous inward palm strikes to the back of your attacker's jaw. Note: This should drive your attacker's face to the ground.","Switch into a concave stance as you simultaneously wrap your hands under your attacker's chin and pull up. Note: This more drives your knees into your attacker's back and stretches out their neck and chest.","Twist your attacker's head clockwise to snap their neck. (This is done by pulling on the chin with your right hand and pushing on the head with your left hand.)","Execute a right inward handsword to your attacker's nose.","Switch to a right close kneel as you simultaneously drop your knee onto your attacker's spine and execute a left push to the back of your attacker's head, which will force their head to bounce off the ground.","Leap up and twist your body counterclockwise in the air. Land with your left to 6 o'clock, or to the right of your attacker's body. As you land, execute a right round kick to your attacker's head."]},{"description":"Set 6: Leap of Death (Rear- Left Step-Through Punch)","steps":["An attacker at 3 o'clock comes at you with a left step-through punch. From the Point of Contact of your right kick, step your right foot to 9 o'clock into a right front crossover as you simultaneously execute a left outward parry to your attacker's punch.","Step your left foot to 9 o'clock into a right reverse bow facing 3 o'clock as you utilize borrowed force and ride your attacker's punch.","Continue this motion and execute a right palm strike to your attacker's elbow.","Pivot into a right forward bow facing 3 o'clock as you execute a right backfist into your attacker's ribs.","Reverse the flow of your motion for a second time as you pivot back into a right reverse bow and simultaneously deliver a right palm strike to your attacker's left shoulder. Note: Push your attacker down to the ground so they are laying on their stomach.","Leap into the air above your attacker. Land in a diamond stance on your attacker so your heels strike your attacker's kidneys. (Right foot to right kidney; left to left.)","Slide your feet off your attacker's kidneys and take advantage of your attacker's reaction by executing simultaneous inward palm strikes to the back of your attacker's jaw. Note: This should drive your attacker's face to the ground.","Switch into a concave stance as you simultaneously wrap your hands under your attacker's chin and pull up. Note: This more drives your knees into your attacker's back and stretches out their neck and chest.","Twist your attacker's head counterclockwise to snap their neck. (This is done by pulling on the chin with your left hand and pushing on the head with your right hand.)","Execute a left inward handsword to your attacker's nose.","Switch to a left close kneel as you simultaneously drop your knee onto your attacker's spine and execute a right push to the back of your attacker's head, which will force their head to bounce off the ground.","Leap up and twist your body clockwise in the air. Land with your right foot to 6 o'clock, or to the left of your attacker's body. As you land, execute a left round kick to your attacker's head."]},{"description":"Set 7: Back Breaker (Front- Right Step-Through Punch)","steps":["From the Point of Contact of your left kick execute a left front crossover stomp on the 3 o'clock line.","Execute a right downward round kick to your fallen attacker; staying on the 3 o'clock line.","Pivot counterclockwise while stepping with your left foot on the 3 o'clock line into a left neutral bow facing 3 o'clock. Simultaneously with these steps, have both your hands open, left hand at your left hip and right hand across the front of your body.","An attacker at 4:30 throws a right step-through punch at you.","Step your right foot to 4:30 as you execute a left inward parry to the outside of your attacker's arm followed by a right outward parry above your attacker's elbow.","Step your left foot to 4:30 into a horse stance facing 7:30 as your right hand grabs your attacker's right shoulder as your left hand grabs their left shoulder.","Immediately step your right foot to 4:30 into a left neutral bow facing 10:30 as you simultaneously pull your attacker's shoulders back towards you to disturb their balance.","Execute a right knee strike to your attacker's lower spine while anchoring your elbows in. Land back in a left neutral bow forcing your attacker across your left knee. Note: Your hands will be level with your hips.","Grab your attacker's chin with your right hand as your left hand grabs your attacker's head. Twist clockwise breaking your attacker's neck.","Reverse the motion of your right hand and execute a right inward handsword down onto your attacker's nose. Note: Your left hand will slide to check at your attacker's right shoulder.","Execute raking claws up to your attacker's face.","Reverse that motion and execute two downward backfists directly onto your attacker's collarbones. Note: Your right hand will travel counterclockwise, your left hand clockwise.","As soon as your strike sandwiches, step back to 4:30 with your left foot as you drop into a right close kneel facing 10:30 as you execute two claws to your attacker's face."]},{"description":"Set 8: Back Breaker (Front- Left Step-Through Punch)","steps":["From your right close kneel, pivot clockwise into a front twist stance facing 12 o'clock.","Execute a left downward round kick to your previous attacker's groin, staying on the 9 o'clock line.","Pivot clockwise by stepping your right foot to 9 o'clock so you end in a right neutral bow facing 9 o'clock. Note: During these steps, have your hands open with your right hand on your hip and your left across the front of your body.","An attacker at 7:30 throws a left step-through straight punch at you.","Step your left foot to 7:30 into a left neutral bow as you execute a right inward parry to the outside of your attacker's left arm. Immediately follow with a left outward parry above your attacker's left elbow.","Step to 7:30 with your right foot as your left hand grabs your attacker's left shoulder and your right hand grabs your attacker's right shoulder.","Immediately step your left foot to 7:30 into a right neutral bow facing 1:30. Simultaneously pull your attacker's shoulders to you.","Execute a left knee strike to your attacker's lower spine.","As you land back in that right neutral bow, pull your attacker onto your right knee striking their upper spine. Note: Your hands will end up anchored in and level with your hips.","Grab your attacker's chin with your left hand as your right hand grabs to the left of your attacker's head. Instantly twist counterclockwise breaking your attacker's neck.","Reverse the motion of your left hand as you execute a left inward handsword down onto your attacker's nose.","Execute two upward claws to your attacker's face.","Reverse that motion and execute two downward backfists directly onto your attacker's collarbones. (Left fist to left joint, right to right.)","As soon as you feel the effects of the sandwich, step your right foot to 7:30 into a left close kneel facing 1:30 as you execute simultaneous claws to your attacker's face."]},{"description":"Set 9: Hopping Crane (Downed Attacker- On Stomach, Head Towards 12 o'clock)","steps":["Your next attacker is in front of you at 12 o'clock. They are on their stomach with their head towards 12 o'clock. As your attacker rises by pushing up with his hands, you begin to follow up.","From your left reverse bow, pivot counterclockwise into a left front twist stance facing 12 o'clock. (Your hands are open left hand at left hip, right arm across your body.)","Step your right foot to 12 o'clock.","Hop your right foot. Land on your left foot as you execute a right thrusting sweep kick to your attacker's left elbow.","Execute a right thrusting knife-edge kick to your attacker's body. Note: On the sweep and the kick you will use your hands as counterbalance."]},{"description":"Set 10: Hopping Crane (Downed Attacker- On Stomach, Head Towards 12 o'clock)","steps":["Your next attacker is in front of you at 12 o'clock. They are on their stomach with their head towards 12 o'clock. As your attacker rises by pushing up with his hands, you begin to follow up.","From the Point of Contact of your right kick, plant into a right front twist stance facing 12 o'clock. (Your right hand is at your right hip, left arm across your body.)","Step your left foot to 12 o'clock.","Hop your left foot. Land on your right foot as you execute a left thrusting sweep kick to your attacker's right elbow.","Execute a left knife-edge kick to your attacker's body. Note: On the sweep and the kick you will use your hands as counterbalance."]},{"description":"Set 11: Sleeper (Rear- Right Step-Through Kick / Punch)","steps":["From the Point of Contact of your left kick, step your left foot forward to 12 o'clock into a twist stance. (Your left hand is at your left hip, right hand across your body.","An attacker at 6 o'clock comes at you with a right step-through front kick.","Pivot clockwise into a right neutral bow facing 6 o'clock.","Instantly slide your right foot into a cat stance as you execute a right downward parry to the outside of your attacker's leg. Note: In the form, this should appear as Angle Matching above your right knee.) Simultaneously execute a left inward parry to your attacker's follow-through right punch. Note: This parry should also appear as Angle Matching with your face.)","Execute a right stomp to buckle behind your attacker's right leg. (Which has, as a result at the misfired kick, planted past you.)","Step your left foot to 6 o'clock into a left neutral bow facing 6 o'clock as you simultaneously execute a left inward block to your attacker's right arm.","Pivot into a left forward bow as you execute a right ridge hand to the left side of your attacker's neck (Your left is now a bracing angle check against your attacker's punch.)","Move your left hand from its checking position to the front of your attacker's throat. Hug your attacker close with your arms to choke out their air.","Step your right foot to 6 o'clock going behind your attacker's right leg.","Pivot counterclockwise stepping your left foot towards 6 o'clock as you buckle your attacker's leg and rip across their face with a left outward claw. As they fall, execute a right inward overhead backfist. Pivot into a right forward bow as you execute a left push-down to your attacker's body."]},{"description":"Set 12: Sleeper (Front- Left Step-Through Kick / Punch)","steps":["Pull your right foot back to 6 o'clock into a left cat stance as you facing 12 o'clock. As you pivot and step into this stance, an attacker from 12 o'clock comes at you with a left step-through kick. Adjust your stance into a cat stance facing 12 o'clock as you execute a left downward outward parry to your attacker's kicking leg. Note: This parry should appear as Angle Matching above your left knee.","As the follow-through left punch comes at you, execute a right inward parry. Note: This parry should appear as Angle Matching with the left side of your face.","Execute a left stomp to buckle behind your attacker's left leg.","Step to 12 o'clock with your right foot into a right neutral bow facing 12 o'clock as you execute a right inward block to the outside of your attacker's left arm. Note: Your left arm will hand at your side.","Pivot into a right forward bow facing 12 o'clock as you execute a left upward inward ridge hand to your attacker's throat. Note: Your right hand is now checking your attacker's left arm.","Have your right hand slide from its checking position, passing in front of your attacker's throat, to grab your left wrist. Hug your attacker up tight to your body as you apply pressure with your arms to choke your attacker out.","Instantly step your left leg around behind your attacker's left leg.","Pivot clockwise and step your right foot to 12 o'clock to take your attacker to the ground.","As you do so, execute a right outward claw to your attacker's face. Follow this with a left inward overhead backfist. Pivot into a left forward bow as you execute a right push down to your attacker's body."]},{"description":"Set 13: Brushing the Storm (Front- Right Step-Through Overhead Club)","steps":["While in your left forward bow, facing 6 o'clock, an attacker at 7:30 comes at you with a right step-through overhead club attack.","As they attack, step your left foot back to 12 o'clock into a right neutral bow facing 6 o'clock. Step your right foot to 3 o'clock into a transitional horsestance.","Step your left foot to 6 o'clock into a left neutral bow as you execute a left inward parry to outside of your attacker's right arm.","Step your right foot to 6 o'clock into a right neutral bow as you simultaneously with a right palm strike to your attacker's jaw. Note: Your right arm should end up under and inside your attacker's right arm. Also, we are stepping to keep this technique on the 12 o'clock / 6 o'clock line.","Step your left foot into a left close kneel facing 5:30 as you execute a right inward elbow. (This elbow collapses. Your left hand will check at your attacker's right arm.)","Execute a right palm strike to your attacker's groin.","Pivot clockwise immediately as you move your right foot to 6 o'clock into a left neutral bow facing 12 o'clock. While moving, have your right hand pull your attacker's right leg toward you. Simultaneously have your left hand push forward at your attacker's right hip.","While controlling your attacker's right leg with your right hand, execute a left front kick to your attacker's groin.","Plant your left foot back to 6 o'clock into a right neutral facing 12 o'clock, hands open."]},{"description":"Set 14: Brushing the Storm (Front- Left Step-Through Overhead Club)","steps":["An attacker at 10:30 comes at you with a left step-through overhead club attack.","As they attack, we are going to move to stay on the 12 o'clock / 6 o'clock line by stepping our right foot back to 6 o'clock into a left neutral bow facing 12 o'clock. Step your left leg to 9 o'clock into a transitional horse stance.","Step your right leg to 12 o'clock into a right neutral bow as you execute a right inward parry. Step your left foot to 12 o'clock into a left neutral bow as you simultaneously execute a left palm strike to your attacker's jaw. Note: Your left arm should end up under and inside your attacker's left arm.","Step your right foot into a right close kneel facing 12 o'clock as you execute a left inward elbow. (Your elbow will collapse. Your right hand will also check at your attacker's left arm.)","Execute a left palm strike to your attacker's groin.","Pivot counterclockwise immediately as you move your left foot to 12 o'clock into a right neutral bow facing 6 o'clock. While moving, have your left hand pull your attacker's left leg toward you. Simultaneously have your right hand push forward at your attacker's left hip.","While controlling your attacker's left leg with your left hand, execute a right front kick to your attacker's groin.","Plant your left foot behind your right (to 3 o'clock)"]},{"description":"Set 15: Falling Falcon (Front- Right Direct Lapel Grab)","steps":["Pivot into a left neutral bow facing 9 o'clock with your left hand now higher than your right.","An attacker at 9 o'clock grabs your right lapel with their right hand.","Step your right foot to 9 o'clock outside your attacker's right leg into a right neutral bow facing 9 o'clock as you pin your attacker's hand with your left and simultaneously execute a right upward elbow strike to your attacker's right shoulder.","Convert this forward momentum into rotational momentum as you pivot into a right reverse bow and cause your attacker to fall towards 6 o'clock.","Your attacker will fall on his back, head towards 3 o'clock. Continue to control your attacker's right wrist with your left hand.","Pivot into a left reverse bow as your right hand grabs your attacker's wrist and twist it clockwise. Simultaneous with these moves, execute a left underhand palm strike to your attacker's right elbow.","Cock your left leg (possible knee strike) as both of your hands grab your attacker's right arm. Execute a left knife-edge kick to your attacker's neck as you pull on your attacker's right arm to cause a possible dislocation.","Circle your left hand inside your attacker's right arm, contouring with the back of your right hand, as you plant your left foot to 2 o'clock as you pivot into a left forward bow. Simultaneous to this move, grab your attacker's right wrist with your left hand and twist it counterclockwise.","Execute a right shin kick to your attacker's right elbow to further break it.","From the Point of Contact of your right kick, execute a right scooping heel kick to your attacker's right ribs.","With your right foot passing through, execute a downward looping round kick to your attacker's solar plexus as you maintain your left grab."]},{"description":"Set 16: Falling Falcon (Front- Left Direct Lapel Grab)","steps":["From the Point of Contact of your right kick, plant your right foot to 3 o'clock into a right front twist stance facing 3 o'clock. (Your hands are open and in guarding position towards 6 o'clock with your left hand higher than your right.)","Pivot into a right neutral bow facing 3 o'clock. (Your right hand is now higher than your left.)","An attacker at 3 o'clock grabs your left lapel with their left hand.","Step your left foot to 3 o'clock outside your attacker's left leg into a left neutral bow facing 3 o'clock as you pin your attacker's hand with your right and simultaneously execute a left upward elbow strike to your attacker's left shoulder.","Convert this forward momentum into rotational momentum as you pivot into a left reverse bow and cause your attacker to fall towards 6 o'clock.","Your attacker will fall on his back, head towards 9 o'clock. Continue to control your attacker's left wrist with your right hand.","Pivot into a right reverse bow as your left hand grabs your attacker's wrist and twist it counterclockwise. Simultaneous with these moves, execute a right underhand palm strike to your attacker's left elbow.","Cock your right leg (possible knee strike) as both of your hands grab your attacker's left arm. Execute a right knife-edge kick to your attacker's neck as you pull on your attacker's left arm to cause a possible dislocation.","Circle your right hand inside your attacker's left arm, contouring with the back of your left hand, as you plant your right foot to 10 o'clock as you pivot into a right forward bow. Simultaneous to this move, grab your attacker's left wrist with your right hand and twist it clockwise.","Execute a left shin kick to your attacker's left elbow to further break it.","From the Point of Contact of your left kick, execute a left scooping heel kick to your attacker's left ribs.","With your left foot passing through, execute a downward looping round kick to your attacker's solar plexus as you maintain your right grab."]},{"description":"Set 17: Circling the Horizon (Front- Right Step-Through Punch)","steps":["From the Point of Contact of your left kick, slide your left foot to 10:30 into a right rear twist stance in reference to the fallen attacker. Note: This is a left front twist in reference to your new attacker coming from 12 o'clock.","An attacker at 12 o'clock comes at you with a right step-through punch.","Step your right foot forward into a right cat stance facing 12 o'clock as you execute a right outward back knuckle block to the top of your attacker's right arm.","Instantly follow your right vertical back knuckle with a left overhead claw to your attacker's face. As your left claw becomes a pressing check, step your right foot into a right neutral bow as you simultaneously execute a right thrusting vertical back knuckle strike.","Execute a right inward elbow to your attacker's lower rib cage.","Step your right foot to 4:30 as you sweep along the ground and drag your attacker's right leg to 4:30. During this move, execute a right palm strike to your attacker's solar plexus at 10:30. Note: You will go to the ground here, your left knee bent. Your right ridge-hand will thrust forward to assist with the takedown (counterbalance).","Execute a right front kick to and through your attacker's right ribs. Note: To maintain balance, pull your hands to give counterbalance.","Drop your right heel down on top of your attacker's ribs."]},{"description":"Set 18: Circling the Horizon (Rear- Left Step-Through Punch)","steps":["An attacker at 6 o'clock comes at you with a left step-through punch.","From the Point of Contact of your right heel kick, stand and pivot into a left cat stance facing 6 o'clock.","Execute a left outward back knuckle block to the top of your attacker's left arm.","Instantly follow your left vertical back knuckle with a right overhead claw to the top of your attacker's left arm. As your right claw becomes a pressing check, step your left foot into a left neutral bow as you simultaneously execute a left thrusting vertical back knuckle strike.","Execute a left inward elbow to your attacker's lower rib cage.","Step your left foot to 1:30 as you sweep along the ground and drag your attacker's left leg to 1:30. During this move, execute a left palm strike to your attacker's solar plexus at 7:30. Note: You will go to the ground here, your right knee bent. Your left ridge-hand will thrust forward to assist with the takedown (counterbalance).","Execute a left front kick to and through your attacker's left ribs. Note: To maintain balance, pull your hands back using counterbalance.","Drop your left heel down on top of your attacker's ribs."]},{"description":"Set 19: Leaping Crane (Rear- Right Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a right step-through punch.","From the Point of Contact of your left heel kick, stand and pivot to face 12 o'clock.","Leap to your left to 9:30 into a left one-legged stance as you simultaneously execute a left inward parry to your attacker's right punch with a right middle-knuckle across your attacker's right ribs. Note: This strike rakes inward and horizontally to end across your waist.","Execute a right knife-edge kick to 1:30 to your attacker's right knee to buckle and drop them to the ground.","Drop into a right neutral bow towards 1:30 between your attacker's legs as you execute a right backfist to your attacker's left kidney.","As your attacker's head snaps back due to the low strike, contour up their back and execute a right inward elbow simultaneous with a left inward palm strike to cause a sandwich.","Instantly have your right hand circle clockwise as it contours along the back of your attacker's head (fingers and palm will end against the left side of your attacker's face.) Simultaneously have your left hand contour and check along the back of your attacker's head (should end at your attacker's right shoulder, palm up for the next move.)","Immediately shift into a right forward bow as you execute a right ripping claw to the left side of your attacker's face with a left thrusting chop (palm down) to the back of your attacker's neck. Note: Your right hand will cock at your right ear (palm out, thumb down.)","Pivot counterclockwise into a right neutral bow as you execute a right inward handword to the right side of your attacker's neck. (Your left hand will be in positional check.)","Continue the flow of this technique as you execute a right front scoop kick followed by a left front snap kick to your attacker' upper spine.","From the Point of Contact, execute a left front crossover to the top of your attacker's right ankle."]},{"description":"Set 20: Leaping Crane (Front- Left Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a left step-through punch.","From the Point of Contact of your left stomp, immediately leap towards 1:30 into a right one-legged stance facing 12 o'clock as you simultaneously a right inward parry to your attacker's left punch with a left middle-knuckle to your attacker's left  ribs. Note: This strike will rake inward and horizontally across your waist.","Execute a left knife-edge kick to 10:30 to your attacker's left knee to buckle and drop them to the ground.","Drop into a left neutral bow towards 10:30 between your attacker's legs as you execute a left backfist to your attacker's right kidney.","As your attacker's head snaps back due to the low strike, contour up their back and execute a left inward elbow simultaneous with a right inward palm strike to cause a sandwich.","Instantly have your left hand circle clockwise as it contours along the back of your attacker's head (fingers and palm will end against the right side of your attacker's face.) Simultaneously have your right hand contour and check along the back of your attacker's head (should end at your attacker's left shoulder, palm up for the next move.)","Immediately shift into a left forward bow as you execute a left ripping claw to the right side of your attacker's face with a right thrusting chop (palm down) to the back of your attacker's neck. Note: Your left hand will cock at your right ear (palm out, thumb down.)","Pivot counterclockwise into a left neutral bow as you execute a left inward handword to the left side of your attacker's neck. (Your right hand will be in positional check.)","Continue the flow of this technique as you execute a left front scoop kick followed by a right front snap kick to your attacker' upper spine.","From the Point of Contact, execute a right front crossover to the top of your attacker's left ankle."]},{"description":"Closing:","steps":["Your right front crossover is part of the closing. Right hand open at right hip; left arm across waist with left open hand above right hand.","Leap to a left one-legged stance at 9 o'clock. During this, have your right clenched fist and left open hand cock at your right ear.","Step your right foot to 3 o'clock into a meditative horse stance.","Attention stance.","Formal Salutation.","Bow."]}]}