{"steps":[{"description":"Salutation","steps":["From an attention stance while holding both clubs near the end with your left hand, which is hanging at your side. Execute the full salutation. Following is the description.","Step your right foot forward into a right twist stance as you cock your right clenched fist near your right ear. Simultaneously have the clubs come across your body to the point that your left hand and clubs touch your right fist.","As you step your left foot to the cat stance, bring your right fist and left hand (with clubs, which are still touching your right hand ) to the front.","Step your left foot to 6 o'clock as you pull your hands back. [The backs of your hands should be touching your chest as your left foot settles.]","Step your right foot back to be in line with your left foot as you simultaneously circle your right hand clockwise to stop at your right hip, fist clenched, palm up as your left hand positions the clubs vertically against your solar plexus .","Place the bottom ends of the clubs against your upper abdomen and tilt the tops of the clubs forward as your left hand followed by your right directly slides to the bottom of each of the clubs (left to left, right to right).","Slide your left foot to 9 o'clock into a horse stance facing 12 o'clock as your left club circles clockwise and right circles counterclockwise. Have the tops touch each other to form the triangle just above the level of your forehead.","Cross both clubs on each other at the midpoint as they are lowered to a level slightly below your chin.","Without loss of motion, place clubs on a vertical plane (just like praying) as they are lowered to the level of your solar plexus.","As you bring your left foot to your right have both clubs circle from the outside in (right hand counterclockwise, left hand clockwise) crossing them at your belt level. The tops of the clubs should be pointing down and to 12 o'clock at a 45 degree angle."]},{"description":"Set 1: Five Storms (Right Step-Through Roundhouse Punch)","steps":["An attacker at 12 o'clock comes at you with a right step-through roundhouse punch.","Step your left foot back to 6 o'clock into a right neutral bow facing 12 o'clock as you simultaneously execute a right inward club strike to the inside of your attacker's right forearm with a left outward downward club strike to the inside of your attacker's right knee. (Note the universal block here used as an offensive defense).","Execute a right outward club strike to the right side of your attacker's neck while your left club positionally checks low and begins starting on its upward path.","Pivot into a right forward bow facing 12 o'clock as you thrust the tip of your left club into your attacker's solar plexus. [Your right club will pass over the left club on its path to your right hip, your palm up.]","Have your left club lock-out at your attacker's solar plexus to check their depth zones. Using your left club as a guide, execute a right club thrust to your attacker's solar plexus as you pivot back into a right neutral bow facing 12 o'clock. [Your left club should go to your right bicep, palm up.]","Step your left foot to 4:30 into a right forward bow as you simultaneously execute a left outward club strike to the left side of your attacker's neck with a right outward downward club strike to your attacker's left arm.","Step your right foot to 7:30 into a right front crossover as you use your left club on your attacker's left shoulder as a pressing check to cancel out the height, width, and depth zones. As you settle into your stance, execute a right inward overhead club strike to the back of your attacker's neck. Note: This inward overhead strike employs grafted methods of execution; with your elbow anchored, use a fused method with your arm to residually whip the club at your attacker.","Step your left foot to 7:30 into a right neutral bow facing 12 o'clock, clubs positioned as a universal block (right as inward, left as a downward)."]},{"description":"Set 2: Five Storms (Left Step-Through Roundhouse Punch)","steps":["An attacker comes at you from 12 o'clock with a left step-through roundhouse punch.","Step your right foot back to 6 o'clock into a left neutral bow facing 12 o'clock as you simultaneously execute a left inward club strike to the inside of your attacker's left forearm with a right outward downward club strike to the inside of your attacker's left knee. (Note the universal block here used as an offensive defense).","Execute a left outward club strike to the right side of your attacker's neck while your right club positionally checks low and begins starting on its upward path.","Pivot into a left forward bow facing 12 o'clock as you thrust the tip of your right club into your attacker's solar plexus. [Your left club will pass over the right club on its path to your left hip, your palm up.]","Have your right club lockout at your attacker's solar plexus to check their depth zones. Using your right club as a guide, execute a left club thrust to your attacker's solar plexus as you pivot back into a left neutral bow facing 12 o'clock. [Your right club should go to your left bicep, palm up.]","Step your right foot to 7:30 into a left forward bow as you simultaneously execute a right outward club strike to the right side of your attacker's neck with a left outward downward club strike to your attacker's right arm.","Step your left foot to 4:30 into a left front crossover as you use your right club on your attacker's right shoulder as a pressing check to cancel out the height, width, and depth zones. As you settle into your stance, execute a left inward overhead club strike to the back of your attacker's neck. Note: This inward overhead strike employs grafted methods of execution; with your elbow anchored, use a fused method with your arm to residually whip the club at your attacker."]},{"description":"Set 3: Reversing Storm (Left Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a left step-through straight punch.","Step your right foot to 1 o'clock into a right neutral bow facing 12 o'clock as you execute a right inward parry followed by a left outward parry to the outside of your attacker's left arm.","Continuing the counterclockwise motion of your right club, convert your right parry into a right outward club strike to your attacker's left ribs as your left foot steps to 4:30.","As your right club passes through your attacker's ribs, continue its counterclockwise motion to check your attacker's left arm diagonally down. As you press your attacker's arm down, execute a left diagonally upward club strike to your attacker's face (with the length of the stick, not the tip).","Step your right foot to 7:30 into a front crossover as your left club tracks down your attacker's arm to act as a pressing check. As you settle into the crossover, execute a right inward overhead club strike to the back of your attacker's neck. Note: This employs the same grafting methods as previously used. The fused method with the residual whip."]},{"description":"Set 4: Reversing Storm (Right Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a right step-through straight punch.","Step your left foot to 11 o'clock into a left neutral bow facing 12 o'clock as you execute a left inward parry followed by a right outward parry to the outside of your attacker's right arm.","Continuing the clockwise motion of your left club, convert your left parry into a left outward club strike to your attacker's right ribs as your right foot steps to 7:30.","As your left club passes through your attacker's ribs, continue its clockwise motion to check your attacker's right arm diagonally down. As you press your attacker's arm down, execute a right diagonally upward club strike to your attacker's face (with the length of the stick, not the tip).","Step your left foot to 4:30 into a front crossover as your right club tracks down your attacker's arm to act as a pressing check. As you settle into the crossover, execute a left inward overhead club strike to the back of your attacker's neck. Note: This employs the same grafting methods as previously used. The fused method with the residual whip."]},{"description":"Set 5: Repeating Storm (Left Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a left straight low punch.","Step your right foot to 1 o'clock into a right neutral bow facing 12 o'clock as you execute a left outward parry (waiter hand) to the outside of your attacker's left arm. As you settle into your right neutral bow, execute a right inward club strike to your attacker's left kidney.","After your club has passed through your attacker's left kidney, execute a right outward club strike to to the front of your attacker's left ribs. [Your left club and arm is maintaining the check on your attacker's left arm.]","As your right club passes through your attacker's ribs, continue its counterclockwise path of travel to check your attacker's left arm diagonally downward as you simultaneously execute a left diagonally upward strike with the long end to your attacker's throat.","Reverse the motion of your clubs so your left club returns to check your attacker's left arm while your right club executes a right outward strike to your attacker's face.","Step your right foot to 7:30 into a right front crossover as your left club pivots on your attacker's left arm to act as a pressing check and your right club goes through their face and continues to strike down through their left kidney.","As you settle into your stance, have your left club torque outward so the long end is up and press on your attacker's left elbow as you simultaneously execute a right outward club strike to your attacker's left ribs."]},{"description":"Set 6: Repeating Storm (Right Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a right straight low punch.","Step your left foot to 11 o'clock into a left neutral bow facing 12 o'clock as you execute a right outward parry (waiter hand) to the outside of your attacker's right arm. As you settle into your left neutral bow, execute a left inward club strike to your attacker's right kidney.","After your club has passed through your attacker's right kidney, execute a left outward club strike to to the front of your attacker's right ribs. [Your right club and arm is maintaining the check on your attacker's right arm.]","As your left club passes through your attacker's ribs, continue its clockwise path of travel to check your attacker's right arm diagonally downward as you simultaneously execute a right diagonally upward strike with the long end of your club to your attacker's throat.","Reverse the motion of your clubs so your right club returns to check your attacker's right arm while your left club executes a left outward strike to your attacker's face.","Step your left foot to 4:30 into a left front crossover as your right club pivots on your attacker's right arm to act as a pressing check and your left club goes through their face and continues to strike down through their right kidney.","As you settle into your stance, have your right club torque outward so the long end is up and press on your attacker's right elbow as you simultaneously execute a left outward club strike to your attacker's right ribs."]},{"description":"Set 7: Clashing Storm (Right Kick / Punch Combination)","steps":["An attacker at 12 o'clock comes at you with a right front kick followed by a right punch.","Step your right foot back to 6 o'clock into a left neutral bow facing 12 o'clock as you simultaneously execute a right outward strike to the outside of your attacker's right leg with a left inward parry to the outside of your attacker's right arm.","Step your right foot to 12 o'clock into a right neutral bow facing 12 o'clock as you reverse your right club's motion and execute a right strike below your attacker's right shoulder blade simultaneous with a left outward strike to your attacker's face.","Step your left foot to 12:30 into a transitional left neutral bow facing 1:30 as you execute a right rolling check down your attacker's back and left kidney. Simultaneous to this motion, have your left club loop clockwise over your head in preparation.","Slide your right foot to 10:30 into a left neutral bow facing 4:30 as you execute a left inward club strike to the back of your attacker's left elbow. Simultaneous with this motion, have your right club start a clockwise circle that acts as a sliding check along the right side of your attacker's body.","Pivot into a right rear rotating twist stance to 1:30 as your left club contours your attacker's back and acts as a pressing check on their right arm. As you settle into the twist stance, execute a right inward overhead club strike to the back of your attacker's neck. Note: This employs the same grafting methods as previously used: the fused method with the residual whip."]},{"description":"Set 8: Clashing Storm (Left Kick / Punch Combination)","steps":["An attacker at 6 o'clock comes at you with a left front kick followed by a left punch.","Step your left foot back to 12 o'clock into a right neutral bow facing 6 o'clock as you simultaneously execute a left outward club strike to the outside of your attacker's left leg with a right inward parry to the outside of your attacker's left arm.","Step your left foot to 6 o'clock (outside your attacker's leg) into a left neutral bow facing 6 o'clock as you reverse your left club's motion and execute a left strike below your attacker's left shoulder blade simultaneous with a right outward strike to your attacker's face.","Step your right foot to 5:30 into a transitional right neutral bow facing 7:30 as you execute a left rolling check down your attacker's back and left kidney. Simultaneous to this motion, have your right club loop counterclockwise over your head in preparation.","Slide your left foot to 6:30 into a right neutral bow facing 11:30 as you execute a right inward club strike to the back of your attacker's right elbow. Simultaneous with this motion, have your left club start a counterclockwise circle that acts as a sliding check along the left side of your attacker's body.","Pivot into a left rear rotating twist stance to 5:30 as your right club contours your attacker's back and acts as a pressing check on their left arm. As you settle into the twist stance, execute a left inward overhead club strike to the back of your attacker's neck. Note: This employs the same grafting methods as previously used: the fused method with the residual whip."]},{"description":"Set 9: Gathering Storms (Right Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a right straight punch.","Step your left foot to 10:30 into a horse stance facing 1:30 as you execute a left inward parry to the outside of your attacker's right arm simultaneous with a right inward horizontal club slice to your attacker's ribs.","Without hesitation, reverse the motion of your right club; execute a right outward horizontal club strike to your attacker's right kidney as your left club maintains its check on your attacker's right arm.","Execute a quick clockwise circle with your right club to check on top of your attacker's right arm as your left club travels the reverse of that motion and executes a left inward strike to your attacker's kidney.","Contour your left club up your attacker's back to act as a pressing check on your attacker's right arm as your right club tracks up your attacker's right and strikes in their face.","Step your left foot to 4:30 into a left front crossover as your right club contours your attacker's right arm to act as a pressing check. As you settle into your stance execute a left inward overhead club strike to the back of your attacker's neck. Note: This employs the same grafting methods as previously used: the fused method with the residual whip."]},{"description":"Set 10: Gathering Storms (Left Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a left straight punch.","Step your right foot to 1:30 into a horse stance facing 10:30 as you execute a right inward parry to the outside of your attacker's left arm simultaneous with a left inward horizontal club slice to your attacker's ribs.","Without hesitation, reverse the motion of your left club; execute a left outward horizontal club strike to your attacker's right kidney as your right club maintains its check on your attacker's left arm.","Execute a quick counterclockwise circle with your left club to check on top of your attacker's left arm as your right club travels the reverse of that motion and executes a right inward strike to your attacker's kidney.","Contour your right club up your attacker's back to act as a pressing check on your attacker's left arm as your left club tracks up your attacker's left and strikes in their face.","Step your right foot to 7:30 into a right front crossover as your left club contours your attacker's left arm to act as a pressing check. As you settle into your stance execute a right inward overhead club strike to the back of your attacker's neck. Note: This employs the same grafting methods as previously used: the fused method with the residual whip."]},{"description":"Set 11: Flashing Storms (Right Step-Through Punch)","steps":["An attacker at 9 o'clock comes at you with a right straight punch.","Step your left foot to 9 o'clock into a left neutral bow as you deliver a left inward block to the outside of your attacker's right arm at the elbow. Simultaneous with the block, cock your right club above your right shoulder (palm facing 9 o'clock) to strike the inside of your attacker's right wrist. [This should break your attacker's right arm; your left knee should also be checking your attacker's right knee.]","Step to 8:30 with your right foot into a right inverted neutral bow (heel-toe alignment) as you deliver a right inward diagonal club strike across your attacker's face as you have your left first act as a positional check, then as a sliding check to help drive your attacker back.","Immediately pivot counterclockwise into a left neutral bow as you execute a left outward horizontal club strike to your attacker's right ribs. Simultaneously have your right club act as a inward bracing angle check against your attacker's upper arm.","Follow up with a left upward hooking check (waiter's hand) on top of your attacker's right arm as you simultaneously drop into a left wide kneel stance and continue the motion of your right club; your right hand circles counterclockwise and executes a right overhead club strike to your attacker's face.","Pivot clockwise as you drop your right foot to 1:30 into a right reverse bow and buckle the back of your attacker's right knee. [Your attacker and you are now back to back.] Simultaneous with this buckle, execute a right diagonally downward strike to the back of your attacker's right leg as your left clubs positionally checks the outside of your attacker's right arm.","Execute a right front snap kick to the inside of your attacker's left knee.","Land in an right inverted neutral bow (heel-toe) towards 9 o'clock as you execute a right inward horizontal club strike across your attacker's face. [Your left club acts as a sliding check along the outside and the top of your attacker's right arm.]","Pivot into a left forward bow facing 3 o'clock as you simultaneously execute a right inward club strike to your attacker's arm with a left diagonally downward club strike to your attacker's right leg."]},{"description":"Set 12: Flashing Storm (Left Step-Through Punch)","steps":["An attacker at 3 o'clock comes at you with a left straight punch.","Step your right foot to 3 o'clock into a right neutral bow as you deliver a right inward block to the outside of your attacker's left arm at the elbow. Simultaneous with the block, cock your left club above your left shoulder (palm facing 3 o'clock) to strike the inside of your attacker's left wrist. [This should break your attacker's left arm; your right knee should also be checking your attacker's left knee.]","Step to 3:30 with your left foot into a left inverted neutral bow (heel-toe alignment) as you deliver a left inward diagonal club strike across your attacker's face as you have your right club first act as a positional check, then as a sliding check to help drive your attacker back.","Immediately pivot clockwise into a right neutral bow as you execute a right outward horizontal club strike to your attacker's left ribs. Simultaneously have your left club act as a inward bracing angle check against your attacker's upper arm.","Follow up with a right upward hooking check (waiter's hand) on top of your attacker's left arm as you simultaneously drop into a right wide kneel stance and continue the motion of your left club; your left hand circles clockwise and executes a left overhead club strike to your attacker's face.","Pivot counterclockwise as you drop your left foot to 10:30 into a left reverse bow and buckle the back of your attacker's left knee. [Your attacker and you are now back to back.] Simultaneous with this buckle, execute a left diagonally downward strike to the back of your attacker's left leg as your right clubs positionally checks the outside of your attacker's left arm.","Execute a left front snap kick to the inside of your attacker's right knee.","Land in a left inverted neutral bow (heel-toe) towards 3 o'clock as you execute a left inward horizontal club strike across your attacker's face. [Your right club acts as a sliding check along the outside and the top of your attacker's left arm.]","Pivot into a right forward bow facing 9 o'clock as you simultaneously execute a left inward club strike to your attacker's arm with a right diagonally downward club strike to your attacker's left leg."]},{"description":"Set 13: Whirling Storm (Left Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a left straight punch.","From your right forward bow facing 9 o'clock, step your left foot to 6 o'clock into a right neutral bow facing 12 o'clock as you execute a right inward club strike to the outside of your attacker's arm followed by a left outward parry to your attacker's arm. Continue your right club's motion and execute a right downward club strike to your attacker's left knee that hooks back up and executes a right hooking club strike to the back of your attacker's head. (Your left parry should be a check at your attacker's left arm.)","Have your right club pass through your attacker's head and check on top of your attacker's left arm while your left club strikes up to his face.","Execute a right outward strike to your attacker's face as your left club returns to check on top of your attacker's left arm.","Step your right foot to 7:30 into a right front crossover as you execute a right downward club strike to the back of your attacker's left knee.","As you settle into the stance, execute a right outward club strike to your attacker's face. Note: The final position of this has your left club outside your attacker's arm and your right club on the inside."]},{"description":"Set 14: Whirling Storm (Right Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a right straight punch.","Step your left foot to 6 o'clock into a right neutral bow facing 12 o'clock. Immediately step your right to 6 o'clock into a left neutral bow facing 12 o'clock as you execute a left inward club strike to the outside of your attacker's right arm followed by a right outward parry to your attacker's arm. Continue your left club's motion and execute a left downward club strike to your attacker's right knee that hooks back up and executes a left hooking club strike to the back of your attacker's head. (Your right parry should be a check at your attacker's right arm.)","Have your left club pass through your attacker's head and check on top of your attacker's right arm while your right club strikes up to his face.","Execute a left outward strike to your attacker's face as your right club returns to check on top of your attacker's right arm.","Step your left foot to 4:30 into a left front crossover as you execute a left downward club strike to the back of your attacker's right knee.","As you settle into the stance, execute a left outward club strike to your attacker's face. Note: The final position of this has your right club outside your attacker's arm and your left club on the inside."]},{"description":"Set 15: Destructive Storm (Right Step-Through Punch)","steps":["An attacker at 9 o'clock comes at you with a right straight punch.","Step your right foot 4:30 into a transitory left neutral bow bow facing 10:30. Instantly slide your left foot to 8 o'clock into a horse stance facing 11 o'clock as you execute a right outward parry followed by a left inward parry to the outside of your attacker's arm. Your right club continues its clockwise circle and executes a right inward hammering club strike to your attacker's right ribs. (Your left club remains at your attacker's right elbow as a bracing angle check.)","Step your left foot to 1:30 into a front crossover to begin the process of sweeping your attacker's leg.","From your twist stance, pivot clockwise and turn your rotational force into linear as you execute a right outward club strike (with the butt of the club) followed by settling into your right reverse bow by driving your right foot to 1:30 into a right reverse bow. Simultaneous with the buckle, execute a right downward club strike to your attacker's right leg. (Your left remains as a check at your attacker's right arm.)","Execute a right knife-edge kick to the back of your attacker's left knee.","Land your right foot to 9 o'clock into a right inverted neutral bow (heel-toe alignment) as you execute a right inward horizontal club strike across your attacker's face. (Your left club acts as a sliding check.)","Step your left foot to 9 o'clock into a right forward bow facing 3 o'clock as you execute a right inward club strike to your attacker's right arm simultaneous with a left downward diagonal club strike to your attacker's right leg."]},{"description":"Set 16: Destructive Storm (Left Step-Through Punch)","steps":["An attacker at 3 o'clock comes at you with a left straight punch.","Step your right foot 4:30 into a horse stance facing 1 o'clock as you execute a left outward parry followed by a right inward parry to the outside of your attacker's arm. Your left club continues its clockwise circle and executes a left inward hammering club strike to your attacker's left ribs. (Your right club remains at your attacker's left elbow as a bracing angle check.)","Step your right foot to 10:30 into a front crossover to begin the process of sweeping your attacker's leg.","From your twist stance, pivot counterclockwise and turn your rotational force into linear as you execute a left outward club strike (with the butt of the club) followed by settling into your left reverse bow by driving your left foot to 1o:30 into a reverse bow. Simultaneous with the buckle, execute a left downward club strike to your attacker's left leg. (Your right remains as a check at your attacker's left arm.)","Execute a left knife-edge kick to the back of your attacker's right knee.","Land your left foot to 3 o'clock into a left inverted neutral bow (heel-toe alignment) as you execute a left inward horizontal club strike across your attacker's face. (Your right club acts as a sliding check.)","Step your right foot to 3 o'clock into a left forward bow facing 9 o'clock as you execute a left inward club strike to your attacker's left arm simultaneous with a right downward diagonal club strike to your attacker's left leg."]},{"description":"Set 17: Shielding Storms (Right Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a right straight punch.","Step your left foot to 11 o'clock into a left neutral bow facing 12 o'clock and pivot to your right into a horse stance as you execute a right vertical outward club strike to the outside of your attacker's right arm as you simultaneously execute a left inward hammering club strike to your attacker's lower ribs.","Pivot into a left close kneel stance as you drop your right club down on top of your attacker's right kidney while your left club tracks along the side of your attacker's body to become a bracing angle check.","Circle your right club counterclockwise striking your attacker's face and continue to strike down on your attacker's right hip.","Execute a left downward club strike to the back of your attacker's right knee. (Your right club will now positionally check at your attacker's right arm.)","Execute a right downward club strike to the back of your attacker's right knee. (Your left club will now positionally check at your attacker's right arm.) Without raising your body, execute a right knife-edge kick to your attacker's left knee."]},{"description":"Set 18: Shielding Storm (Left Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a left straight punch.","From the point of your right kick, plant your right foot to 12 o'clock into a right neutral bow facing 12 o'clock and pivot to your left into a horse stance as you execute a left vertical outward club strike to the outside of your attacker's left arm as you simultaneously execute a right inward hammering club strike to your attacker's lower ribs.","Pivot into a right close kneel stance as you drop your left club down on top of your attacker's left kidney while your right club tracks along the side of your attacker's body to become a bracing angle check.","Circle your left club clockwise striking your attacker's face and continue to strike down on your attacker's left hip.","Execute a right downward club strike to the back of your attacker's left knee. (Your left club will now positionally check at your attacker's left arm.)","Execute a left downward club strike to the back of your attacker's left knee. (Your right club will now positionally check at your attacker's left arm.) Without raising your body, execute a left knife-edge kick to your attacker's right knee."]},{"description":"Set 19: Twisting Storm (Right Front Kick; Right / Left Punch Combination)","steps":["An attacker at 6 o'clock comes at you with a right front kick followed by a right punch.","From your left kick, cover into a right neutral bow facing 6 o'clock as you execute a right outward downward club strike to the outside of your attacker's right leg. As the punch comes in, execute a left inward club strike to the outside of your attacker's arm.","Your attacker throws a left punch at your head.","Reverse the motion of your left club strike and execute a left outward block to the outside of your attacker's left arm. Follow this immediately with a right inward block that checks your attacker's body diagonally down to your left.","Execute a right outward club strike to your attacker's neck.","As your right club passes through their neck, have it flow past your right hip as you execute a left front kick to your attacker's groin.","Land forward into a left neutral bow facing 6 o'clock as you execute a left inward downward club strike to the right side of your attacker's neck. [Your left club will strike through your attacker's neck and remain as a horizontal check at waist level for the remainder of this technique.]","Pivot counterclockwise into a twist stance as you execute a right inward downward strike to the left side of your attacker's neck.","Pivot clockwise back into a left neutral bow as you reverse the motion of your right club and execute a right outward downward club strike to the right side of your attacker's neck.","As your club passes through the target and past your right hip, execute a right front kick to your attacker's groin.","Plant your right foot forward into a right inverted neutral bow (heel-toe alignment) as you execute a right inward downward club strike to the left side of your attacker's neck. Note: This club strike will pass through the target and become the first move of the next technique."]},{"description":"Set 20: Twisting Storm (Left Front Kick; Left / Right Punch Combination)","steps":["An attacker at 6 o'clock comes at you with a left front kick followed by a left punch.","From your right neutral bow, step your right foot to 12 o'clock into a left neutral bow facing 6 o'clock as you execute a left outward downward club strike to the outside of your attacker's left leg. As the left punch comes in, execute a right inward club strike to the outside of your attacker's arm.","Your attacker throws a right punch at your head.","Reverse the motion of your right club strike and execute a right outward block to the outside of your attacker's right arm. Follow this immediately with a left inward block that checks your attacker's body diagonally down to your right.","Execute a left outward club strike to your attacker's neck.","As your left club passes through their neck, have it flow past your left hip as you execute a right front kick to your attacker's groin.","Land forward into a right neutral bow facing 6 o'clock as you execute a right inward downward club strike to the left side of your attacker's neck. [Your right club will strike through your attacker's neck and remain as a horizontal check at waist level for the remainder of this technique.]","Pivot clockwise into a twist stance as you execute a left inward downward strike to the right side of your attacker's neck.","Pivot counterclockwise back into a right neutral bow as you reverse the motion of your left club and execute a left outward downward club strike to the left side of your attacker's neck.","As your club passes through the target and past your left hip, execute a left front kick to your attacker's groin.","Plant your left foot forward into a left inverted neutral bow (heel-toe alignment) as you execute a left inward downward club strike to the right side of your attacker's neck."]},{"description":"Set 21: Twirling Storms (Right Step-Through Punch)","steps":["An attacker at 3 o'clock comes at you with a right straight punch.","Step your right foot to 9 o'clock into a left neutral bow facing 3 o'clock as you execute a right outward parry followed by a left inward parry to the outside of your attacker's right arm. As your left parry is finishing, step your right foot to 3 o'clock into a transitory right neutral bow facing 3 o'clock as you execute a right inward club strike to your attacker's ribs.","Step your left foot forward into a transitory left neutral bow. As you do so, have your club check down on the back and outside of your attacker's right hip (palm up) while your left club begins to circle clockwise over your head.","Step your right foot to 1:30 behind your left so you are facing 7:30. First, torque your palm down to give added push to the check. As you pivot, execute a left round kick to the back of your attacker's left knee. Land in a left neutral bow as you execute a left inward downward strike across the left side of your attacker's neck.","Pivot into a left forward bow as you execute a right inward club strike to the right side of your attacker's neck. (Your left club will check horizontally across your attacker's back.)","Drag your right foot to your left as you cock your left knee for a knife-edge kick while your left club cocks over your head. (Your right club will check horizontally across your attacker's back and continues to do so through the next move.)","Execute a left knife-edge kick to the back of your attacker's left knee.","Land forward into a left neutral bow facing 7:30 as you execute a left inward downward club strike to your attacker's neck.","Execute a right front crossover as you slide the tip of your left club under the left side of your attacker's chin and slide the right club under your left club and onto your attacker's left shoulder. Pry down using your attacker's left shoulder as a fulcrum point to put pressure under your attacker's jaw. Execute a left knee kick to your attacker's tailbone.","Land forward into a left neutral bow facing 9 o'clock as you cross check and push your attacker down."]},{"description":"Set 22: Twirling Storms (Left Step-Through Punch)","steps":["An attacker at 9 o'clock comes at you with a left straight punch.","Step your left foot to 3 o'clock into a right neutral bow facing 9 o'clock as you execute a left outward parry followed by a right inward parry to the outside of your attacker's left arm. As your right parry is finishing, step your left foot to 9 o'clock into a transitory left neutral bow facing 9 o'clock as you execute a left inward club strike to your attacker's ribs.","Step your right foot forward into a transitory right neutral bow. As you do so, have your club check down on the back and outside of your attacker's left hip (palm up) while your right club begins to circle counterclockwise over your head.","Step your left foot to 10:30 behind your right so you are facing 4:30. First, torque your palm down to give added push to the check. As you pivot, execute a right round kick to the back of your attacker's right knee. Land in a right neutral bow as you execute a right inward downward strike across the right side of your attacker's neck.","Pivot into a right forward bow as you execute a left inward club strike to the left side of your attacker's neck. (Your right club will check horizontally across your attacker's back.)","Drag your left foot to your right as you cock your right knee for a knife-edge kick while your right club cocks over your head. (Your left club will check horizontally across your attacker's back and continues to do so through the next move.)","Execute a right knife-edge to the back of your attacker's right knee.","Land forward into a right neutral bow facing 4:30 as you execute a right inward downward club strike to your attacker's neck.","Execute a left front crossover as you slide the tip of your right club under the right side of your attacker's chin and slide the left club under your right club and onto your attacker's right shoulder. Pry down using your attacker's right shoulder as a fulcrum point to put pressure under your attacker's jaw. Execute a right knee kick to your attacker's tailbone.","Land forward into a right neutral bow facing 3 o'clock as you cross check and push your attacker down. Note: Your clubs will end crossed at about neck level."]},{"description":"Set 23: Criss-Crossing Storms (Two-Hand Low Push)","steps":["An attacker from 1:30 comes at you with a low two-hand push.","Shift your right foot to 7:30 into a left neutral bow as you have your clubs (crossed at neck level) strike down down and below waist level to block the two-hand push.","Execute a left front kick to your attacker's groin. Circle both clubs from the outside in and as you land forward into a left neutral bow, execute double inward club strikes to both side of your attacker's neck [right to left and left to right.] (The right club is crossing on top of the left.) Cross the action of the clubs and follow through to waist level.","Execute a right step-through front kick. As you land, execute two outward strikes to both sides of your attacker's neck [right to right, left to left.]","With your left club acting as an outward check, step your left foot to 2:30 into a rear crossover. Step your right leg to 2:30 into a right reverse bow in order to buckle out the inside of your attacker's left knee while you simultaneously execute a right downward club strike to your attacker's groin.","Step your right foot in a short step to 8 o'clock as you simultaneously execute a right vertical club strike to the right side of your attacker's face.","Without hesitation shift your right foot to 10:30 as you shoot a left reverse bow to and through your attacker's right inner knee. Simultaneous to this motion, turn your upper body counterclockwise as you execute a left downward club strike to your attacker's groin as you execute a right inward club strike to the left side of your attacker's head.","Pivot counterclockwise into a rotating twist stance as you execute a left outward club strike to the left side of your attacker's neck followed by a right inward club strike through the same spot.","Pivot clockwise out of the twist stance as you execute a right outward club strike to the right side of your attacker's neck followed by a left inward strike through the same spot. Step your left foot back a short step as your left club checks horizontally against your attacker's shoulders.","Execute a right step-through front kick. As you land into a right neutral bow execute a right diagonal overheard club strike to the left side of your attacker's head."]},{"description":"Set 24: Criss-Crossing Storms (Left Low Front Kick)","steps":["An attacker from 10:30 comes at you with a low two-hand push.","Shift your left foot to 4:30 into a right neutral bow as you have your clubs (crossed at near neck level) strike down down and below waist level to block the two-hand push.","Execute a right front kick to your attacker's groin. Circle both clubs from the outside in and as you land forward into a right neutral bow, execute double inward club strikes to both side of your attacker's neck [right to left and left to right.] (The left club is crossing on top of the right.) Cross the action of the clubs and follow through to waist level.","Execute a left step-through front kick. As you land, execute two outward strikes to both sides of your attacker's neck [right to right, left to left.]","With your right club acting as an outward check, step your right foot to 9:30 into a rear crossover. Step your left leg to 9:30 into a left reverse bow in order to buckle out the inside of your attacker's right knee while you simultaneously execute a left downward club strike to your attacker's groin.","Step your left foot in a short step to 4 o'clock as you simultaneously execute a left vertical club strike to the left side of your attacker's face.","Without hesitation shift your left foot to 11:30 as you shoot a right reverse bow to and through your attacker's left inner knee. Simultaneous to this motion, turn your upper body clockwise as you execute a right downward club strike to your attacker's groin as you simultaneously execute a left inward club strike to the right side of your attacker's head.","Pivot clockwise into a rotating twist stance as you execute a right outward club strike to the right side of your attacker's neck followed by a left inward club strike through the same spot.","Pivot counterclockwise out of the twist stance as you execute a left outward club strike to the left side of your attacker's neck followed by a right inward strike through the same spot. Step your right foot back a short step as your right club checks horizontally against your attacker's shoulders.","Execute a left step-through front kick. As you land into a left neutral bow execute a left diagonal overheard club strike to the right side of your attacker's head."]},{"description":"Set 25: Thundering Storms (Right Front Kick / Punch Combination)","steps":["An attacker at 1:30 comes at you with a right kick followed by a right punch.","Step your right foot back to 7:30 into a left front twist stance. Pivot out of the stance with a right outward downward club strike to the back of your attacker's right knee as you simultaneously execute a left inward club strike to your attacker's right arm. Without hesitation, execute a left downward diagonal round kick to the back of your attacker's right knee.","Plant your left foot to 1:30 into a left wide kneel as you maintain your left check and execute a right inward diagonal club strike through your attacker's right ribs.","Check your attacker's right shoulder blade with your right club as you drop into a right close kneel stance and execute a left downward club strike to your attacker's kidney.","Circle your left club clockwise and check your attacker's right arm as you shift into a left wide kneel and execute a right overhead club strike to the back of your attacker's neck."]},{"description":"Set 26: Thundering Storms (Left Front Kick / Punch Combination)","steps":["An attacker at 10:30 comes at you with a left kick followed by a left punch.","Step your left foot back to 4:30 into a left rear crossover as execute a left outward downward club strike to the back of your attacker's left knee as you simultaneously execute a right inward club strike to your attacker's left arm. Without hesitation, execute a right downward diagonal round kick to the back of your attacker's left knee.","Plant your right foot to 10:30 into a right wide kneel as you maintain your right check and execute a left inward diagonal club strike through your attacker's left ribs.","Check your attacker's left shoulder blade with your left club as you drop into a left close kneel stance and execute a right downward club strike to your attacker's kidney.","Circle your right club counterclockwise and check your attacker's left arm as you shift into a right wide kneel and execute a left overhead club strike to the back of your attacker's neck."]},{"description":"Set 27: Leaping Storm (Right Step-Through Punch)","steps":["An attacker at 12 o'clock comes at you with a right step-through punch.","Leap to 9:30 into a left one-legged stance as you simultaneously execute a left inward club strike to the outside of your attacker's arms with a right inward horizontal club strike to your attacker's right ribs.","Execute a right knife-edge kick to the back of your attacker's right knee. Plant your foot to 1 o'clock into a right neutral bow as you execute a right horizontal outward club strike to your attacker's right kidney.","Step to 12 o'clock with your left foot into a right neutral bow while checking your attacker's back with your right club.","Step your right foot back to 12 o'clock into a left neutral bow (circling clockwise) as you execute a left inward diagonally downward club strike to the left side of your attacker's neck.","Rotate into a left front twist stance as you execute a right inward club strike to the right side of your attacker's neck while your left club checks."]},{"description":"Set 28: Leaping Storm (Left Step-Through Punch)","steps":["An attacker at 6 o'clock comes at you with a left step-through punch.","Leap to 8:30 into a right one-legged stance as you simultaneously execute a right inward club strike to the outside of your attacker's arms with a left inward horizontal club strike to your attacker's left ribs.","Execute a left knife-edge kick to the back of your attacker's left knee. Plant your foot to 5 o'clock into a left neutral bow as you execute a left horizontal outward club strike to your attacker's left kidney.","Step to 6 o'clock with your right foot into a left neutral bow while checking your attacker's back with your left club.","Step your left foot back to 6 o'clock into a right neutral bow (circling counterclockwise) as you execute a right inward diagonally downward club strike to the right side of your attacker's neck.","Rotate into a right front twist stance as you execute a left inward club strike to the left side of your attacker's neck while your right club checks."]},{"description":"Closing Movements:","steps":["Slide your left foot to your right and out to 9 o'clock into a horse stance facing 12 o'clock as you execute a left outward downward club strike to the inside of a right kick simultaneous with a right inward club club strike to the inside of a right punch.","Execute a right outward downward club strike to the inside of a left kick simultaneous with a left inward club strike to the inside of a left punch.","Execute a left outward club strike to the inside of a right punch as you execute a right inward downward (palm up) club strike to the inside of a right kick.","Execute a right outward club strike to the inside of a left punch as you execute a left inward downward (palm up) club strike to the inside of a left kick.","Execute a left upward outward club strike that circles counterclockwise followed by a right inward downward circular club strike that loops clockwise.","Continue this path as you execute a right upward circular club strike that loops clockwise followed by a left inward downward circular club strike that loops counterclockwise.","Simultaneously execute a right and left inward club strike followed by a right and left outward club strike.","Simultaneously execute a right and left inward downward (palm up) club strike followed by a right and left outward downward club strike.","Tuck the upper ends of both clubs under their respective armpits and pin your clubs under your arms.","Regrab the ends of your clubs with both palms up. Have both of your hands pull the clubs out, remaining horizontal to the ground. Slide your hands down both clubs towards you. Release your right hand."]},{"description":"Salutation","steps":["Step your right foot forward into a right front twist stance as you cock your right fist near your ear. Simultaneously have your left hand and clubs touch your right fist.","Step your left foot out into a left cat stance as you bring your clenched fist and your sticks to the front.","Step your left foot back to 6 o'clock as you pull with both hands back to back. Have your right foot step back in line with your left as you have your right hand circle clockwise and draw to your right hip (fist clenched, palm up). Your left hand positions the clubs vertically against your solar plexus .","Place the bottom ends of the clubs against your upper abdomen and tilt the tops of the clubs forward as your left hand followed by your right directly slides to the bottom of each of the clubs (left to left, right to right).","Slide your left foot to 9 o'clock into a horse stance facing 12 o'clock as your left club circles clockwise and right circles counterclockwise. Have the tops touch each other to form the triangle just above the level of your forehead.","Cross both clubs on each other at the midpoint as they are lowered to a level slightly below your chin.","Without loss of motion, place clubs on a vertical plane (just like praying) as they are lowered to the level of your solar plexus. Have your left hand take control of both clubs.","As you bring your left foot to your right into an attention stance, your left hand is holding the clubs downward.","Bow."]}]}