{
	"description": "This is Grandmaster Edmund K. Parker's signature form. It's one of the longest and most complex of all the forms in the Kenpo Karate system. Again, it is a technique form and the techniques are done on both the left and the right side.",
	"steps": [{
		"description": "SET 1: PROTECTING FANS (Left & Right Punch Combination)",
		"steps": ["Have your left foot step forward toward 10:30 into a left neutral bow, as you deliver a left inward horizontal heel palm parry to the inside of your attacker's left punch. Have your right hand cock at your right hip (hand open and palm up).",
		"As your attacker delivers a right punch, pivot into a left forward bow. While pivoting, execute a right extended outward block (done as a handsword) to the outside of your attacker's right arm. Your left hand cocks to your left hip (hand open and palm up).",
		"Immediately pivot to your right at the waist, as you execute a left horizontal finger thrust to your attacker's eyes. Simultaneously deliver a right front snap kick to your attacker's groin, as your right hand grabs his right arm (sliding to the wrist) pull it diagonally down past you right hip. In the form, your right hand returns to your right hip (hand open and palm up)."]
	},
	{
		"description": "ISOLATION",
		"steps": ["Plant your right foot toward 3 o'clock into a horse stance, facing 12 o'clock. As you plant, deliver a right inward elbow strike (hand open and palm down) to your attacker's sternum or head depending upon circumstances. Simultaneously execute a left back elbow strike (hand open and palm up) behind you.",
		"Deliver a left straight finger thrust crossing over your right shoulder to eye-level as you simultaneously execute a right back elbow (hand open and palm up) behind you.",
		"Simultaneously deliver a right straight finger thrust to 12 o'clock to eye-level as you execute a left downward handsword behind you.",
		"Execute a left outward block as you simultaneously execute a right downward hammerfist behind you.",
		"Execute a right outward block as you simultaneously execute a left snapping inward block (This motion is the same break as in Glancing Salute. Both arms should end in matching positions.)",
		"Simultaneously execute two vertical outward snapping back knuckle strikes (left fist to 9 o'clock and right fist to 3 o'clock).",
		"Immediately curve both of your shoulders forward and in, as both of your strikes convert into two low uppercuts crossing in front of your mid-section (left over right). Your right fist strikes to 9 o'clock while your left fist strikes to 3 o'clock.",
		"Without hesitation continue circling both of your fists and convert them into two outward overhead claws.",
		"While still continuing the circles, convert your overhead claws into two slaps alongside of your legs while simultaneously sliding your right foot to your left foot thus concluding this move in an attention stance. (When slapping the sides of your thighs have both of your hands open and commence both slaps by first striking with the heel of your palms before concluding with the fingers.)"]
	},
	{
		"description": "SET 2: PROTECTING FANS (Right & Left Punch Combination)",
		"steps": ["Have your right foot step forward toward 1:30 into a right neutral bow, as you deliver a right inward horizontal heel palm parry to the inside of your attacker's right punch. Have your left hand cock at your left hip (hand open and palm up).",
		"As your attacker delivers a left punch, pivot into a right forward bow. While pivoting, execute a left extended outward block (done as a handsword) to the outside of your attacker's left arm. Your right hand cocks to your right hip (hand open and palm up).",
		"Immediately pivot to your left at the waist, as you execute a right horizontal finger thrust to your attacker's eyes. Simultaneously deliver a left front snap kick to his groin, as your left hand grabs his left arm (sliding to the wrist) pulling it diagonally down past your left hip. In the form, your left hand returns to your left hip (hand open and palm up)."]
	},
	{
		"description": "ISOLATION",
		"steps": ["Plant your left foot toward 9 o'clock into a horse stance, facing 12 o'clock. As you plant, deliver a left inward elbow strike to your attacker's sternum or head depending upon the circumstances. Simultaneously execute a right back elbow strike (hand open and palm up) behind you.",
		"Deliver a right straight finger thrust crossing over the left shoulder to eye-level as you simultaneously execute a left back elbow strike (hand open and palm up) behind you.",
		"Simultaneously deliver a left straight finger thrust to 12 o'clock at eye-level as you deliver a right downward handsword behind you.",
		"Execute a right outward block as you simultaneously execute a left downward hammerfist behind you.",
		"Execute a left outward block as you simultaneously deliver a right snapping inward block. (This motion should resemble that of the opening move of Glancing Salute. Both arms should end in matching positions.)",
		"Simultaneously execute two vertical outward snapping back knuckle strikes. (left fist to 9 o'clock and right fist to 3 o'clock.)"]
	},
	{
		"description": "SET 3: DARTING LEAVES (Right Straight Thrust Punch)",
		"steps": ["From your horse stance facing 12 o'clock, shift your weight to your left leg and drop into a right 45-degree cat stance facing 1:30. Simultaneously deliver a left inward block toward 1:30 blocking to the outside of your attacker's right arm (at the elbow) as your right hand cocks to your right hip, hand open and palm up.",
		"Immediately execute a right two-finger spear to the right eye of your attacker. (Be sure to use the back of your left wrist as a guide in threading your two-finger spear.) Simultaneously execute a right front snap kick (toward 1:30) to your attacker's groin.",
		"With your hands remaining at their \"Point of Contact,\" have your right foot return to Point of Origin and plant toward 3:00 on line and pivot into a left 45 degree cat stance facing 10:30."]
	},
	{
		"description": "SET 4: DARTING LEAVES (Left Straight Thrust Punch)",
		"steps": ["As you settle into a cat stance, simultaneously execute a right inward block toward 10:30 blocking to the outside of your attacker's left arm (at the elbow) as your left hand cocks to your left hip, hand open and palm up.",
		"Immediately execute a left two-finger spear to the left eye of your attacker. (Be sure to use the back of your right wrist as a guide in threading your two-finger spear.) Simultaneously execute a left front snap kick (toward 10:30) to his groin.",
		"With your right hand remaining at its \"Point of Contact\" as a positional inward block, have your right foot plant toward 3:00 on line with your left foot into a transitional horse stance, facing 12 o'clock. Have your left hand re-cock at your left hip, fist clenched, palm up.",
		"As you plant, you want to reassert your inward block by pulling back a little and blocking again."]
	},
	{
		"description": "SET 5: UNFURLING CRANE (Right and Left Punch Combination)",
		"steps": ["Have your right foot slide back toward 4:30 into a left neutral bow facing 10:30 as you execute a left outward block simultaneously with a right downward block.",
		"Step-drag forward towards 10:30 while executing a right outward block simultaneous with a left downward hammerfist to your attacker's groin.",
		"Pivot into a left forward bow facing 10:30 as you execute a right inward overhead claw (eyebrow level) to your attacker's face. Pivot back to a neutral bow as you execute a left rolling vertical back knuckle strike to your attacker's face."]
	},
	{
		"description": "SET 6: UNFURLING CRANE (Left and Right Punch Combination)",
		"steps": ["Have your left foot slide back toward 7:30 into a right neutral bow, facing 1:30, as you execute a right outward block simultaneous with a left downward block.",
		"Step-drag toward 1:30 while executing a left outward block simultaneous with a right downward hammerfist to your attacker's groin.",
		"Pivot into a right forward bow facing 1:30, as you execute a left inward overhead claw (eyebrow level) to your attacker's face. Pivot back to a neutral bow as you execute a right rolling vertical back knuckle strike to your attacker's face."]
	},
	{
		"description": "SET 7: DESTRUCTIVE KNEEL (Right Step-Through Punch)",
		"steps": ["As a punch comes at you, pull your right foot back into a cat stance as you execute a right outward parry to the outside of your attacker's punch. Grab your attacker's wrist and step your right foot to 6 o'clock and step-drag deep into a right close kneel as you execute a left palm strike to the back of your attacker's elbow.",
		"Push drag to 12 o'clock into a left close kneel stance as you execute a right inward horizontal claw to your attacker's face and a left outward back knuckle strike to your attacker's ribs.",
		"Pivot clockwise into a right close kneel as you execute a right outward back knuckle strike to your attacker's lower spine with a left vertical punch to your attacker's upper spine."]
	},
	{
		"description": "SET 8: DESTRUCTIVE KNEEL (Left Step-Through Punch)",
		"steps": ["As a punch from 12 o'clock comes at you, step your left foot to 6 o'clock as you execute a left outward parry to the outside of your attacker's punch. Step-drag deep into a left close kneel as you execute a right palm strike to the back of your attacker's elbow.",
		"Push drag to 12 o'clock into a right close kneel stance as you execute a left inward horizontal claw to your attacker's face and a right outward back knuckle strike to your attacker's ribs.",
		"Pivot counterclockwise into a left close kneel as you execute a left outward back knuckle strike to your attacker's lower spine with a right vertical punch to your attacker's upper spine."]
	},
	{
		"description": "SET 9: FLASHING WINGS (Right Step-Through Punch)",
		"steps": ["From your previous move, execute a right, front, rotating twist stance by having your right foot move slightly toward 10:30 and turning clockwise while delivering a right upward block. (This block makes contact under and outside of your attacker's right arm.)",
		"From your transitory right front rotating twist stance, have your left foot step toward 12 o'clock into a left neutral bow while simultaneously executing a left inward block to the outside of your attacker's right arm to break the arm.",
		"Step drag and pivot into a left forward bow as you execute a right inward elbow strike to your attacker's right lower ribcage, which follows through after making contact and by-passes your attacker's ribs. Your left hand slides and checks your attacker's right arm just below the shoulder during the course of your elbow strike.",
		"Pivot clockwise into a horse stance as you execute a right outward elbow with a heel palm claw across your attacker's face (making sure that your left forearm is a sliding check as it travels up the right arm of your attacker).",
		"Push drag to 6 o'clock, into a left reverse wide kneel to 6 o'clock but looking to 12 o'clock as you execute a right outward handsword to the back of your attacker's neck followed by a left inward handsword that strikes the back of your attacker's neck.",
		"Pivot counterclockwise into a left close kneel stance as your left hand slides down and past your attacker's right shoulder to check and pin his right arm to his body. Simultaneous with this action execute a right upward thrusting handsword (palm up) to your attacker's throat."]
	},
	{
		"description": "SET 10: FLASHING WINGS (Left Step-Through Punch)",
		"steps": ["From your previous move, execute a left, front, rotating twist stance by having your left foot move slightly toward 1:30 and turning counterclockwise while delivering a left upward block. (This block makes contact under and outside of your attacker's left arm.)",
		"From your transitory left, front, rotating twist stance, have your right foot step toward 1:00 into a right neutral bow while simultaneously executing a right inward block to the outside of your attacker's left arm. (This block should break your attacker's arm.)",
		"Step drag and pivot into a right forward bow as you deliver a left inward elbow strike to your attacker's left lower ribcage which follows through after making contact and by-passes your attacker's ribs. (Your right hand slides and checks your attacker's left arm just below the shoulder during the course of your elbow strike.)",
		"Pivot counterclockwise into a horse stance as your execute a left outward elbow strike to your attacker's left kidney.",
		"Push drag to 6 o'clock, into a right reverse wide kneel to 6 o'clock but looking to 12 o'clock as you execute a left outward handsword to the back of your attacker's neck followed by a right inward handsword that strikes the back of your attacker's neck.",
		"Pivot clockwise into a right close kneel stance as your right hand slides down and past your attacker's left shoulder to check and pin his left arm to his body. Simultaneously execute a left upward thrusting handsword (palm up) to your attacker's throat."]
	},
	{
		"description": "SET 11: GATHERING CLOUDS (Right Punch)",
		"steps": ["From your previous move, have your left foot slide toward 6 o'clock into a horse stance, facing 9 o'clock. As you slide your left foot, execute a left inward parry to the outside of your attacker's right arm as you simultaneously execute a right inward vertical middle-knuckle rake to and through your attacker's right ribcage. (Your hands have to come uncrossed to do this move, thus they have to travel much faster than your foot.)",
		"Immediately reverse the motion of your right hand and execute a right outward handsword to the right lower ribcage of your attacker. (Your left hand is still checking your attacker's right arm.)",
		"Step forward with your right foot into a right neutral bow, facing 9 o'clock, planting your right foot to the inside of your attacker's right foot and buckling his right knee with your right knee. (You are on and over the \"Line of Entry\".) As you settle into your right neutral bow, deliver a right inward elbow strike to the front of your attacker's right lower ribcage. Your left hand is still bracing up against your attacker's right elbow. (In the form, this elbow strike and check will appear as an elbow sandwich."]
	},
	{
		"description": "SET 12: GATHERING CLOUDS (Left Punch)",
		"steps": ["Have your left foot step behind your right foot (toward 12 o'clock) into a transitional twist stance. Without hesitation have your right foot step toward 6 o'clock, as you pivot on your left foot into a horse stance, facing 3 o'clock. As you maneuver, execute a right inward parry to the outside of your attacker's left arm as you simultaneously execute a left inward vertical middle-knuckle rake to and through your attacker's left ribcage.",
		"Immediately reverse the motion of your left hand and execute a left outward handsword to the left lower ribcage of your attacker. (Your right hand is still checking your attacker's left arm.)",
		"Step forward with your left foot into a left neutral bow, facing 3 o'clock, planting your left foot to the inside of your attacker's left foot and buckling his left knee with your left knee. (You are on and over the \"Line of Entry.\") As you settle into your left neutral bow, deliver a left inward elbow strike to the front of your attacker's left lower ribcage. Your right hand is still bracing up against your attacker's left lower ribcage. Your right hand is still bracing up against your attacker's left elbow. (In the form, this elbow strike and check will appear as an elbow sandwich.)"]
	},
	{
		"description": "SET 13: CIRCLES OF PROTECTION (Right Step-Through Overhead Punch)",
		"steps": ["From your previous position, have your left foot slide back to your right foot into a left transitional cat stance facing 10:30 as you simultaneously cock your right horizontal forearm (hiding it from the view of your attacker).",
		"Immediately have your left foot step toward 10:30 into a left forward bow as you simultaneously execute a right upward parry under and outside of your attacker's right punch (above the elbow). (First meet the force and then ride it.)",
		"Shift to your right into a left neutral bow as you deliver a left upward ripping claw to your attacker's face (under his right arm). Your right open hand is high to the right side of your face momentarily checking under and slightly outside of your attacker's right arm.",
		"Continue circling your left hand counterclockwise and force your attacker's right arm down to the right side of his body. Simultaneously continue the clockwise circle of your right hand and execute a right underhand claw to your attacker's groin. (At this moment, your left hand should be on top of your right forearm prior to exploding into the next move.)",
		"Without hesitation, push drag forward as you execute a left outward backfist strike to your attacker's face. During this action, your right hand grabs and pulls your attacker's testicles. Be sure that your left leg is positioned properly as a check to protect your groin. (Be sure that your backfist strike snaps back toward your right forearm, which is still in the position of an underhand claw.)"]
	},
	{
		"description": "SET 14: CIRCLES OF PROTECTION (Left Step-Through Overhead Punch)",
		"steps": ["From your previous move, execute a left front crossover toward 4:30. During your cover step, cock your left forearm under your right forearm, both horizontally.",
		"Complete your front crossover toward 4:30, stepping out into a right forward bow stance as you simultaneously execute a left upward parry under and outside of your attacker's left punch (above the elbow). (First meet the force and then ride it.)",
		"Shift to your left into a right neutral bow as you deliver a right upward ripping claw to your attacker's face (under his left arm). Your left open hand is high to the left side of your face momentarily checking under and slightly outside of your attacker's left arm.",
		"Continue circling your right hand counterclockwise and force your attacker's left arm down to the left side of his body. Simultaneously continue the clockwise circle of your left hand and execute a left underhand claw to your attacker's groin. (At this moment your right hand should be on top of your left forearm prior to exploding into the next move.)",
		"Without hesitation, push drag forward as you execute a right outward backfist strike to your attacker's face. During this action, your left hand grabs and pulls your attacker's testicles. (Be sure that your right leg is positioned properly as a check to protect your groin.)"]
	},
	{
		"description": "SET 15: DANCE OF DARKNESS (Right Kick & Right Punch Combination)",
		"steps": ["Step your right foot behind your left foot toward 1:30 into a left front twist stance, facing 7:30. As you drop back into your twist stance, execute a right outward downward parry (open hand) to the outside of your attacker's right leg. Have your left hand check at your solar plexus.",
		"As your attacker follows through with a right punch toward your head. Execute a left inward parry as you step forward with your right foot toward 7:30 into a right neutral bow to the outside of your attacker's right leg, as you execute a double parry to the outside of his right arm (left inward parry at the wrist or forearm, followed by a right outward parry at or above the elbow).",
		"Have your left foot step to 7:30 into a transitory left neutral bow with your hands cocked right over left at your left hip. Pivot clockwise into a right close kneel facing 10:30 as you execute a right outward backfist to your attacker's kidney with a left vertical punch to your attacker's upper spine. [Your right hand is on the bottom to act as an immediate check, if necessary.]",
		"Immediately have your left hand grab your attacker's right shoulder. As you firmly pull down on your attacker's right shoulder to control his \"Height Zones,\" simultaneously thrust a right vertical back knuckle strike to the base of your attacker's skull.",
		"Drop your right punching hand into a small counterclockwise loop and execute a right two-finger hook to your attacker's left eye. Your left hand should be checking on top of, or near, his right shoulder. (The loop that your right hand makes can check down your attacker's right arm for a moment before striking.)",
		"Execute a left front crossover sweep to 1:30 to your attacker's right leg. Utilizing the principle of \"Object Obscurity,\" circle your left hand around and under your right arm so that it tracks along the outside of your right arm to strike as a left two-finger spear to your attacker's left eye. This spear is executed a beat after your left foot plants from the crossover sweep. (Your right hand should now be checking.)"]
	},
	{
		"description": "SET 16: DANCE OF DARKNESS (Left Kick & Left Punch Combination)",
		"steps": ["From the final position of your last technique, unwind into a left neutral bow facing 1:30 with both of your hands up in a guarding position.",
		"Have your left foot step back of your right foot toward 7:30 into a right front twist stance facing 1:30 as you execute a left outside downward parry (open hand) to the outside of your attacker's left leg. Have your right hand check at your solar plexus.",
		"As your attacker follows through with a left punch toward your head execute a right inward parry. Step forward with your left foot to 1:30 into a left neutral bow to the outside of your attacker's left leg as you execute a right inward parry at the wrist or forearm followed by a left outward parry at or above the elbow.",
		"Have your right foot step to 1:30 into a right neutral bow with your hands cocked left over right at your right hip. Pivot counterclockwise into a left close kneel facing 7:30 as you execute a left outward backfist strike to the kidney with a right vertical punch to your attacker's upper spine. [Your left hand is on the bottom to act as an immediate check if necessary.]",
		"Immediately have your right hand grab your attacker's left shoulder. As you firmly pull down on your attacker's left shoulder to control his \"Height Zones,\" simultaneously thrust a left vertical back knuckle strike to the base of your attacker's skull.",
		"Drop your left punching hand into a small clockwise loop and execute a left two-finger hook to your attacker's right eye. Your right hand should be checking on top of, or near, his left shoulder. (The loop can check down on the attacker's arm for a moment before striking.)",
		"Execute a right front crossover sweep to 7:30 to your attacker's left leg. Utilizing the principle of \"Object Obscurity,\" circle your right checking hand around and under your left arm so that it tracks along the outside of your left arm to strike as a right two-finger spear to your attacker's right eye. This spear is executed at the moment your right foot plants from the crossover sweep. (Your left hand should now be checking.)"]
	},
	{
		"description": "SET 17: THUNDERING HAMMERS (Right Step-Through Punch)",
		"steps": ["Continuing your motion, step your left foot out toward 9 o'clock in a left neutral bow, as you execute a left inward block to the outside of your attacker's right arm. Your right arm hangs naturally at your side.",
		"Push-drag forward toward 9 o'clock as you drop into a left wide kneel stance as you strike horizontally across your attacker's stomach with a right inward horizontal forearm while cocking your left fist high.",
		"Pivot clockwise as you drop lower into a right close kneel stance facing 1:30 as you strike to your attacker's left kidney with a left inward overhead hammerfist as your right checks at your attacker's right shoulder.",
		"Pivot counterclockwise into a left wide kneel stance as your left hands checks your attacker's right shoulder and your right hand executes a right inward overhead hammerfist strike to the back of your attacker's neck.",
		"Step your left foot to 4:30 into a right neutral bow facing 10:30 as you execute a right downward backfist strike to your attacker's right temple. As you settle into your right neutral bow, reverse the motion of your right hand and convert it into a right upward lifting stiff-arm heel palm strike to your attacker's face. Simultaneous with your heel palm strike, have your left hand check your attacker's right shoulder down."]
	},
	{
		"description": "SET 18: THUNDERING HAMMERS (Left Step-Through Punch)",
		"steps": ["Immediately pivot counterclockwise into a left rotating twist stance, facing 3 o'clock. As you pivot execute a right upward block and a left backfist to your previous attacker.",
		"Step your right foot out toward 3 o'clock into a right neutral bow as you execute a right inward block to the outside of your attacker's left arm. Your left arm hangs naturally at your side. Be sure to check your attacker's left leg with your right leg.",
		"Push-drag forward towards 3:00 as you drop into a right wide kneel stanceas you strike horizontally across your attacker's stomach with a left inward horizontal forearm strike while cocking your right fist high.",
		"Pivot counterclockwise as you drop lower into a left close kneel stance facing 7:30 as you strike to your attacker's right kidney with a right inward overhead hammerfist as your left hand checks your attacker's left shoulder.",
		"Pivot clockwise into a right wide kneel stance as your right hand checks at your attacker's leftshoulder and your left hand executes a left inward overhead hammerfist strike to the back of your attacker's neck.",
		"Step your left foot to 7:30 into a left neutral bow, facing 1:30 as you execute a left downward backfist strike to your attacker's left temple. As you settle into your left neutral bow, reverse the motion of your left hand and convert it into a left upward lifting stiff-arm heel palm strike to your attacker's face. Simultaneous with your heel palm strike, have your right hand check your attacker's left shoulder down."]
	},
	{
		"description": "SET 19: UNWINDING PENDULUM (Right Kick & Right Punch Combination)",
		"steps": ["Step your right foot back to 1:30 into a left front twist stance, facing 7:30. Simultaneous with your twist stance, execute a right downward block to the outside of your attacker's right leg. Simultaneous with this block, have your left hand cock slightly above your solar plexus in preparation for a left inward block.",
		"As your attacker follows up with a right punch, pivot clockwise into a left neutral bow facing 7:30 as you execute a left inward block to the outside of your attacker's right arm. Have your right arm hang naturally along your right hip and thigh during this maneuver. (This action, combined with the previous block, should result in turning your attacker so that his back faces you.)",
		"Immediately execute a right front crossover sweeping kick to the back of your attacker's left knee. (This should buckle as well as force your attacker's left leg to spread apart from his right leg.)",
		"Have your right foot plant forward into a right front twist stance as you execute a right underhand crane strike to your attacker's groin from the rear. As you strike have your left hand horizontally check your attacker's arms at his elbows."]
	},
	{
		"description": "SET 20: UNWINDING PENDULUM (Left Kick & Left Punch Combination)",
		"steps": ["Step your left foot back to 10:30 into a right front twist stance, facing 4:30. As you drop back into your twist stance, execute a left downward block to the outside of your attacker's left leg. Simultaneous with this block, have your right hand cock slightly above your solar plexus in preparation for a right inward block. (This should turn your attacker slightly to his right.)",
		"As your attacker follows up with a left punch, pivot counterclockwise into a right neutral bow facing 4:30 as you execute a right inward block to the outside of your attacker's left arm. Have your left arm hang naturally along your left hip and thigh during this maneuver. (This action, combined with the previous block, should result in turning your attacker so that his back faces you.)",
		"Immediately execute a left front crossover sweeping kick to the back of your attacker's right knee. (This should buckle as well as force your attacker's right leg to spread apart from his left leg.)",
		"Have your left foot plant forward into a left front twist stance as you execute a left underhand crane strike to your attacker's groin from the rear. As you strike have your right hand horizontally check your attacker's arms at his elbows."]
	},
	{
		"description": "SET 21: REVERSING CIRCLES (Left Roundhouse Kick & Left Punch Combination)",
		"steps": ["Step your right foot step out to 7:30 into a right neutral bow, as you execute a universal block (right downward with a left inward block) to the inside of your attacker's left leg.",
		"As your attacker plants his left foot and attempts to punch your head with his left hand, pivot into a right forward bow, facing 7:30, while executing a right upward block under, as well as inside of, your attacker's left arm. Simultaneous with right upward block, deliver a left thrusting heel palm (finger pointing toward 10:30) to his left floating ribs.",
		"Pivot into a right neutral bow as your reverse the motion of your left hand and convert it into a left upward block under your attacker's left arm. Simultaneous with this action, reverse the motion of your right arm and convert it into a right thrusting heel palm strike (fingers pointing toward 4:30) to his right floating ribs."]
	},
	{
		"description": "SET 22: REVERSING CIRCLES (Right Roundhouse Kick & Right Punch Combination)",
		"steps": ["Step your left foot to your right foot and then step out toward 1:30 into a left neutral bow, as your execute a universal block (left downward with a right inward block) to the inside of your attacker's right leg.",
		"As your attacker plants his right foot and attempts to punch your head with his right hand, pivot into a left forward bow, facing 4:30, while executing a left upward block under, as well as inside of, your attacker's right arm. Simultaneous with your left upward block, deliver a right thrusting heel palm (fingers pointing toward 1:30) to his right floating ribs.",
		"Pivot into a left neutral bow as you reverse the motion of your right hand and convert it into a right upward block under your attacker's right arm. Simultaneous with this action reverse the motion of your left arm and convert it into a left thrusting heel palm strike (fingers pointing toward 7:30) to his right floating ribs."]
	},
	{
		"description": "SET 23: SNAKING TALON (Two-Hand Push)",
		"steps": ["Push drag to 1:30 into a right 45 degree cat stance as you have your left hand check near the right side of your face, fingers pointing up (\"Corresponding Angle\" to your right cheek bone). Simultaneous with this check, position your left handsword above your left knee, palm facing 7:30, and fingers pointing down (\"Corresponding Angle\" to your left bent leg).",
		"Have your right hand loop a figure eight (following a path and not a line). Begin with a right inward handsword on the outside and top of your attacker's right arm. Flow into a right extended outward handsword on the outside of your attacker's right arm. (Both actions are to diagonally check your attacker's \"Height and Width Zones\" by conveniently criss-crossing your attacker's arms diagonally and down.) During this action your right hand continues to check the side of your face.",
		"While still within the flow of action, have your left hand pull your attacker's left arm toward you (down and to your left), as you deliver a right front snap kick to your attacker's groin."]
	},
	{
		"description": "SET 24: SNAKING TALON (Two-Hand Push)",
		"steps": ["Push drag to 10:30 into a left 45-degree cat stance facing 4:30 as you have your right hand check near the left side of your face, fingers pointing up (\"Corresponding Angle\" to your right cheek bone). Simultaneous with this check, position your left handsword above your left knee, palm facing 7:30, and fingers pointing down (\"Corresponding Angle\" to your left bent leg).",
		"Have your left hand loop a figure eight (following a path and not a line). Begin with a left inward handsword on the outside and top of your attacker's right arm. Flow into a left extended outward handsword on the outside of your attacker's left arm. (Both actions are to diagonally check you attacker's \"Height and Width Zones\" by conveniently criss-crossing your attacker's arms diagonally and down.) During this action your right hand continues to check the side of your face.",
		"While still within the flow of action have your left hand pull your attacker's left arm toward you (down and to your left), as you deliver a left front snapping ball kick to your attacker's groin."]
	},
	{
		"description": "SET 25: CIRCLING FANS (Left/Right Punch Combination)",
		"steps": ["From your previous move, plant your left foot back in line into a horse stance facing 6 o'clock. As you plant, cock your left hand on your left hip palm up and open.",
		"As your attacker attacks from your right flank, turn to your right into a right 45-degree cat stance, facing 9 o'clock. As you turn, redirect your attacker's left punch by executing a right push-down block, and then as you settle into your cat stance, execute a left push-down to the outside of your attacker's right punch. Simultaneous with your left block, have your right hand cock to your right hip, fist clenched and palm up.",
		"Execute a right front snap kick to your attacker's groin.",
		"Plant your right foot toward 9 o'clock into a horse stance as you execute a right thrusting vertical back knuckle strike to your attacker's face."]
	},
	{
		"description": "SET 26: CIRCLING FANS (Right/Left Punch Combination)",
		"steps": ["An attacker comes at you from your left flank. Pull your left foot into a left 45-degree cat stance facing 3 o'clock. As you turn, redirect your attacker's right punch by executing a left push-down block, and then as you settle into your cat stance, execute a right pushdown block to the outside of your attacker's left punch. Simultaneous with your right block, have your left hand cock to your left hip, fist clenched and palm up.",
		"Execute a left front snap kick to your attacker's groin.",
		"Plant your left foot toward 3 o'clock into a horse stance as you execute a left thrusting vertical back knuckle strike to your attacker's face."]
	},
	{
		"description": "SET 27: CIRCLING WINDMILLS (Isolation)",
		"steps": ["From your previous move, turn your upper body to 6 o'clock into a horse stance. Execute a combination right upward block with a left heel palm strike (with your fingers facing in) to your attacker's solar plexus.",
		"While still in a horse stance, execute a left upward blockwith a right inward hammerfist strike to mid-level.",
		"Execute a right upward block with a left inward hammerfist to mid-level.",
		"Execute a right inward hammerfist at head level as you chamber your left hand.",
		"Execute a right outward horizontal finger slice (palm down) to eye-level. Immediately follow up with a right inward horizontal finger slice (palm up) across eye-level, and then with another right outward horizontal finger slice (palm down) across eye-level.",
		"Execute a left inward hammerfist to head-level as your right hand cocks near your right hip, in the shape of a crane, palm down.",
		"Execute a left outward horizontal finger slice (palm down) to eye-level. Immediately follow up with a left inward horizontal finger slice (palm up) to eye-level, followed by a left outward horizontal finger slice to eye-level.",
		"Your left hand now cocks near your left hip, in the shape of a crane, palm down.",
		"Execute two two-finger overhead whips to eye-level.",
		"Torque your hands, palms in and facing each other, as your now execute two two-finger thrusts to eye-level.",
		"Execute two thumb pokes to eye-level.",
		"Reverse the motion of your hands, torquing your palms toward you, as you execute two inward little finger eye rakes to eye-level.",
		"Execute two thumb pokes to eye-level.",
		"Execute two downward heel palm claws (which will take you into the next set)."]
	},
	{
		"description": "SET 28: DEFENSIVE CROSS (Right Front Snap Kick)",
		"steps": ["As your attacker kicks with his right foot, step back with your right foot (toward 12 o'clock) as you settle into a left forward bow stance (facing 6 o'clock). Simultaneously execute a solidly braced downward \"X\" block (right hand over left hand) on top of your attacker's right ankle.",
		"Immediately have your left hand convert into the shape of a crane (fingers and palm out) as it hooks inside of, and under, your attacker's right foot. (Have your right hand remain on top of your attacker's right foot to act as a check.) Without disrupting the flow of your hands, guide your attacker's kicking leg diagonally down, and past your left hip.",
		"With your attacker's balance disturbed, and his body moving toward you, continue to orbit your hands, convert your right hand into an outward overhead back knuckle strike to the right side of your attacker's face, with your left hand following. As your right hand strikes diagonally through your attacker's face and past your right hip execute a left inward overhead heel palm strike to the right jawbone of your attacker.",
		"Grab your attacker's hair with your left hand (your right hand is still positioned past your right hip). While maintaining the hair grab (or your chosen alternative), execute a right front snap kick to your attacker's groin.",
		"As your replant your right foot back to its \"Point of Origin,\" simultaneously execute a right upward, lifting stiff-arm back knuckle strike to your attacker's face to sandwich his head between your right back knuckle and left grab."]
	},
	{
		"description": "SET 29: DEFENSIVE CROSS (Left Front Snap Kick)",
		"steps": ["As your attacker kicks with his left foot, step back with your left foot (toward 12 o'clock) as you settle into a right forward bow stance (facing 6 o'clock). Simultaneously execute a solidly braced downward \"X\" block (left hand over right hand) on top of your attacker's left ankle.",
		"Immediately have your right hand convert into the shape of a crane (fingers and palm out) as it hooks inside of, and under, your attacker's left foot. (Have your left hand remain on top of your attacker's left foot to act as a check.) Without disrupting the flow of your hands, guide your attacker's kicking leg diagonally down, and past your right hip.",
		"With your attacker's balance disturbed, and his body moving toward you, continue the clockwise direction of your orbiting hands to the right of your body. As you continue to orbit your hands, convert your left hand into an outward overhead back knuckle strike to the left side of your attacker's face, with your right hand following. As your left hand strikes diagonally through your attacker's face and travels past your left, hip execute a right inward overhead palm strike to the left jawbone of your attacker.",
		"Grab to your attacker's hair with your right hand, or to the back of his neck (your left hand is still positioned past your left hip). While maintaining the hair grab (or your chosen alternative), execute a left front snap kick to your attacker's groin.",
		"As you replant your left foot back to its \"Point of Origin,\" simultaneously execute a left upward, lifting stiff-arm back knuckle strike to your attacker's face to sandwich his head between your left back knuckle and right grab."]
	},
	{
		"description": "SET 30: BOWING TO BUDDHA (Right Front Kick)",
		"steps": ["As your attacker delivers a right round kick, drop down onto your left knee as you simultaneously execute a right inward block to the inside of your attacker's right leg.",
		"Shuffle forward (step with the right foot - drag with the left knee) as you execute a right upward elbow strike to your attacker's groin. (Your elbow strike should complete its \"Path of Travel\" as a positional right upward block with the right clenched palm facing you.) Simultaneous with this block, execute a left upward heel palm strike to his groin.",
		"With your left hand still under your attacker's testicles, pull his testicles toward you, as you deliver a right downward back knuckle strike (torquing your fist clockwise) to sandwich his testicles."]
	},
	{
		"description": "SET 31: BOWING TO BUDDHA (Left Front Kick)",
		"steps": ["As your attacker delivers a left round kick, hop-switch onto your right knee as your simultaneously execute a left inward block to the inside of your attacker's left leg.",
		"Shuffle forward (step with the left foot - drag with the right knee) as you execute a left upward elbow strike to your attacker's groin. (Your elbow strike should complete its \"Path of Travel\" as a left upward block with the left clenched palm facing you.) Simultaneous with this block, execute a right upward heel palm strike to his groin.",
		"With your right hand still under your attacker's testicles, pull his testicles toward you, as you deliver a left downward back knuckle strike (torquing your fist clockwise) to sandwich his testicles."]
	},
	{
		"description": "SET 32: PRANCE OF THE TIGER (Right Flank - Right Step Through Uppercut Punch)",
		"steps": ["Your attacker attacks from 7:30 with a right step through uppercut punch. Stand up and rise into a left 45 degree cat stance facing 6 o'clock. As you rise into your cat stance, execute a left outside downward, hooking parry to the inside of your attacker's right elbow. Follow this block with a right sweeping inside downward block (palm up) to the inside of your attacker's right arm (near his hand).",
		"As your right hand follows through (cocking palm up near your left hip), position your left hand in the front of and to the right of your solar plexus in a check. Immediately execute a left thrusting sweep kick to the shin of your attacker's right leg while continuing to check with your left hand, should your attacker wish to reactivate his right arm.",
		"Continue the flow of your action by delivering a right knife-edge kick to the inside of your attacker's left knee (a right side chicken kick). Simultaneous with your right kick, execute a right outward back knuckle strike to your attacker's right temple. Your left hand should continue to check."]
	},
	{
		"description": "SET 33: PRANCE OF THE TIGER (Left Flank - Left Step Through Uppercut Punch)",
		"steps": ["Replant your right foot straight down in front of you into a right 45 degree cat stance, facing 6 o'clock. As you plant into your cat stance, cock your left clenched fist at your left ear (as for an inward block) simultaneous with a right pushdown block.",
		"As your attacker comes from 4:30 with a left step through uppercut punch, execute a right outside downward, hooking parry to the inside of your attacker's left elbow. Follow this block with a left sweeping inside downward block (palm up) to the inside of your attacker's left arm (near his hand).",
		"As your left hand follows through (cocking palm up near your right hip), position your right hand in the front of and to the left of, your solar plexus in a check. Immediately execute a right thrusting sweep kick to the shin of your attacker's left leg while continuing to check with your right hand, should your attacker wish to reactivate his left arm.",
		"Continue the flow of your action by delivering a left knife-edge kick to the inside of your attacker's right knee (a left side chicken kick). Simultaneous with your left kick, execute a left outward back knuckle strike to your attacker's left temple. Your right hand should continue to check."]
	},
	{
		"description": "SET 34: SHIELD AND MACE (Right Step-Through Punch)",
		"steps": ["From the point of contact of your previous strikes, have your left foot step 7:30 into a left transitional neutral bow, facing 9 o'clock. Immediately pivot to your right into a horse stance and deliver a right vertical outward block to the outside of your attacker's right arm. This is done while simultaneously delivering a left straight punch to your attacker's right lower ribcage.",
		"Pivot to your left and drop into a left close kneel as you strike down with a right hammerfist to the top of your attacker's right kidney, driving down to the pelvic area. Your left hand is now \"Bracing Angle Check\" at your attacker's right elbow.",
		"Circle your left hand clockwise and pin your attacker's right arm down to his own body as your right hand circles counterclockwise striking your attacker's face and eyes with a right looping inward horizontal claw.",
		"Continue the flow of the counterclockwise circle of your right hand and have it continue down and along the back of your attacker's body and right leg to strike the back of your attacker's right knee.",
		"Without raising your body, follow up with a right knife-edge kick to the back of your attacker's left knee."]
	},
	{
		"description": "SET 35: SHIELD AND MACE (Left Step-Through Punch)",
		"steps": ["From the point of contact of your previous kick, have your right foot step toward 4:30 into a right transitional neutral bow, facing 3 o'clock. Immediately pivot to your left into a horse stance and deliver a left vertical outward block to the outside of your attacker's left arm. This is done while simultaneously delivering a right straight punch to your attacker's left lower ribcage.",
		"Pivot to your right and drop into a right close kneel as your strike down with a left hammerfist to the top of your attacker's left kidney, driving down to the pelvic area. Your right hand is now a \"Bracing Angle Check\" at your attacker's left elbow.",
		"Circle your right hand clockwise and pin your attacker's left arm down to his own body as your left hand circles counterclockwise striking your attacker's face and eyes with a left looping inward horizontal claw.",
		"Continue the flow of the counterclockwise circle of your left hand and have it contour down and along the back of your attacker's body and left leg to strike the back of your attacker's left knee with your left handsword. The action is to buckle your attacker's left leg. Have your right hand circle clockwise and check just below your attacker's left knee.",
		"Without raising your body, follow up with a left knife-edge kick to the back of your attacker's right knee."]
	},
	{
		"description": "SET 36: FIVE SWORDS (Right Step-Through Kick and Roundhouse Punch)",
		"steps": ["From the \"Point of Contact\" of your left kick, have your left foot plant toward 9 o'clock into a horse stance, facing 12 o'clock. As you plant, have both of your hands cock to your right hip (right hand as a handsword, palm up and your left hand as a handsword, palm down with your fingers pointing toward 3 o'clock).",
		"Have your right foot step to 12 o'clock into a right neutral bow, facing 12 o'clock. In the process, execute a left outside downward parry to the inside of your attacker's right kicking leg. Simultaneously execute a right inward block (done as a handsword) to the inside of your attacker's right punch.",
		"Immediately strike to the right side of your attacker's neck with a right outward handsword.",
		"Pivot into a right forward bow, facing 12 o'clock, as you execute a left five finger thrust (palm down) to your attacker's eyes while your right hand cocks to your right hip, fist clenched and palm up.",
		"Having caused your attacker's head to move away from you will cause his midsection to jut forward. Take advantage of this anticipated response by pivoting into a right neutral bow, as you strike with a right upward thrust to your attacker's stomach. In the process your left hand becomes a cocking check, that is guarding horizontally, palm down near your right biceps.",
		"With your attacker now bending over, immediately have your left foot slide counterclockwise toward 4:30, into a right forward bow (while now facing 10:30), as your left outward handsword strikes to the left side of your attacker's neck Your right hand acts as a check against any potential danger from your attacker's left arm.",
		"Without hesitation and while pivoting into a right neutral bow, execute a right inward handsword to the back of your attacker's neck. Your left hand should be checking low."]
	},
	{
		"description": "SET 37: FIVE SWORDS (Left Step-Through Kick and Roundhouse Punch)",
		"steps": ["Step your left foot to 12 o'clock as you execute a right outward downward parry to the inside of your attacker's leg followed by a right inward block to the inside of your attacker's left punch.",
		"Immediately strike to the left side of your attacker's neck with a left outward handsword.",
		"Pivot into a left forward bow, facing 12 o'clock, as you execute a right five finger thrust (palm down) to your attacker's eyes while your left hand cocks to your left hip, fist clenched and palm up.",
		"Having caused your attacker's head to move away from you will cause his midsection to jut forward. Take advantage of this anticipated response by pivoting into a left neutral bow, as you strike with a left upward thrust to your attacker's stomach. In the process your right hand becomes a cocking check that in guarding horizontally, palm down near your left biceps.",
		"With your attacker now bending over, immediately have your right foot slide counterclockwise (toward 4:30) into a left forward bow (while now facing 10:30), as your right outward handsword strikes to the right side of your attacker's neck. Your left hand acts as a check against any potential danger from your attacker's right arm.",
		"Without hesitation and while pivoting into a left neutral bow, execute a left inward handsword to the back of your attacker's neck. Your right hand in an interim hook around the right side of your attacker's neck. Your right hand should be checking low."]
	},
	{
		"description": "SET 38: TWIRLING HAMMERS (Left Step-Through Punch)",
		"steps": ["While standing in a left neutral bow, your attacker executes a left step through punch. Immediately shift your left foot slightly to your right (toward 3 o'clock) into a left front twist stance as you execute a left extended outward block to the outside of your attacker's left arm (at or above your attacker's left elbow). Your right hand checks near your solar plexus.",
		"Without loss of momentum, have your right foot step forward into a right neutral bow (facing 12 o'clock) as your execute a right looping overhead back knuckle strike to your attacker's right mastoid, while maintaining your left extended outward block.",
		"Continue the looping action of your right hand and convert it into a right pressing check at your attacker's left lower ribcage.",
		"Without any loss of motion, convert your left elbow strike into an upward hooking wrist check (waiter's hand). Simultaneously pivot into a right neutral bow as you now loop (clockwise) a right inward hammerfist strike, diagonally and down, to your attacker's right kidney."]
	},
	{
		"description": "SET 39: TWIRLING HAMMERS (Right Step-Through Punch)",
		"steps": ["While standing in a right neutral bow, your attacker executes a right step through punch. Immediately shift your right foot slightly to your left (toward 9 o'clock) into a right front twist stance as you execute a right extended outward block to the outside of your attacker's right arm (at or above your attacker's right elbow). Your left hand checks near your solar plexus.",
		"Without loss of momentum, have your left foot step forward into a left neutral bow (facing 12 o'clock) as your execute a left looping overhead back knuckle strike to your attacker's left mastoid, while maintaining your right extended outward block.",
		"Continue the looping action of your right hand and convert it into a left pressing check at your attacker's right elbow. Simultaneously pivot into a left forward bow and deliver a right inward horizontal elbow strike to your attacker's right ribcage.",
		"Without loss of motion convert your right elbow strike into an upward hooking wrist check (waiter's hand). Simultaneously pivot into a left neutral bow as you now loop (clockwise) a left inward hammerfist strike, diagonally and down, to your attacker's left kidney."]
	},
	{
		"description": "CLOSING:",
		"steps": ["Execute a left front crossover toward 4:30. During the cover step have your right clenched fist, which is covered by your left open hand cock near your right side.",
		"To complete the crossover hop onto your right foot into a right one-leg stance, now having your right and left hands cock near your right ear.",
		"Have your left foot plant toward 9 o'clock into a meditative horse facing 12 o'clock.",
		"Come to attention.",
		"Complete the formal salutation.",
		"Bow."]
	}]
}