{"steps":["Drop your right foot back to 6 o'clock in a left neutral bow to start the second Kicking Set.","Execute a front chicken kick beginning with the left leg and continuing with the right. Land in a right neutral bow facing 12 o'clock.","Execute a front chicken kick beginning with the left leg and continuing with the right. Land in a right neutral bow facing 12 o'clock.","Execute a rear chicken kick beginning with the right leg and continuing with the left leg. Land in a right neutral bow facing 12 o'clock.","Execute a rear chicken kick beginning with the left leg and continuing with the right leg. Land in a right neutral bow facing 12 o'clock.","Execute a front chicken kick beginning with the right leg and continuing with the left leg. Land in a left neutral bow facing 12 o'clock.","Execute a front chicken kick beginning with the right leg and continuing with the left leg. Land in a left neutral bow facing 12 o'clock.","Execute a rear chicken kick beginning with the left leg and continuing with the right leg. Land in a left neutral bow facing 12 o'clock.","Execute a rear chicken kick beginning with the right leg and continuing with the left leg. Land in a left neutral bow facing 12 o'clock.","Execute a side chicken kick to 3 o'clock beginning with a left thrusting sweep kick and right snapping knife edge kick. Land in a right neutral bow facing 12 o'clock.","Execute a side chicken kick to 9 o'clock beginning with a right thrusting sweep kick and a left snapping knife-edge kick. Land in a left neutral bow facing 12 o'clock.","Execute a left front scoop kick and step back to 6 o'clock so you are in a right neutral bow facing 12 o'clock.","Cover to the rear by stepping your right foot over. You will be in a left neutral bow facing facing 6 o'clock.","Execute a right front scoop kick and step back to 6 o'clock so you are in a left neutral bow facing 6 o'clock.","Step your left foot back to 3 o'clock into a right neutral bow facing 9 o'clock.","Execute a right front scoop kick and step back to 3 o'clock into a left neutral bow facing 9 o'clock.","Cover to the rear by moving your left foot over. You will be in a right neutral bow facing 3 o'clock.","Execute a left front scoop kick and step back to 9 o'clock into a right neutral bow facing 3 o'clock.","Step your left foot to 6 o'clock into a right neutral bow facing 12 o'clock.","Execute a left rear scoop kick and step to 12 o'clock into a left neutral bow facing 12 o'clock.","Execute a right spinning back scoop kick to 12 o'clock and land in a right neutral bow facing 6 o'clock.","Step your right foot to 9 o'clock into a left neutral bow facing 3 o'clock.","Execute a right rear scoop kick and step to 3 o'clock you are in a right neutral bow facing 3 o'clock.","Execute a left spinning rear scoop kick to 3 o'clock and step to 9 o'clock into a left neutral bow facing 9 o'clock.","Step your right foot to 6 o'clock into a left neutral bow facing 12 o'clock.","Execute a right front snap kick to 12 o'clock. Immediately (point of origin) execute a right round kick to 12 o'clock. Land in a right neutral bow facing 12 o'clock.","Instantly execute a right knife-edge kick to 12 o'clock. Land in a right neutral bow facing 12 o'clock.","Execute a left front snap kick to 12 o'clock. Immediately (point of origin) execute a left round kick to 12 o'clock. Land in a left neutral bow facing 12 o'clock.","Instantly execute a left knife-edge kick to 12 o'clock. Land in a left neutral bow facing 12 o'clock.","Execute a right front snap kick to 12 o'clock. Immediately execute a right rear kick to 6 o'clock. Immediately follow that with the right knife-edge kick to 12 o'clock. [This is all without planting into a stance.] Land in a right neutral bow facing 12 o'clock.","Execute a left front snap kick to 12 o'clock. Immediately execute a left rear kick to 6 o'clock. Immediately execute a left knife-edge kick to 12 o'clock. [This is all without planting into a stance.] Land in a right neutral bow facing 12 o'clock.","Execute a right front snap kick to 12 o'clock. Immediately execute a right rear kick to 6 o'clock. Immediately execute a right knife-edge kick to 12 o'clock. [Point of Origin, again.] Land in a left neutral bow facing 12 o'clock.","Execute a left front snap kick to 12 o'clock. Immediately execute a left rear kick to 6 o'clock. Immediately execute am left knife-edge kick to 12 o'clock. [Point of Origin, still.] Land in a right neutral bow facing 12 o'clock.","Step back to horse stance Attention stance.","Bow."]}