{"description":"The kicks are arranged in sets of four, each set consisting of a front kick, a round kick, a knife-edge (or side) kick, and a back kick. The rest is how those above mentioned weapons are transferred, either through such methods as a step-through, or a shuffle. The entire set forms a square, and the hands should always be in a guard position. Also, all kicks should be up at the belt-level.","steps":[{"description":"Begin","steps":["Bow.","Start from a horse stance facing 12 o'clock.","Drop your right foot back to 6 o'clock in a left neutral bow facing 12 o'clock to start the Kicking Set."]},{"description":"Set 1:","steps":["Begin by executing a step through right front thrust kick, landing forward in a right neutral bow.","Step into a front crossover and execute a right leg knife-edge kick, landing forward in a right neutral bow.","Execute a shuffle round kick, landing in a right neutral bow.","Execute a spinning back kick into which you plant into a left neutral bow.","Drop your right foot back toward 9 o'clock so that you are facing 3 o'clock."]},{"description":"Set 2:","steps":["Execute a right step-through knife-edge kick, landing in a right neutral bow.","Follow that with a left foot shuffle and a right front snap kick staying in the right neutral bow.","Follow that with a left foot shuffle and a right round kick staying in the right neutral bow.","Follow with a left foot shuffle and then execute a right rear kick, and with the right leg, land in a left neutral bow facing 6 o'clock. Step back again so you end up in a right neutral bow facing 6 o'clock."]},{"description":"Set 3:","steps":["Execute a left leg spinning back kick, landing in a left neutral bow.","Follow with a left shuffle and a round kick, landing in a left neutral bow.","Follow that with a left shuffle and a front snap kick, landing in a left neutral bow.","Follow that with a left shuffle knife-edge kick, landing in a left neutral bow.","Drop your right foot back towards 3 o'clock so that you are in a left neutral bow facing 9 o'clock."]},{"description":"Set 4:","steps":["Execute a step-through right round kick and land in a right neutral bow. Note: The original Kicking Set by Tom Kelly started the fourth set with the front kick and then round, then rear. This was changed by Mr. Parker to have each set start with a different kick.","Follow that with a left step through spinning rear kick, landing in a left neutral bow.","After that, execute a right front kick landing forward in a right neutral bow.","Follow that with a left step-through knife-edge kick, landing a horse stance facing 12 o'clock."]},{"description":"Attention Stance. Bow.","steps":[]}]}