{"steps":[{"description":"Set 1: Destructive Twins (Two-Hand Choke)","steps":["An attacker from 12 o'clock grabs your throat with both hands.","Step your right foot forward into a right neutral bow as you execute a 'U' punch towards 12 o'clock. [Your left hand should be striking at your attacker's face and your right hand striking at their groin.]","Shift your right foot towards 1 o'clock into a right forward bow as you execute a left outward block and chamber your right hand.","Execute a left hand spear at your attacker's eyes.","With that left hand, grab them and frictionally pull them into a right reverse punch as you shift into a horse stance facing 10:30.","They grab your hand. Roll your hand (palm up) and snatch back. Frictionally knock their hand down. Execute a right reverse punch again to the attacker's solar plexus.","They grab again. Pull your hand back to your chest, execute a right backfist to your attacker's face.","Step back into a horse stance"]},{"description":"Set 2: Destructive Twins (Two-Hand Choke)","steps":["An attacker from 12 o'clock grabs your throat with both hands.","Step your left foot forward into a left neutral bow as you execute a 'U' punch towards 12 o'clock. [Your right hand should be striking at your attacker's face and your left hand striking at their groin.]","Shift your left foot towards 1 o'clock into a left forward bow as you execute a right outward block and chamber your left hand.","Execute a right hand spear at your attacker's eyes.","With that right hand, grab them and frictionally pull them into a left reverse punch as you shift into a horse stance facing 1:30.","They grab your hand. Roll your hand (palm up) and snatch back. Frictionally knock their hand down. Execute a left reverse punch again to the attacker's solar plexus.","They grab again. Pull your hand back to your chest, execute a left backfist to your attacker's face.","Step back into a horse stance."]},{"description":"Set 3: Crashing Wings (Rear Bear-Hug; Arms Free)","steps":["An attacker grabs you in a bear hug from 6 o'clock, but leaves your arms free.","Step into a wide horse stance as you execute two outward overhead elbows down onto your attacker's forearms.","Pull your left foot to your right in a cat stance facing 9 o'clock with your hands at your right hip (right fist, palm up; left fist above it vertically.)","Step your left foot to 7:30 (essentially just behind your attacker). Pivot into a left forward bow as you execute a left outward elbow followed immediately by a right hammerfist to your attacker's groin.","Pivot back into a horse stance facing 10:30."]},{"description":"Set 4: Dominating Circles / Tripping Arrow (Two Hand Grab)","steps":["An attacker from 10:30 grabs your lapels from the finishing position of Crashing Wings.","Step your left foot to 10:30 around and behind your attacker's left leg into a horse stance facing 12 o'clock as you execute a left outward overhead elbow to your attacker's sternum. (Your right hand is at your right hip.)","Grab your attacker and turn towards 3 o'clock into a right forward bow as you push them towards 3 o'clock.","Return to your wide horse stance"]},{"description":"Set 5: Isolation","steps":["Shift from a wide horse stance to a normal horse stance by bringing your right leg back in.","An attacker at 12 o'clock grabs both of your chambered wrists. As they do this, punch straight down.","Roll them inwards and up, against your attacker's thumbs.","Execute two vertical back knuckle strikes to your attacker's face."]},{"description":"Set 6: Crashing Wings (Rear Bear Hug; Arms Free)","steps":["An attacker grabs you in a bear hug from 6 o'clock, but leaves your arms free.","Step into a wide horse stance as you execute two outward overhead elbows down onto your attacker's forearms.","Pull your right foot to your left in a cat stance facing 3 o'clock with your hands at your left hip (left fist, palm up; right fist above it vertically.)","Step your right foot to 4:30 (essentially just behind your attacker). Pivot into a right forward bow facing 4:30 as you execute a right outward elbow followed immediately by a left hammerfist to your attacker's groin.","Pivot back into a horse stance facing 1:30."]},{"description":"Set 7: Dominating Circles / Tripping Arrow (Two Hand Grab)","steps":["An attacker from 1:30 grabs your lapels from the finishing position of Crashing Wings.","Step your right foot to 1:30 around and behind your attacker's right leg into a horse stance facing 12 o'clock as you execute a right outward overhead elbow to your attacker's sternum. (Your left hand is at your left hip.)","Grab your attacker and turn towards 9 o'clock into a left forward bow as you push them towards 9 o'clock.","Return to your wide horse stance"]},{"description":"Set 8: Isolation","steps":["Step your left foot back in from a wide horse stance to a normal horse stance by bringing your left leg back in..","An attacker at 12 o'clock grabs both of your chambered wrists. As they do this, punch straight down.","Roll them inwards and up, against an attacker's thumbs.","Execute two vertical back knuckle strikes to your attacker's face.","Return your hands to chamber. Now someone from 6 o'clock puts you in a rear bear hug leaving your arms free.","Cross your hands, grabbing their thumbs. Pull their thumbs outward, twisting their wrists to free yourself."]},{"description":"Set 9: Parting Wings (Two-Hand Push)","steps":["An attacker comes at you from 12 o'clock and attempts to push you.","Step back to 6 o'clock with your right foot so you are in a left neutral bow facing 12 o'clock as you execute a right and a left extended outward block at the same time (palms open) to clear away your attacker's arms.","Shift into a left forward bow as you execute a right inward handsword into your attacker's ribs. (Your left hand should become a check at your chin and prepare for the next strike.)","Shift back into a left neutral bow as you execute a left outward handsword. (Your right hand should be in a ready position for the next strike.)","Shift back into your forward bow as you execute a right middle-knuckle strike to your attacker's solar plexus."]},{"description":"Set 10: Parting Wings (Two-Hand Push)","steps":["An attacker comes at you from 12 o'clock and attempts to push you.","Switch step your right foot up to 12 o'clock and step your left foot back to 6 o'clock so you are in a right neutral bow facing 12 o'clock as you execute a left and a right extended outward block at the same time (palms open) to clear away your attacker's arms.","Shift into a right forward bow as you execute a left inward handsword into your attacker's ribs. (Your right hand should become a check at your chin and prepare for the next strike.)","Shift back into a right neutral bow as you execute a right outward handsword. (Your left hand should be in a ready position for the next strike.)","Shift back into your forward bow as you execute a left middle-knuckle strike to your attacker's solar plexus."]},{"description":"Set 11: Glancing Spear (Direct Left Wrist Grab)","steps":["Your attacker grabs your left wrist with their right hand from 12 o'clock.","Step back with your right foot towards 6 o'clock into a left neutral bow as your right hand snakes under your own left wrist and grabs your attacker's right wrist. Continue this motion until you are in a left reverse bow as you pull your opponent towards 6 o'clock.","Shift back into a neutral bow as you execute a left outward elbow strike to your attacker's head. (Have your right hand pull on their arm, drawing them into the strike.)","Release your right hand's grasp and execute a right hand spear (palm down) to their eyes. [This hand spear will ricochet off your attacker's forearm and into their eyes. (Your right hand remains out for the next set.)"]},{"description":"Set 12: Glancing Spear (Direct Right Wrist Grab)","steps":["Your attacker grabs your right wrist with their left hand from 12 o'clock.","Step back with your left foot towards 6 o'clock into a right neutral bow as your left hand snakes under your own right wrist and grabs your attacker's left wrist. Continue this motion until you are in a right reverse bow as you pull your opponent towards 6 o'clock.","Shift back into a neutral bow as you execute a right outward elbow strike to your attacker's head. (Have your left hand pull on their arm, drawing them into the strike.)","Release your left hand's grasp and execute a left hand spear (palm down) to their eyes. [This hand spear will glance off their forearm and ricochet into their eyes.]"]},{"description":"Set 13: Pinned Wing (Attackers at Sides- Isolation)","steps":["Step your right foot back so you are in a horse stance facing 12 o'clock.","Rotate your right arm counterclockwise dropping your elbow into their elbow, crease point, drawing them in. Execute a vertical back knuckle strike to your attacker's face.","Rotate your left arm clockwise dropping the elbow onto their elbow, drawing them in. Execute a left vertical back knuckle strike to the other attacker's face."]},{"description":"Set 14: Controlled Wing (Attackers at Sides- Isolation)","steps":["Rotate your right arm clockwise around your attacker's arm (this should press against their elbow joint) and execute a right backfist to your attacker's ribs.","Rotate your left arm counterclockwise around your other attacker's arm, (pressing against their elbow joint) and execute a left backfist to your attacker's ribs."]},{"description":"Set 15: Pinned Wing (Attackers at Sides- Isolation)","steps":["Do this with both arms, the right moving counterclockwise and the left moving clockwise. Drop, drawing both attacker's in and simultaneously execute vertical back knuckle strikes to the respective attacker's face."]},{"description":"Set 16: Controlled Wing (Attackers at Sides- Isolation)","steps":["Repeat again with both arms. This time, the right will move clockwise and the left will rotate counterclockwise Wrap around the attacker's arm, pressing on the elbow joint and simultaneously execute two backfists to the respective attacker's ribs.","Return to your horse stance Leave both hands down to represent the next set of grab techniques."]},{"description":"Set 17: Crossing Talon (Cross Left Wrist Grab)","steps":["An attacker at 12 o'clock grabs your left hand with their left hand.","Step towards 12 o'clock with your right foot into a right neutral bow. Simultaneously roll their arm as you use the pressure of a right forearm strike against their left elbow joint to push them over.","Execute a right outward elbow strike to their temple as your left hand pulls them into the strike.","Reach down and claw their face; as you pull up, loop your arm clockwise so you execute an inward overhead elbow down onto their back.","Return to your horse stance"]},{"description":"Set 18: Crossing Talon (Cross Right Wrist Grab)","steps":["An attacker at 12 o'clock grabs your right hand with their right hand.","Step towards 12 o'clock with your left foot into a left neutral bow. Simultaneously roll their arm as you use the pressure of a left forearm strike against their right elbow joint to push them over.","Execute a left outward elbow strike to their temple as your right hand pulls them into the strike.","Reach down and claw their face; as you pull up, loop your arm clockwise so you execute an inward overhead elbow down onto their back.","Return to your horse stance"]},{"description":"Set 19: Thrusting Wedge (Two-Hand Push)","steps":["Step your right foot to 7:30 in a right neutral bow as an attacker at 7:30 comes in with a push.","As you land in that neutral bow, execute two thumb strikes poking to your attacker's eyes.","Shift into a right forward bow as you grab their right shoulder with your left hand and frictionally pull down on their left arm with your right hand.","Shift into a right neutral bow as you execute a right upward elbow strike.","Execute a right overhead claw to your attacker's face as you shift back into a right forward bow.","Return to your horse stance"]},{"description":"Set 20: Thrusting Wedge (Two-Hand Push)","steps":["Step your left foot to 4:30 in a left neutral bow as an attacker at 4:30 comes in with a push.","As you land in that neutral bow, execute two thumb strikes poking to your attacker's eyes.","Shift into a left forward bow as you grab their left shoulder with your right hand and frictionally pull down on their right arm with your left hand.","Shift into a left neutral bow as you execute a left upward elbow strike.","Execute a left overhead claw to your attacker's face as you shift back into a left forward bow.","Return to your horse stance"]},{"description":"Set 21: Blinding Sacrifice (Two-Hand Lapel Grab)","steps":["An attacker at 10:30 grabs your lapels with their hands.","Step to 10:30 with your left foot into a left neutral bow as you execute two thumb strikes poking into your attacker's eyes. As you land, loop your attacker's hands down and shove both of their hands into their own groin.","Pull your left foot into a cat stance as you execute two inverted back knuckles strikes to each side of your attacker's kidneys. (You will pull these back to chamber.)","Step your left foot back out to 10:30 as you execute two thumb strikes poking into your attacker's eyes.","Rake down with your thumbs. Loop back up and execute two inverted vertical punches to your attacker's temples. Collapse your fists so you strike with your forearms (resembling vertical outward blocks).","Grab your attacker's head and pull them down into a left knee to their face.","Return to your horse stance."]},{"description":"Set 22: Blinding Sacrifice (Two-Hand Lapel Grab)","steps":["An attacker at 1:30 grabs your lapels with their hands.","Step to 1:30 with your right foot into a right neutral bow as you execute two thumb strikes poking into your attacker's eyes. As you land, loop your attacker's hands down and shove both of their hands into their own groin.","Pull your right foot into a cat stance as you execute two inverted back knuckles strikes to each side of your attacker's kidneys. (You will pull these back to chamber.)","Step your right foot back out to 1:30 as you execute two thumb strikes poking into your attacker's eyes.","Rake down with your thumbs. Loop back up and execute two inverted vertical punches to your attacker's temples. Collapse your fists so you strike with your forearms (resembling vertical outward blocks).","Grab your attacker's head and execute a right knee to your attacker's face.","Return to your horse stance."]},{"description":"Set 23: Wings of Silk (Rear Two Hand Wrist Grab)","steps":["An attacker from 6 o'clock attempts to pin your arms in a bear hug.","Execute a left hand pinch to your attacker's thigh and a left stomp to their instep.","Bring your right foot up into your attacker's groin as you push down with your left hand to break their grip.","Step to 9 o'clock with your right foot into a front crossover as your left hand grabs your attacker's left arm.","Pivot counterclockwise as you step your left foot to 9 o'clock into a rear crossover.","Unwind into a horse stance facing 12 o'clock, execute a right vertical punch to your attacker's elbow.","Return to your horse stance by circling clockwise."]},{"description":"Set 24: Wings of Silk (Rear Two Hand Wrist Grab)","steps":["An attacker from 6 o'clock attempts to pin your arms in a bear hug.","Execute a right hand pinch to your attacker's thigh and a right stomp to their instep.","Bring your left foot up into your attacker's groin as you push down with your right hand to break their grip.","Step to 3 o'clock with your left foot into a front crossover as your right hand grabs your attacker's right arm.","Pivot clockwise as you step your right foot to 3 o'clock into a rear crossover.","Unwind into a horse stance facing 12 o'clock, execute a left vertical punch to your attacker's elbow.","Return to your horse stance by circling counterclockwise"]},{"description":"Set 25: Repeated Devastation / Scraping Hoof (Full Nelson)","steps":["An attacker from 6 o'clock puts you in a full nelson.","Instantly punch straight down as you straighten up, slamming the back of your head into the bridge of their nose.","Shift into a right rear bow. Execute a right rear kick to your attacker's left knee. Follow that with a right knife-edge kick to your attacker's right knee. [Gauging where it is.] Follow that with a right side stomp, scraping down their shin and onto their right foot.","As you plant, pivot into a left rear bow and execute a left rear kick to your attacker's right knee. Follow that with a left knife-edge kick to your attacker's left knee. [Gauging where it is.] Follow that with a left side stomp, scraping down their shin and onto their left foot.","Step your left foot to 12 o'clock into a left neutral bow as you pull them (with your left) into a right outward elbow. Note: To execute this grab, you will have to snake under your attacker's left arm with your left arm and grab on top of your attacker's right arm.","Step your left foot back into a horse stance Grab. Step your right foot to 12 o'clock into a right neutral bow as you pull them (with your right) into a left outward elbow. Note: To execute this grab, you will have to snake under your attacker's right arm with your right arm and grab on top of your attacker's left arm.","Step your right foot back to 6 o'clock so you are now in a horse stance."]},{"description":"Set 26: Desperate Falcons (Double Wrist Grab)","steps":["An attacker from 12 o'clock grabs your hands with their hands.","Extend your left hand to match the right hand's distance from you.","Step your left foot towards 12 o'clock into a left neutral bow as you rotate your hands in a clockwise circle. Pull them in to lock up your attacker's wrists.","Execute a left backfist and a right vertical thrust punch."]},{"description":"Set 27: Desperate Falcons (Double Wrist Grab)","steps":["An attacker from 12 o'clock grabs your hands with their hands.","Extend your right hand to match the left hand's distance from you.","Step your right foot towards 12 o'clock into a right neutral bow as you rotate your hands in a counterclockwise circle. Pull them in to lock up your attacker's wrists.","Execute a right backfist and a left vertical thrust punch."]},{"description":"Closing","steps":["Pull your left foot to your right into an attention stance.","Formal Salutation.","Bow."]}]}