{"steps":["Have your left foot step back toward 6 o'clock into a right neutral bow, facing 12 o'clock as you simultaneously execute a right hammering inward block. (Elbow should be implied on all these blocks).","Pivot into a right forward bow toward 12 o'clock as you execute a left punch toward 12 o'clock. (Contrary to Kenpo rules, you will chamber your blocking hand during all punches).","Slide your right foot into a right transitional cat stance while executing a right thrusting inward block. Complete your right step through by having your right foot plant back toward 6 o'clock into a left neutral bow. As you settle into your left neutral bow, execute a left thrusting inward block.","Pivot into a left forward bow toward 12 o'clock as you execute a right punch to 12 o'clock.","Cover (by moving your right foot toward 3 o'clock) into a left neutral bow facing 9 o'clock, while simultaneously executing a left vertical outward block.","Pivot into a left forward bow toward 9 o'clock as you execute a right punch to 9 o'clock.","Step your left foot back to 3 o'clock into a right neutral bow facing 9 o'clock, as you execute a right vertical outward block.","Pivot into a right forward bow toward 9 o'clock as you execute a left punch to 9 o'clock.","Cover (step right foot to 6 o'clock, look towards 3 o'clock) as you execute a left outward elbow. Immediately pivot in-place into a left neutral bow facing 3 o'clock, while simultaneously executing a left upward block.","Pivot into a left forward bow toward 3 o'clock as you execute a right punch to 3 o'clock.","Step your left foot back towards 9 o'clock into a right neutral bow facing 3 o'clock, as you execute a right upward block.","Pivot into a right forward bow toward 3 o'clock as you execute a left punch to 3 o'clock.","Cover (V-step- fall back into a cat stance, step your right foot to 6 o'clock) into a right neutral bow facing 6 o'clock, as you execute a right downward block.","Pivot into a right forward bow toward 6 o'clock as you execute a left punch to 6 o'clock.","Step your right foot back to 12 o'clock into a left neutral bow facing 6 o'clock as you execute a left downward block.","Pivot into a left forward bow toward 6 o'clock as you execute a right punch to 6 o'clock.","Pivot back to a left neutral bow facing 6 o'clock while simultaneously executing a left inward block.  Execute a right inward block.  Execute a left inward block.","Step your left foot back to 12 o'clock into a right neutral bow, facing 6 o'clock as you execute a right inward block.Execute a left inward block.Execute a right inward block.","Cover (by moving your left foot toward 3 o'clock) into a right neutral bow facing 9 o'clock as you execute a right outward block.Execute a left outward block.Execute a right outward block.","Step your right foot back to 3 o'clock into a left neutral bow facing 9 o'clock as you execute a left outward block.Execute a right outward block.Execute a left outward block.","Cover (by moving your left foot toward 9 o'clock) into a right neutral bow facing 3 o'clock as you execute a right upward block.Execute a left upward block.Execute a right upward block.","Step your right foots back to 9 o'clock into a left neutral bow facing 3 o'clock as you execute a left upward block.Execute a right upward block.Execute a left upward block.","Cover (by moving your right foot to a side cat stance, then toward 6 o'clock) into a left neutral bow facing 12 o'clock as you execute a left downward block.Execute a right downward block.Execute a left downward block.","Step your left foot back to 6 o'clock into a right neutral bow facing 12 o'clock as you execute a right downward block.Execute a left downward block.Execute a right downward block.","Step your left foot to 9 o'clock into a horse stance, facing 12 o'clock. This maneuver is simultaneously done it while executing a left inward downward block palm down.Execute a right inward downward block (palm down).Execute a left inward downward block (palm down).","Cock your right hand high. Execute a right inside downward block (palm up) simultaneously with a left back elbow strike.Cock your left hand high. Execute a left inside downward block (palm up) simultaneously with a right back elbow strike.Cock your right hand high. Execute a right inside downward block (palm up) simultaneously with a left back elbow strike.","Execute a left push-down block simultaneously with a right back elbow strike.Execute a right push-down block simultaneously with a left back elbow strike.Execute a left push-down block simultaneously with a right back elbow strike.","Execute a right straight punch to 12 o'clock simultaneously with a left back elbow strike.Execute a left straight punch to 12 o'clock simultaneously with a right back elbow strike.Execute a right punch to 10:30 simultaneously with a left back elbow strike.Execute a left punch to 1:30 simultaneously with a right back elbow strike.Execute a right straight punch to 9 o'clock simultaneously with a left back elbow strike.Execute a left straight punch to 3 o'clock simultaneously with a right back elbow strike.Execute a right upper cut punch to 12 o'clock simultaneously with a right back elbow strike.Execute a left upper cut punch to 12 o'clock simultaneously with a left back elbow strike."]}