{"steps":["Step your right foot forward into a right neutral bow as you execute a right inward block. Execute a outward handsword to 12 o'clock. Shift into a forward bow as you execute a left palm strike to head level. (Your right hand should be cocked at your hip.) As you shift back into a right neutral bow, execute a right inverted horizontal punch to the mid-section.","Step your left foot forward into a left neutral bow as you execute a left inward block. Execute a left outward handsword to 12 o'clock. Shift into a forward bow as you execute a right palm strike to head level. (Your left hand should be cocked at your hip.) As you shift into a right neutral bow, execute a left inverted horizontal punch to the mid-section.","Pull your left foot back to your right as you face 12 o'clock in a cat stance. (Your hands cocked at your right hip, left on top, right palm up.)","Step your left foot to 9 o'clock into a left neutral bow as you execute a left outward block and a right reverse punch. Execute a left jab. Snap it back as you execute a right reverse punch. Execute another left jab as you simultaneously execute a left knife-edge kick, landing in a left neutral bow.","Pull your right foot your left so you are in a cat stance facing 12 o'clock. (Your hands should be at your left hip, right on top, left palm up.)","Step your right foot to 3 o'clock into a right neutral bow as you execute a right outward block and a left reverse punch. Execute a right jab. Snap it back as you execute a left reverse punch. Execute a right jab simultaneous with a right knife-edge kick, landing in a right neutral bow.","Pull your left foot to your right into a cat stance facing 12 o'clock. (Your hands should be cocked at your right hip, left on top, right palm up.)","Step your left foot to 5 o'clock into a left neutral bow facing 6 o'clock as you execute a universal block (with the right hand as the inward block.)","Shift into a left forward bow facing 6 o'clock as you simultaneously execute a left upward block and a right back hammerfist to the groin (to 6 o'clock).","Turn your upward block into a overhand claw followed by a right backfist. Execute a left backfist and followed by a right backfist.","Pull your right foot to your left and step your right foot to 12 o'clock into a right neutral bow facing 12 o'clock as you execute a universal block (with the left hand as the inward block.)","Shift into a right forward bow facing 12 o'clock as you simultaneously execute a right upward block and a left back hammerfist to the groin (to 12 o'clock).","Turn your upward block into an overhead claw followed by a left backfist. Execute a right backfist followed by a left backfist.","Step your right foot to 10:30 in a left neutral bow facing 4:30 as your left backfist drops into a left downward block. Continue this motion as you execute a left overhead looping back knuckle strike to the back of your attacker's head. Chamber your looping backfist and pivot into a left forward bow as you execute a right reverse punch. Execute a right front thrust kick and left jab.","Land forward to 4:30 and pivot into a right neutral bow as you execute a midrange right vertical thrust punch.","Step your right foot to 7:30 into a right neutral bow as you execute a right downward block. Continue this motion as you execute a right overhead looping back knuckle strike to the back of your opponent's head. Chamber your right back knuckle strike and pivot into a right forward bow as you execute a left reverse punch. Execute a left front thrust kick and a right jab.","Land forward to 7:30 and pivot into a left neutral bow as you execute a midrange left vertical thrust punch.","Step to 1:30 as you execute a left overhead chopping punch to 1:30 (target could be the bridge of an attacker's nose) simultaneous with a left retarded ball kick to knee level.","Land in a twist stance and step out into a right neutral bow as you execute a right uppercut into a forearm strike. Execute a left one-finger eye poke. Using this as a gauge, execute a right one-finger eye poke. Instantly follow that with a left one-finger eye poke.","Step to 10:30 as you execute a right overhead chopping punch to 10:30 (target could again be the bridge of an attacker's nose) simultaneous with a right retarded ball kick to knee level.","Land in a twist stance and step out into a left neutral bow as you execute a left upper cut into a forearm strike. Execute a right one-finger eye poke. Using this as a gauge, execute a left one-finger eye poke. Follow that with another right one-finger eye poke.","Execute a left inward downward block (palm up) as you step into a rear twist stance towards 4:30. Unwind into a right neutral bow facing 10:30 as you execute a right uppercut.","Execute a right inward downward block (palm up) as you step into a rear twist stance towards 4:30. Unwind into a left neutral bow facing 10:30 as you execute a left uppercut.","Step your right foot back to 7:30 into a left neutral bow as you execute a left inward downward block (palm down). Convert it to a left vertical back knuckle strike.","Step your left foot back to 7:30 into a right neutral bow as you execute a right inward downward block (palm down). Covert it to a right vertical back knuckle strike.","Pivot into a right forward bow as you execute a left push down block. Pivot in place into a twist stance. Step your left foot to 1:30 into a left neutral bow as execute a left outward ovrhead elbow strike. Follow that with a left overhead claw.","Pivot into a left forward bow as you execute a right push down block. Pivot in place into a twist stance. Step your right foot to 1:30 into a right neutral bow as you execute a right outward overhead elbow strike. Follow that with a right overhead claw.","Pivot into a right forward bow as you execute a left push down block. Pivot in place into a twist stance. Step your left foot to 1:30 into a left neutral bow as you execute a left outward overhead elbow strike. Follow that with a left overhead claw.","Execute a right thrust punch to 1:30. Follow that by executing a left inward forearm strike.","Step your left foot into a rear crossover towards 7:30. Unwind so you are a right neutral bow facing 1:30 as you execute an inward overhead elbow.","Step your right foot into a rear crossover to 7:30. As you unwind into a left neutral bow facing 1:30, execute a left inward overhead elbow.","Step into a rear crossover towards 9:00. Unwind as you execute a right inward elbow and a left palm heel strike. (An elbow sandwich that slides through to cock for the next move.)","Execute two simultaneous outward elbows.","Chamber the left arm and collapse the right arm against your body, chambered for a back elbow. Execute a right back elbow and a left upward elbow.","Go to a meditative horse stance."]}