{"steps":["Start from a horse stance facing 12 o'clock.","Step your right foot forward towards 12 o'clock into a right neutral bow while executing a right inward block with your left hand checking low. Execute a right outward hand sword. (Sink into a wide kneel utilizing marriage of gravity.)","Step your left foot forward towards 12 o'clock into a left neutral bow while executing a left inward block with your right hand checking low. Execute a left outward hand sword. (Sink into a wide kneel.)","Slide your left foot into a left cat stance while covering your right fist (on hip, palm up) with a left vertical fist. Step out into a left neutral bow facing 9 o'clock while simultaneously executing a left outward block and a right reverse punch.","Slide your right foot into a right cat stance facing 12 o'clock while covering your left hand (on hip, palm up) with a right vertical fist. Step out into a right neutral bow facing 3 o'clock while simultaneously executing a right outward block and a left reverse punch.","Slide your left foot into a left cat stance facing 12 o'clock. Have your hands at your right hip, left over the right. Step toward 5 o'clock with your left foot, pivoting into a left wide kneel facing 6 o'clock as you simultaneously execute a left upward block and a right middle knuckle with a vertical downward snap.","V-step your right foot to 12 o'clock into a right wide kneel while simultaneously executing a right upward block and a left verticle raking middle knuckle with a vertical downward snap.","Slide your left foot back into a left cat stance facing 12 o'clock and have your hands at your right hip, right hand over left. Step your left foot to 4:30 into a left neutral bow while executing a left downward block.","Step through to 4:30 into a right neutral bow while executing a right palm heel strike while your left hand checks your mid-section.","V-step your right foot to 7:30 into a right neutral bow while executing a right downward block.","Step to 7:30, into a left neutral bow while executing a left palm heel strike while your right hand checks your mid-section.","Slide your right foot back into a cat stance and turn clockwise to 1:30 while executing a left inward block with the right hand cocking palm up at the waist.","Step to 1:30 into a right neutral bow while executing a right extended outward block with the left hand cocked palm up in a half-fist at your rib cage.","Shift into a right forward bow while executing a left half-fist at throat level.","Slide your left foot forward into a cat stance and turn counterclockwise to 10:30 while executing a right inward block with the left hand cocking itself palm up at your waist.","Step to 10:3 into a left neutral bow while executing a left extended outward block with your right hand cocked palm up in a half-fist at your rib cage.","Shift into a left forward bow while executing a right half-fist at throat level.","Shift your foot so you are in a meditative horse stance facing 12 o'clock."]}