{"steps":[{"description":"Set 1: Destructive Twins (Front- Two-Hand Choke)","steps":["Step your right foot forward into a right neutral bow as you execute a 'U' punch towards 12 o'clock. [Your left hand should be striking at your attacker's face and your right hand striking at the groin.]","Shift your right foot towards 1:00 as your execute a left outward block and chamber your right hand.","Execute a left hand spear towards your attacker's eyes.","Execute a right reverse punch as you shift into a horse stance facing 10:30.","Pull your right foot to your left in a cat stance facing 12 o'clock as you execute two thumb pokes to their eyes as in the beginning of Thrusting Wedge. (Essentially, you are cocking your hands in preparation of Crashing Wings."]},{"description":"Set 2: Crashing Wings (Rear Bear Hug; Arms Free)","steps":["Step your right foot to 3 o'clock into a horse stance as you send two outward overhead elbows down into your attacker's elbows. (These strikes will be close to your body.)","Pull your left foot to your right into a transitional cat stance facing 12 o'clock. Step your left foot towards 7:30 behind your attacker using your left knee to buckle their right.","Shift into a left forward bow as you execute a left outward elbow and follow with a right hammerfist that comes over and down onto their groin."]},{"description":"Set 3: Twirling Wings (Right Flank)","steps":["Place your hands at your left hip, left fist palm up and right fist on top in vertical fashion. Cover with your right foot by moving it to 4 o'clock.","Turns towards 3 o'clock into a right forward bow as you execute a right outward block and a left inward elbow. (The left fist should touch the right elbow.)","Step your left foot to 3 o'clock into a left forward bow as you execute a right hand rake across your attacker's eyes (moving from right to left) and execute a left back knuckle strike to your attacker's ribs (also moving from right to left). Stop this motion at your left hip; left palm up, right on top. Essentially this is to cock for the next move."]},{"description":"Set 4: Circling Wing (Two-Hand Rear Shoulder Grab)","steps":["Turn towards 9:00 in a right forward bow as you execute a right outward overhead elbow and a left closed two-finger spear to their eyes.","Execute a right upward elbow strike as you shift into a right neutral bow.","Pivot into a right reverse bow as you execute a right back hammerfist to their groin."]},{"description":"Set 5: Crossing Talon [Fulcrum version] (Cross Right Wrist Grab)","steps":["With an attacker gravving your right wrist; use your left hand to pin theirs.","Step towards 1:30 with your left foot into a front twist stance. Unwind as you use the pressure of your left elbow against their right elbow joint to push them over.","Execute a left outward elbow to their temple as your right hand pulls them into the strike.","Reach down and claw their face; as you pull up, loop your arm clockwise so you execute a left inward overhead elbow down onto their back."]},{"description":"Set 6: Scraping Hoof (Full Nelson)","steps":["Pull your feet to about half-a-shoulder width apart as you push down with your arms and send your head back to break their attempted full nelson.","Execute a right rear kick into their left knee.","Execute a right knife-edge kick to their right knee.","Scrape down their shin and stomp on their right foot."]},{"description":"Set 7: Fatal Cross (Two-Hand Push)","steps":["Pull your right foot to a cat stance as you execute two downward crane parries to the inside of your attacker's wrists.","Reverse that motion. AS you step your right foot to 10:30 into a right neutral bow and execute two middle knuckle strikes, palm up, to your attacker's solar plexus. (You will also lead in with your head for a possible front head butt.","Loop your hands in and them strike out with two scissoring backfists to your attacker's face.","Pull back and rebound as you execute two scissoring one-finger pokes to your attacker's eyes."]},{"description":"Set 8: Grip of Death (Side Headlock)","steps":["Step forward with your left foot towards 10:30 and simultaneously execute a right hammerfist to your attacker's kidneys and a left hammerfist to your attacker's groin.","Reach over and grab your attacker's face (nose, mouth, or hair) with your right hand.","Pull back on your attacker's face and execute a left palm strike to their face as you pivot into a right forward bow facing 4:30."]},{"description":"Set 9: Locked Wing (Hammer Lock)","steps":["Move your right arm around behind your back as if you have been put in a hammerlock.","Step to 4:30 with your left foot into a rear crossover as you execute a left outward elbow strike to your attacker's head.","Unwind so you are facing your attacker at 7:30 as you claw your attacker's face and loop your left arm under their right arm with a punch.","Step back with your right foot towards 4:30 into a left neutral bow facing 10:30 as you break your attacker's elbow.","Execute a right knee strike to your attacker's midsection as you execute a right inward overhead chop down on to their neck.","Land in a right neutral bow facing 10:30 as you push your attacker away.","As you step forward with your left foot to 10:30 into a left neutral bow, your arms go back as if an attacker has grabbed them."]},{"description":"Set 10: Crossed Twigs (Rear Wrist Grab)","steps":["Pull your hands forward as your left foot settles and regrab your attacker's wrists.","Pivot into a right forward bow facing 4:30 as you execute a right outward elbow strike to your attacker's temple.","Pull on your attacker's right arm with your right to double them over. Continue the counterclockwise circle.","Shift back into a right neutral bow facing 4:30 as you execute a right inward overhead elbow strike on your attacker's spine.","Shift and execute a left knee strike to their midsection with double palm strikes to your attacker's kidneys; land back in a horse stance."]},{"description":"Set 11: Wings of Silk (Attempted Bear Hug)","steps":["An attacker grabs your arms behind you.","Bring your right foot up into your attacker's groin as you push down with your left hand.","Turn and step counterclockwise (to 10:30) with your right foot in a short step.","Complete the twirl by circling counterclockwise still with your left foot. As you land in a horse stance facing 1:30, execute a right vertical punch to your attacker's elbow."]},{"description":"Set 12: Conquering Shield (Left Stiff-Arm Lapel Grab)","steps":["An attacker from 1:30 grabs your lapel with their left arm.","Simultaneously pin your attacker's left arm with your left hand as you execute a right vertical forearm strike to your attacker's left elbow to break and execute a right front snap kick to the inside of your attacker's right leg.","As you land, plant your right foot to 1:30 into a right neutral bow as you have your right arm glance up from its forearm strike and then strike down with a right outward overhead elbow to your attacker's left forearm.","Execute a right upward elbow strike to your attacker's chin.","Follow-up with a right overhead claw to your attacker's face."]},{"description":"Set 13: Striking Serpent's Head (Front Tackle)","steps":["An attacker grabs you from 1:30.","Step back with your right foot to 7:30 as you execute a left inverted back knuckle strike to their head and pull back on their hair, exposing their throat.","Execute a right half-fist to your attacker's throat.","Step your right foot to your left, facing 12 o'clock in an attention stance."]},{"description":"Closing:","steps":["Formal Salutation"]}]}