{"description":"This set is one of the most difficult sets I have had the pleasure of writing out, and I am sure many others feel the same as there is really no other references for this set. I apologize if this set is confusing to read; it really is because its difficult to differentiate what side you are striking with and the motions of staff techniques are different and difficult to apply to terminology used with hand and foot techniques. Often people train with two kerchiefs, one on each end of the staff, and of different color.","steps":[{"description":"Salutation:","steps":["Raise the staff to shoulder height, kneel and place the staff on the ground.","Return to an attention stance.","Do the full Kenpo salutation, catching the staff with your left big toe on the second beat, and raising it up on the right instep on the fourth beat. Kick flip it up so it lands on top of your forearms as you go through the salutation.","Return to an attention stance, with the staff held at waist level."]},{"description":"Technique 1: (Front: either a grab of your staff or a staff attack)","steps":["From your attention stance, block horizontally high.","Block horizontally low.","Block vertically to the left (right hand high).","Block vertically to the right (left hand high)."]},{"description":"Technique 2: (Front: Punch, or as an extension of Technique #1)","steps":["Step back with your right foot into a left neutral bow as you swing the staff over and under on the right side.","As you move through back to an attention stance, twirl the staff through a vertical position (right hand high), and step back with the left foot into a right neutral bow, swing the staff over and under on the left side."]},{"description":"Technique 3: (Against a Poking Staff)","steps":["Bring the left foot up to the right as you twirl the staff (left hand down to the left first) to block to the poking staff through to a vertical"]},{"description":"position (left hand high).","steps":["Without hesitation, step your right foot to 9 o'clock into a right front crossover as you twirl the staff horizontally at shoulder height to strike the right side of your attacker's neck with your right hand forward and your left hand in your right armpit.","Unwind counterclockwise as you step your right foot to 4:30 into a left neutral bow, twirling into a horizontal strike to the left side of your attacker's neck with your right hand in your left armpit.","Bring the right foot up to the left as you double twirl (left hand down to the right first) to block the poking staff through to a vertical position (right hand high).","Without hesitation, step your left foot to 3 o'clock into a left front crossover as you twirl the staff horizontally at shoulder height to strike the left side of your attacker's neck with your left hand forward and your right hand in your left armpit.","Unwind clockwise as you step with your left foot to 7:30 into a right neutral bow, twirling into a horizontal strike to the right side of your attacker's neck with your left hand in your right armpit."]},{"description":"Technique 4: (Against a poking staff, a rear bear hug, or to clear a circle of attackers)","steps":["Bring the left foot up to the right as you double twirl (right hand down to the left first) the staff through to a vertical position on your left side (left hand high), and without hesitation, step your right foot back to 4:30 into a left reverse bow as you twirl the staff into an overhead block (with the fingers back).","Shift into a left forward bow as you put the staff horizontally behind your neck, and then drop into a left wide kneel as you swing the staff counter clockwise in the right hand through three revolutions (with the third circle being low) to clear away attackers. During the third swing, swing the right foot counterclockwise in a full circle to 4:30 into a left neutral bow facing 12:00. The staff is on your right, with your left hand high.","Bring the right foot up to the left as you twirl (left hand down to the right first) the staff through to a vertical position on your right side (right hand high), and without pause step your left foot back to 7:30 into a right reverse bow as you twirl the staff into an overhead block (with the fingers back).","Shift into a right forward bow as you put the staff horizontally behind your neck, and then drop into a right wide kneel as you swing the staff clockwise in the left hand through three revolutions (with the third being low). During the third swing, swing the left foot clockwise in a full circle to 7:30 into a right neutral bow to 12:00. The staff is on your left with your right hand high."]},{"description":"Technique 5: (Side Staff Swing)","steps":["As you step with the left to 12 o'clock into an attention stance, twirl (right hand down to the left side first) the staff to your left side (with the right hand high).","Execute a right round to your attacker's mid-section and plant to 12 o'clock into a right neutral bow.","Execute a left descending strike, followed by a right upward underhand strike.","As you step your left foot to 1:30 into a left rear crossover, slide the staff behind your head and poke into your attacker's throat and then bring the stick overhead in front of your chest.","Pivot clockwise, and shift your right foot to 6 o'clock into a right neutral bow, twirl (left hand down to the right side first) the staff to your right side (with the left hand high).","Execute a left round kick to your attacker's midsection and plant to 6 o'clock into a left forward bow.","Execute a right descending strike, followed by a left upward underhand strike.","As you step your right foot to 5:30 into a right rear crossover, slide the staff behind your head to poke into your attacker's throat and then bring the stick overhead in front of your chest."]},{"description":"Technique 6: (Front Kick)","steps":["Pivot clockwise into a left forward bow facing 12 o'clock as you twirl your right hand down to your left and then to your right, ending with the staff horizontal at waist level.","Swing your left hand low; as the right hand swings low, step your right foot to 12 o'clock.","Pivot counterclockwise 180 degrees into a left neutral bow facing 6 o'clock as your left hand stabs or strikes to the rear on your left side.","Bring your right foot up to your left foot as you twirl your right hand down to your left. As you twirl to the right, step your left foot to 12 o'clock into a right neutral bow facing 6 o'clock ending with the staff horizontal (at waist level).","As your right hand swings low, step your left foot to 6 o'clock as your left hand swings low.","Pivot clockwise into a right neutral bow facing 12 o'clock as your right hand stabs or strikes to the rear on your right side."]},{"description":"Technique 7: (Punch)","steps":["Pivot counterclockwise, as you execute a right tornado kick (right side being the inward crescent kick) to 12 o'clock. Land and execute a second set of the right tornado kick. Land in a right front crossover. Note: Tornado kick for those not used to the term: from a right neutral bow, pivot counterclockwise as you execute a left outward motion followed by a right inward crescent kick; the outward motion being a possible kick and a feint.","Twist counterclockwise in place to face 6 o'clock, as you execute a left tornado kick (left being the left inward crescent kick) to 6 o'clock. Land and execute a second set of the left tornado kick to 6 o'clock. Land in a left front crossover."]},{"description":"Technique 8: (Against a Kick or a Punch)","steps":["Step your right foot back to 12 o'clock into a left neutral bow facing 6 o'clock as you poke to 6 o'clock.","Execute a right front kick to 6 o'clock with a rear poke to 12 o'clock, on your right side.","Plant back to 12 o'clock into a left neutral bow, and then strike over and under on your right side.","Shift your right foot slightly to 3 o'clock as you pivot clockwise into a right neutral bow facing 12 o'clock with a high right block. Poke to 12 o'clock.","Execute a left front kick to 12 o'clock with a rear poke to 6 o'clock on your left side.","Plant back to 6 o'clock into a right neutral bow, and strike over and under on your left side."]},{"description":"Technique 9: (Punch)","steps":["As the left foot circles to 9 o'clock around your attacker's leg, into a horse stance facing 12 o'clock, execute a left inward strike to take your attacker down.","Execute a right horizontal strike to your attacker as he falls, and then a left horizontal strike Step your right foot to 6 o'clock  into a left neutral bow to 12 o'clock as you execute a right downward strike followed by a left poke.","As the right foot circles to 3 o'clock around your attacker's leg, into a horse stance facing 12:00, execute a right inward strike to take"]},{"description":"your attacker down.","steps":["Do a left horizontal strike to your attacker as he falls, and then a right horizontal strike. Step your left foot to 6 o'clock, into a right neutral bow facing 12 o'clock, and do a left downward strike followed by a right poke."]},{"description":"Technique 10: (Overhead Club from the Right Side)","steps":["Pivot clockwise into a right front twist stance to 3 o'clock as you execute left, right, and left overhead downward blocks on your right"]},{"description":"side. (On the second swing, twirl on your right. On the third strike, execute a double stomp.)","steps":["Pivot counterclockwise into a left front twist stance to 9 o'clock as you execute a right, left, and right overhead downward blocks on"]},{"description":"your left side. (On the second swing, twirl on your right. On the third strike, execute a double stomp.)","steps":["Pivot back into a horse stance facing 12 o'clock.","Step up to an attention stance."]},{"description":"Finish:","steps":["Drop the weapon into your arms, do the basic Kenpo salutation, flip the weapon into the air and grab it in both hands, and then twirl the staff to your right side."]}]}