{"description":"This set is based on stances, so they are very important, but the hand positions are also extremely important. They remain open through the technique unless otherwise noted. Also, face 12 o'clock throughout the set unless noted.","steps":["Step your right foot to 12 o'clock into a right forward bow; your hands will be guarding, right upward block and left palm strike at medium height.","Shift into a right neutral bow, open hands guarding.","Pull your right foot to a cat stance; your hands guarding, the right in a push-down block to protect the groin and the left checking by your face.","Lift your right leg into a right one-legged stance, your hands will shift, the right guarding underneath your thigh to protect the groin and your left as an upward block.","Step your right foot behind your left into a twist stance and bring your hands to cross in front you at the wrists, fingers pointing out.","Unwind into a left neutral bow, open hands guarding.","Shift into a left wide-kneel stance; hands guarding, the left high and the right low to protect near the groin.","Shift into a left close-kneel stance; bring your hands to cross in front of you at the wrists, fingers pointing out.","Shift back into a left neutral bow, open hands guarding..","Shift into a left reverse bow, the left hand circling to protect the groin from the rear while your right hand shifts into an upward block.","Step your left foot to 4:30 into a front crossover going backwards as you execute a left overhead hand claw [that circles and strikes]. Your right hand simply should drop into a check.","Unwind and cover so you are in a right neutral bow facing 12 o'clock, open hands guarding.","Step your left foot to 12 o'clock into a left forward bow, your hands guarding; the left as an upward block and the right as a palm heel strike to medium height.","Shift into a left neutral bow, open hands guarding.","Pull your left foot to a cat stance; your hands guarding, the left in a pushdown block to protect the groin and the right checking by your face.","Lift your left leg into a left one-legged stance, your hands will shift, the left now guarding underneath your thigh to protect the groin and your right as an upward block.","Step your left foot behind your right into a twist stance and bring your hands to cross in front you at the wrists, fingers pointing out.","Unwind into a right neutral bow, open hands guarding.","Shift into a right wide-kneel stance; hands guarding, the right high and the left low to protect near the groin.","Shift into a right close-kneel stance; bring your hands to cross in front of you at the wrists, fingers pointing out.","Shift back into a right neutral bow, open hands guarding..","Shift into a right reverse bow, the right hand circling to protect the groin from the rear while your left hand shifts into an upward block.","Step your right foot to 7:30 into a front crossover going backwards as you execute a right overhead hand claw [that circles and strikes]. Your left hand simply should drop into a check.","Unwind and cover so you are in a left neutral bow facing 12 o'clock, open hands guarding.","Hop forward into a diamond stance facing 12 o'clock, smashing your hands down as if to hit an attacker.","Shift into a concave stance. Pull up on your imaginary attacker's neck.","Shift into a closed kneel stance facing 3 o'clock, driving your left knee into your attacker's back as you execute a palm strike to your attacker's head.","Shift into a closed kneel stance facing 9 o'clock, driving your right knee into your attacker's back as you execute a palm strike to your attacker's head.","Stand and execute a scooping right retarded ball kick to your attacker's head. Land in a front crossover, [moving towards 9 o'clock] and execute a right back hammerfist. Step out to 9 o'clock into a horse stance.","Execute a scooping left retarded ball kick to your attacker's head. Land in a front crossover, [moving towards 3 o'clock] and execute a left back hammerfist. Step out to 3 o'clock into a horse stance.","Execute a right hand closed two-finger spear (palm up) to your attacker's left eye. Rake it to the left using only your wrist. Rotate your wrist so as you are now raking back to the right, with your palm down.","Execute a left hand closed two-finger spear (palm up) to your attacker's right eye. Rake it to the right using only your wrist. Rotate your wrist so as you are now raking back to the left, with your palm down.","Step to 7:30 into a left one-legged stance, your left hand guarding your head and your right hand guarding the groin from behind.","Step to 4:30 into a right one-legged stance, your right hand guarding your head and your left hand guarding the groin from behind.","Drop your left foot and settle into a horse stance."]}