{"description":"There are 22 stances in this set. This set is showing transition between stances. Hidden within this set are a number of foot maneuvers that, obviously, you need in order to move from one stance to another. This set teaches flow and smooth transitions from one stance to another. You will recognize the stance switches from both techniques and forms. This is often taught with your hands on your hips.","steps":["Attention stance","Step your left leg out to 9 o'clock into a horse stance.","Step your left leg to 6 o'clock so you are in a right neutral bow facing 12 o'clock.","Slide your right leg back into right cat stance.","Step your right leg to 3 o'clock so you are in a horse stance facing 12 o'clock.","Step your right leg back to 6 o'clock into a left neutral bow facing 12 o'clock.","Slide your left leg back into left cat stance facing 12 o'clock.","Step your left leg back to 6 o'clock into a right twist stance.","Unwind so you are in a right neutral bow facing 12 o'clock.","Step your right leg back to 6 o'clock into a left twist stance facing 12 o'clock.","Unwind so you are in a left neutral bow facing 12 o'clock.","Pivot counterclockwise into a left reverse bow facing 12 o'clock.","Pivot clockwise into a left forward bow facing 12 o'clock.","Execute a front to back switch.","Pivot clockwise into a right reverse bow facing 12 o'clock.","Pivot counterclockwise into a right forward bow facing 12 o'clock.","Pivot in-place into a right rotating twist stance facing 12 o'clock.","Unwind into a right neutral bow facing 12 o'clock.","Step your left foot to 12 o'clock into a left neutral bow facing 12 o'clock.","Pivot in place into a left rotating twist stance facing 12 o'clock.","Unwind into a side (fighting) horse stance facing 12 o'clock.","Pivot in place into a left rotating twist stance facing 12 o'clock.","Unwind into a left neutral bow facing 12 o'clock.","Step your rightt leg up into a horse stance.","Pull your left to your right into an attention stance.","Bow."]}