{"description":"The key concept in this set is Point of Origin. There is no winding up between moves. Unless stated, however, keep one hand chambered while the other is in action.","steps":["Execute a right upward elbow to 12 o'clock. Execute a right downward elbow (reverse motion). Execute a right inward elbow to 12 o'clock. Execute a right outward elbow to 12 o'clock.","Execute a left upward elbow to 12 o'clock. Execute a left downward elbow. Execute a left inward elbow to 12 o'clock. Execute a left outward elbow to 12 o'clock.","Step to 12 o'clock with your right foot into a right neutral bow facing 12 o'clock as you execute a right inward diagonal downward elbow (palm down).","Step your left foot to 12 o'clock into a left neutral bow facing 12 o'clock as you execute a left inward diagonal downward elbow (palm down).","Step your left foot back to 6 o'clock into a right neutral bow facing 12 o'clock as your left cocks at your hip while you execute a right inward overhead elbow. Pivot into a right forward bow as you execute a left upward elbow to stomach level. Pivot back into a right neutral bow as you execute a right downward diagonal forearm smash.","Step your right foot back to 6 o'clock into a left neutral bow facing 12 o'clock as your right hand cocks at the hip while you execute a left inward overhead elbow. Pivot into a left forward bow as you execute a right upward elbow to stomach level. Pivot back into a left neutral bow facing 12 o'clock as you execute a left downward diagonal forearm smash.","Step your left foot back to a training horse stance as both of your arms execute twin back elbows.","Execute a right inward elbow that figure 8s to a right outward vertical forearm strike.","Execute a left inward elbow that figure 8s to a left outward vertical forearm strike.","With hands cocking to the right, execute a left outward elbow and a right inward elbow.","Passing the hands to the left, cock hands to the left, execute a right outward elbow and a left inward elbow.","Cock your left hand at the hip as you execute a right inward vertical forearm strike to solar plexus level.","Cock your right hand at the hip as you execute a left inward vertical forearm strike to solar plexus level.","Execute a right vertical 2 finger eye poke followed by a right upward flapping elbow followed by a right inward vertical elbow down on sternum level.","Execute a left vertical 2 finger eye poke followed by a left upward flapping elbow followed by a left inward vertical elbow down on sternum level.","Bring your left foot to your right as you execute a right and left punch forward. Turn them into twin chopping hammerfists to an imaginary attacker's kidneys. Bring right hand over left and wipe off on hips as you straighten.","Drop into a meditative horse stance.","Attention Stance.","Bow"]}