{"description":"The key point to this set is Point of Origin. Unless stated, however, the other hand will chamber when the other is in action.","steps":[{"description":"Striking to the front:","steps":["Execute a right thrust punch to face level. Execute a right vertical back knuckle to face level.","Execute a left thrust punch to face level. Execute a left vertical back knuckle to face level.","Execute a right thrust punch to face level. Execute a right inverted hammerfist to the groin level.","Execute a left thrust punch to face level. Execute a left inverted hammerfist to the groin level.","Execute a right thrust punch to face level. Execute a right backfist to the temple.","Execute a left thrust punch to face level. Execute a left backfist to the temple.","Execute a right thrust punch to face level. Execute a right inward hammerfist to the ribs.","Execute a left thrust punch to face level. Execute a left inward hammerfist to the ribs."]},{"description":"Striking to the side:","steps":["Execute a right vertical thrust punch to 3 o'clock to face level. Execute a right vertical back knuckle strike to face level.","Execute a left vertical thrust punch to 9 o'clock to face level. Execute a left vertical back knuckle strike to face level.","Execute a right vertical thrust punch to 3 o'clock to face level. Execute a right inverted hammerfist to the groin.","Execute a left vertical thrust punch to 9 o'clock to face level. Execute a left inverted hammerfist to the groin.","Execute a right vertical thrust punch to 3 o'clock to face level. Execute a right backfist to the temple.","Execute a left vertical thrust punch to 9 o'clock to face level. Execute a left backfist to the temple.","Execute a right vertical thrust punch to 3 o'clock to face level. Execute a right inward hammerfist to the ribs.","Execute a left vertical thrust punch to 9 o'clock to face level. Execute a left inward hammerfist to the ribs."]},{"description":"Double strikes to the front:","steps":["Execute a right and a left thrust punch to 12 o'clock to face level. Simultaneously execute a right and a left back knuckle strike to face level.","Execute a right and a left thrust punch to face level. Execute a right and a left inverted hammerfist to groin level.","Execute a right and a left thrust punch to face level. Execute a right and a left backfist to the temple.","Execute a right and a left thrust punch to face level. Execute a right and a left inward hammerfist to the ribs."]},{"description":"Simultaneous strikes to the sides:","steps":["Simultaneously execute a right vertical thrust punch to 3 o'clock to face level as you execute a left vertical punch to 9 o'clock to face level. Simultaneously execute a right back knuckle strike to face level as you execute a left back knuckle strike to face level.","Simultaneously execute a right vertical thrust punch to 3 o'clock to face level as you execute a left vertical punch to 9 o'clock to face level. Simultaneously execute a right inverted hammerfist to the groin as you execute a left inverted hammerfist to the groin.","Simultaneously execute a right vertical thrust punch to 3 o'clock to face level as you execute a left vertical punch to 9 o'clock to face level. Simultaneously execute a right backfist to the temple as you execute a left backfist to the temple.","Simultaneously execute a right vertical thrust punch to 3 o'clock to face level as you execute a left vertical punch to 9 o'clock to face level. Simultaneously execute a right inward hammerfist to the ribs as you execute a left inward hammerfist to the ribs."]},{"description":"Double strikes to the front:","steps":["Slide your left foot to your right into an attention stance with both of your knees slightly bent.","Execute a right and a left thrust punch to face level.","Execute a right and a left back knuckle to face level.","Execute a right and a left inverted hammerfist to the groin.","Execute a right and a left backfist to the temple.","Execute a right and a left inward hammerfist to the ribs."]},{"description":"Attention stance.","steps":[]}]}