{
	"steps": [{
		"s2": "With feet together, form a triangle with both hands, so index fingers and thumbs touch. (1).",
		"s1": "With feet together, form a triangle with both hands, so index fingers and thumbs touch. (1-3)",
		"description": "1"
	},
	{
		"s2": "Step your right foot to 3 o'clock into a horse stance as you execute a right backfist to the temple. The left hand cocks back to the hip. (2-5).",
		"s1": "Step your left foot to 4:30 into a right neutral bow as you do a right outward block to your attacker's backfist (2-2). Execute a left reverse punch to the head. (4-7)",
		"description": "2"
	},
	{
		"s2": "Step your left foot to 10:30, and pivot on the right foot into a right neutral bow facing 7:30, as you execute a right (upward and outward) chopping block (against your attacker's punch (1-2). Immediately bring your right down into a chop to Opponent #1's neck. (6-9).",
		"s1": "Step your right foot into a right front crossover to 7:30 as you execute a right outward parry to your attacker's chop (2-3). Cock your left fist at your left hip. Your right heel should be almost touching Opponent #2's right foot. Take an additional left step towards 9:00, cock your right fist to your left ear. Pivot both feet into a horse stance facing 12 o'clock as you do a right backfist or forearm strike to the kidney. (8-12).",
		"description": "3"
	},
	{
		"s2": "Step your left to to 3 o'clock, and pivot, so you are in a right neutral bow facing 9 o'clock, as you execute an outward chopping block to your attacker's backfist (1-3). Respond with a left reverse punch, as you harden and extend the right forward bow. (10-14).",
		"s1": "Pull your right foot back into a cat as you do a left outward block from under his arm (punch, 2-4) followed by a right front snap kick to the stomach. (13-15).",
		"description": "4"
	},
	{
		"s2": "Shift back into a right reverse bow as you do a right downward block (front snap, 1-4), with your left fist cocked overhead. (15-17).",
		"s1": "Pivot on your left foot (counterclockwise) and plant your right foot to 7:30 into a bow, as you bring your hands to your left hip in a cup & saucer. (16-19).",
		"description": "5"
	},
	{
		"s2": "Execute a left front crossover to 9 o'clock as you step your right foot to 9 o'clock into a right neutral bow, slightly in front of him, and do a right back knuckle to the temple (left hand cocked at the hip). (18-21).",
		"s1": "Step your left foot to 7:30 into a left rear crossover as you do a left outward block (back-knuckle, 2-6). Immediately do a left knife-edge kick to your attacker's stomach. Land to 12:00 in a horse stance facing 1:30 as you cock your left hand (spear hand with the palm out) overhead. (20-23)",
		"description": "6"
	},
	{
		"s2": "Step your left foot slightly to 6 o'clock as you execute a right downward block to your attacker's kick (1-6). Step your left foot to 9 o'clock into a horse stance between Opponent #1's legs as you do a left uppercut to the stomach and a right reverse punch to the chest. (22-25).",
		"s1": "Pivot low and to the left into a closed kneeling stance as you do a right scooping block, or wing block against your attacker's left uppercut (2-7). Pivot back into horse as you do a left chop to the temple. (24-28).",
		"description": "7"
	},
	{
		"s2": "Execute a right rising block to stop your attacker's chop (1-7), circle the arm behind your shoulder, and do a right hammerfist to the ribs as you shift into a bow stance. (26-30).",
		"s1": "Step your right foot back to 9 o'clock, pull your left foot into a left cat stance as you execute a left inward forearm block (hammerfist, 2-8). Step your left foot to 3:00 into a left bow, just inside Opponent #2's left leg, as you execute a two-finger spear to Opponent #2's eye. (29-31).",
		"description": "8"
	},
	{
		"s2": ".Shift back into a horse stance, as your right hand grabs his left arm (dart, 1-7). Follow with a left half-fist to the throat. (31-32)",
		"s1": "Step slightly to 3 o'clock with your left foot into a horse stance, deeper between his legs, as your right hand reaches up to grab your opponent's arm (half-fist, 2-9). Do a left elbow to the ribs as you pull your right hand back to the hip. (32-34).",
		"description": "9"
	},
	{
		"s2": "Step your right foot to 9 o'clock as you execute a right elbow strike to his forearm (elbow-9), as you pull your left foot back to 3 o'clock into a horse stance. Shift immediately into a bow stance, as you do a back knuckle to the temple. (33-36).",
		"s1": "Drop lower into the horse stance as your right hand (palm up) pushes his right hand up (back-knuckle, 2-10). Cock your left hand (palm open and upward) across your chest, and follow with a left outward handsword to the ribs (palm down). (35-38).",
		"description": "10"
	},
	{
		"s2": ".Step your left leg to back to 1:30 into a horse stance as you execute a right inward block (chop, 1-10). Shift into a forward bow stance as you do a right horizontal elbow strike to the upper ribs. (37-40).",
		"s1": "Step slightly to 9 o'clock with your right, pull your left foot back into a right cat stance as you do a left downward back knuckle to the forearm (elbow, 2-11). Step your left foot to 1:30 into a left neutral bow behind his right foot as you do a left top knuckle to the temple. (39-42).",
		"description": "11"
	},
	{
		"s2": "Step your left foot to 6 o'clock while maintaining the bow stance, as you do a left inward parry (top knuckle, 1-11) and cock your right hand back to the hip (hand open and palm up). Execute a right palm heel strike to the ribs as you extend the bow stance. (41-44).",
		"s1": "Shift your left foot slightly back to 9 o'clock as your right hand scoops overhead and diagonally down and outward (palm heel, 2-12) while your left hand cocks back to the hip (palm open and up). Pivot to the right into a horse as you do a left palm strike (fingers pointing left) to the ribs. (43-46).",
		"description": "12"
	},
	{
		"s2": "Step your left foot to 4:30 into a reverse bow (left) to 4:30 into a reverse bow as you do a right downward block (palm strike, 1-12) with the left arm cocked above the head. Follow with a right side kick to 9:00. (45-47).",
		"s1": "Step your left foot back to 9 o'clock into a horse stance, and execute a right outward scooping block coming from underneath his kick (2-13) as you cock your left fist above and slightly to the left of your head. Shift your weight into a final bow stance. (47-48)",
		"description": "13"
	},
	{
		"s1" : "",
		"s2": "Pivot 180 degrees on the left foot (keeping your right foot in the air as you do the turn), and finish in a reverse bow stance facing 12:00, with both hands in spears. The right hand should be overhead, while the left arm is down and parallel to your left leg. (48)",
		"description": "14"
	}]
}