["Standing naturally with opponent pressing gun in your back, pivot clockwise in place (using the  heel of your right toot and the ball of your left foot) facing toward 5:00 o'clock, into a right front  rotating twist stance, as you simultaneously execute a right outward palm up hooking parry (like  carrying a tray).","Step out left into a left neutral bow stance to 5:00 o'clock (to check the outside of opponent's  right knee) as you grab the hand of t.he opponent at the gun with your right hand (palm down) and  execute a left uppercut break to the right elbow of the opponent.","Now shift your left hand over and around to his shoulder, sort of pinning his shoulder as you  step forward, swinging your right leg around and to the inside of opponent's right knee to buckle;  as you rank the gun out of his hand with your right arm.","Immediately execute a right vertical upward strike to the chin of the opponent with the butt of  the gun; and in the same motion follow through and loop over clockwise and come back down and  inward to hit the throat or sternum of the opponent.","Now hop off left to 4:00 o'clock into a left crane stance as you loop the gun over outward and  down (left hand checks) to strike the back of opponent's right elbow (this motion is like the second  half of 'Glancing Lance').","With your right foot still in the air and cocked, execute a right knife edge thrust kick to the back  of opponent's left leg (at the knee) and as you plant your right foot down, the right hand (with the  gun), which is down by our right hip, comes up to rake through the right rib cage of our opponent,  diagonally and up.","Immediately pivot clockwise in place to a right front rotating twist stance as we strike diagonally  down (from left to right) to the back of our opponent's neck with the butt of the gun following through  so that you continue the action into a left heel of palm strike to the back of his head (to act as a  check) then drop the left hand to pin his right shoulder.","As you unpivot counter clockwise execute an upward diagonal strike (left to right) to the face  of the opponent. Follow through with the right foot to 3:00 o'clock.","As you left front Crossover to 3:00 o'clock grab the barrel of the gun, and as you step out right  to 3:00 o'clock take the handle of the gun in your right hand (in the proper firing position) and slide  your left hand down and under the barrel as a check, taking care as to not allow your hand to move  in front of the barrel."]
