["With feet together and opponent attempting to choke or grab you from the front (12 o'clock) step forward with your right foot to 12 o'clock into a right neutral bow as both of your arms thrust forward and to inside of opponent's arms, first to attempt twin pokes to opponent's eyes and continuing as two outward open hand chops to inside of opponent's forearms (your right hand to your opponent's left forearm and your left hand to your opponent's right forearm) and without loss of motion, circle down to opponent's groin, grabbing the testicles with both of your hands. (At this point have your body up close to your opponent's body, acting as a body jam.)","From the testicles execute two outward circular inward hooking back knuckle rakes to both kidneys of opponent (your right back knuckle striking to opponent's left kidney and your left back knuckle striking to opponent's right kidney). This move is executed and timed as you shuffle back (push drag) into a right 45 degree cat stance while having both of your arms travel horizontally and into two vertical outward blocks (left outward and right outward) as a checking measure.","Immediately shuffle in as the fingers of both of your hands flick to opponent's eyes followed by twin thumb scoops to opponent's eyes.","From eyes have both of your hands slap down on opponent's shoulders and travel down arms of opponent, catching and grabbing opponent's arms at the wrists to pull opponent.down.","Immediately recircle the arms up, over, and in so that you strike your opponent's temples (or mastoids) with both of your inverted back knuckles (with your right back knuckle striking to opponent's left temple (or mastoid) and your left back knuckle striking to opponent's right temple (or mastoid).","With both of your elbows raised, drop them down and in toward each other thus striking and sandwiching opponent's jaws (with your right inside elbow striking to opponent's left jaw and your left inside elbow striking to opponent's right jaw).","Grab back of opponent's head with both of your hands and push down as your right knee kicks up and smashes opponent's face.","From your right knee kick have your right foot stomp to opponent's right instep.","Right front crossover and cover out twice toward 6 o'clock."]
