["While you are kneeling with both feet and toes back, and as opponent approaches you from  the front, raise up onto your right foot, and shift your left foot onto the ball of your foot, while  simultaneously executing a right inward block with a left extended outward chopping block to the  right leg of your opponent.","Now shove your right blocking hand over to the left to force his kicking leg to land down to his  right, and immediately execute a forward step drag (step with your right foot and drag with your  left knee). Execute a right upward vertical elbow strike to his groin, followed immediately by a left  lifting underhand (palm up) heel of palm strike to his groin.","Now as you keep your left hand under his testicles drop your right hand down into a right  backknuckle strike to sandwich them.","Immediately raise up your left hand as a check to his midsection as you simultaneously drag  up your left foot to your right foot and grab the back of his left ankle with your right hand.","Now step back with your right foot (in place switch) as you pull his right foot out from under  him while converting your left check into a left inward elbow strike to the solar plexus, to cause  him to land on his back (this is like the left handed version of 'Dance of Death').","With opponent now on his back, slide your right hand over top of his toes and your left hand  over top of his foot to grab his heel. Now step back with your left foot to 6:00 o'clock and pivot  your upper body counter clockwise to flip opponent over onto his stomach while breaking his left  ankle in the process.","At this point you should be in a right reverse bow stance facing 12:00 o'clock. Now drag your  left foot to your right foot (gauging leg) and drive your right foot back toward 11:00 o'clock into  a right reverse bow stance with your right bent leg snapping straight and back against the underside  of his left knee to force it to lock and overextend into a break (your hands assist you by forcing  his foot down at the same time).","Now execute a right outward crane hand clear to clear his left leg out and to your right, as your  left hand goes back and down along beside your left thigh to act as a position check for the next move.","Immediately in place stance switch (right to front and left foot back) as you then execute a left  back thrust kick to the opponent's groin (stomp kick may be used).","With your left kicking leg still in the air, left front crossover and double cover out toward 6:00  o'clock."]
