["With feet together, step to your left with your left foot into a horse. Simultaneously strike to opponent's groin with your right hammer fist as your left hand pins opponent's left arm.","Have your right foot meet your left foot (close cat) and then around and behind opponent's left leg into a right reverse bow. Simultaneously strike opponent's groin with a right heel palm; then grab opponent's groin with a right claw.","Pivot into a neutral bow as your right arm follows the contour of your opponent's body and your right elbow strikes up to his chin.","Complete your pivot into a right forward bow as you deliver a left heel of palm strike to opponent's left rib cage.","Immediately have both of your hands grab back of both knees of your opponent (have your left hand grab back of opponent's left knee and your right hand grab back of opponent's right knee). Immediately lift both of opponent's legs off the ground and force opponent onto his back.","Shift your right hand and have it assist your left hand in grabbing your opponent's right foot (have your left hand, palm down, and on top of opponent's right toes; your right hand should be palm up and grabbing under your opponent's right heel of foot from the inside). Immediately (assuming opponent who was originally back of you as well as yourself were both facing 12 o'clock) twist your opponent's ankle counter clockwise as you shift and circle your right foot clockwise to 12 o'clock thus forcing your opponent to be face down on the ground.","Release your grab and right front crossover stomp to back of opponent's right knee (then slide your right foot off, replanting it to the ground).","Left side kick to back of opponent's neck or head.","Plant your left foot under left armpit of your opponent and execute a right knee drop to left ribs and kidney of opponent.","Bounce up and shift your feet so that your right foot plants forward and to the right of opponent's head as you execute a left knee drop to opponent's neck (to the back of it).","Draw your left foot (while dragging and raking it on opponent's back of head), cock the left foot and immediately execute a left back kick to opponent's head (or left heel stomp, depending upon the distance).","Left front crossover and cover out twice."]
