["Standing naturally with hands down step forward right to 12:00 o'clock to a right neutral bow  stance, as you execute a left outward parry close to your body to catch and deflect the barrel of  the gun (be sure that your body pivots counter clockwise to face square to 9:00 o'clock) as your  right hand simultaneously reaches over (and palm down) to grab the gun at the chamber or the  hammer.","Now that your right hand has control of the gun, execute a left two-finger poke to his eyes,  immediately snap the poke back so that the left hand is down under the gun.","Now use your left hand to assist your right and as you step back to 6:00 o'clock with your right  leg to a left neutral bow stance, twist his wrist and the gun clockwise and back so that the barrel  points toward him.","Now simultaneously as you switch your left neutral bow stance to a toward bow stance, yank  the gun from his grip with your right hand so that the trigger finger of his right hand is forced back  and broken in the process and as you pull the gun back past your right hip simultaneously execute  a right front snap ball kick to the groin of your opponent. As you plant down from the kick (forward  and toward 12:00 o'clock) come up with the butt of the gun in an arc diagonally upward and to  the right to strike the jaw of the opponent (your left hand is checking at this point to his right arm).","Now execute a downward diagonal inward strike to his left cheek bone, followed by a right looping  outward and downward strike to the other side of his head to his jaw and follow through and down  with the gun sort of back toward your right hip (all this is like a figure '8' pattern) as you step back  to a right neutral bow.","Now as you execute a left front crossover grab the barrel of the gun with your left hand, and  switch your right hand so that you have the proper pistol grip. And as you execute a right reverse  step through, drop your left hand down below the gun into a guard position (do not your left hand  exceed the end of the barrel).","You are now clear and aiming the gun at the opponent."]
