["With feet together, step forward and slightly to you left with your right foot (toward eleven o'clock) as opponent steps through with his right foot delivering a right roundhouse club attack.","As you step in, execute a left extended outward block to inside of opponent's right wrist. Simultaneously deliver a right vertical fist to opponent's jaw or face.","Immediately pivot into a right front (forward) bow. Check opponent's right arm with a right parry as your left vertical fist shoots over your right arm striking to opponent's solar plexus or rib cage.","Deliver a right horizontal back knuckle to opponent's right floating ribs as your left hand checks opponent's right arm.","Grab opponent's right wrist with your left hand and snap opponent's right elbow by delivering a right outward strike (moving it back toward you) back of opponent's right elbow while still remaining in a right neutral bow.","Freeze the action of your arms and drop back with your right foot to six o'clock (keeping constant pressure on opponent's right arm).","While still maintaining the grab with your left hand have your right hand convert into a right back knuckle striking down to right ribs of opponent and continuing to circle counter clockwise and converting into a right inward strike to back of right ribs of opponent (at the time of strike opponent should be bent over and leaning forward).","Shift your left foot to four o'clock as you push down on opponent's right armpit with your right hammer fist and pull opponent's right (stiff arm) diagonally and toward you (pulling from eleven o'clock to five o'clock) to dislocate opponent's right shoulder.","Force opponent face down to the ground and immediately go into a left rear crossover (left rear twist) and deliver a right back knuckle down and to back of opponent's left rib cage (at this point you and the opponent are facing six o'clock and you are on the left side of opponent, as opponent is face down).","Have your left foot step out toward six o'clock (into a left neutral bow) and immediately deliver a right knee drop to back of opponent's left elbow (to break).","From your right close kneel, position in your right foot, and while in place, twist clockwise into a right front twist stance. However, upon doing so have the heel of your right foot come down to the right side of opponent's face, stomping down and toward you in order to strike the right side of opponent's face.","Immediately deliver a left knee drop to back of opponent's neck.","Bounce from the left knee drop out and to the side into a right one-legged stance.","Right front crossover and cover out twice."]
