["Starting in a natural stance, step off to 11:00 o'clock, into a left neutral bow stance as you execute  a left inward block to the outside of his left arm.","Switch your block to a check as you step through to 11:00 o'clock with your right foot, execute  a right raking elbow strike to the right ribcage of your opponent, plant your right foot toward 11:00  and then pivot 180 degrees counter clockwise into a left neutral bow stance, facing 6:00 o'clock, as your  left outward elbow strikes solar plexus of your opponent (your right hand is checking his right upper  arm at this point.","Now execute a right inward heel of palm claw to the right side of the opponent's face as you  hop back to 11:00 o'clock landing in a left one-legged stance, immediately execute a right knife  edge thrust to the back of his left knee, plant down immediately, and continue the right claw to  his face on down to a right (palm down and out) outward claw to his groin from the back side. Your  left hand is in a checking position across his back, palm out and fingers pointing to the right.","Now circle your right hand out to the right and over and in to repeat the same claw to the face  that you did earlier, and drop your right hand to his back to become a possible check for his arms,  and immediately without hesitation execute a left front crossover sweep to the back of his right  knee and as you plant, do a left claw to his groin from behind and in between his legs.","Now grab around his right side of face with your left claw as your right hand checks his shoulder,  drop your left foot back to 10:30 as you turn him around slightly counter clockwise and come up  with a right knee to the back of his neck.","As you plant your right foot back (place of origin) rip his face with your left claw and execute  a right rising lift punch to his back of neck.","Replace your left claw to his right side of face and pull him back into a right overhead looping  downward roundhouse punch to his left temple, and immediately with the same energy flow into  a right side kick to any available opening.","Right front crossover and double coverout to 10:30 o'clock."]
