["Standing naturally with your hands up like 'Hey, take it easy', and as opponent steps in right  with his right punch, as you step forward left into a left neutral bow stance, execute a right extended  outward overhead block to his punch as you simultaneously execute a left heel of palm strike to  his sternum.","Now while still in a left neutral bow stance windmill your left hand counter clockwise up into  a claw to his face as you simultaneously execute a right clockwise inward hammerfist strike to his  left floating ribs.","While still in a left neutral bow stance facing 12:00 o'clock windmill your right hand clockwise  up to become an overhead parry as you simultaneously execute a left counter clockwise inward  hammerfist strike to his right floating ribs.","Now check his right arm with your left hand as you step through right into a right neutral bow  stance (against his right knee to act as a check) as you execute a right inward knuckle rake through  the nose and down to his right arm.","While still in a right neutral bow stance, execute a right outward horizontal finger slice, then  double back in and out just like in the form 'Long Form #4.","Turn clockwise in place to a right front rotating twist stance as you execute a left inward knuckle  rake to the bridge of his nose or cheek bone.","Now unpivot back into a right neutral bow stance, as you execute a left outward horizontal slice  with your fingers from inside out.","Now execute a right front crossover sweep to his right ankle as you execute a left inward horizontal  slice across his eyes then follow this immediately by an outward slice while still in place.","Grab the left hand of the opponent at the wrist and step back left to 7:00 o'clock to a right neutral  bow stance as you execute a right heel palm thrusting strike to his left jaw and using the striking  point to fulcrum, rotate your right hand counter clockwise as your fingers windshield-wiper across  his eyes (at this point you are starting to pivot counter clockwise into a right reverse bow stance).","While still maintaining your left grab onto his right wrist pull down as you circle your right crane  hand around and in back of his right side of head to hook his neck, and while keeping your elbow  anchored pull his head down into a right upward vertical heel hook to his face and plant your right  kicking foot down to the point of origin (for stability). Now execute a right front crossover as you  execute a right underhand backknuckle strike to his face.","Unpivot counter clockwise as you execute a left spinning back kick to any available opening.","Left front crossover and double cover to 6:00 o'clock."]
