["With feet together, have your left foot step forward and to your right on a forty-five degree angle (between one and two o'clock, assuming both of you are facing twelve o'clock) into a left neutral bow as your right arm cocks horizontally across your waist.","Pivot clockwise as you circle your right elbow over and down on to right arm of opponent to hurt and pin that arm. Complete the pivot into a right front bow with a left finger jab to opponent's eyes.","Pivot to your left into a horse as you have your right elbow strike up to opponent's chin. Your left hand is in a guard position by your right ribs.","Pivot again to you left into a right reverse bow as you strike with a right hammer fist to opponent's groin with your left hand guarding.","Switch from a right reverse bow to a left forward front twist stance (having your left foot drop back and toward opponent as it crosses over and in front of your right foot) and deliver a right back knuckle strike to opponent's face.","Untwist (clockwise) and grab opponent's right arm with both of your hands (have your left hand grab opponent's left elbow and your right grab opponent's right wrist) as your right foot drops slightly back (toward six o'clock into a wider left neutral bow) jerking and pulling opponent's arm down.","Without any hesitation deliver a right knee kick to opponent's right rib cage while still maintaining right wrist grab.","Plant your right foot back to point of origin and step back (step through) to six o'clock with your left foot as both of your hands whips and pulls opponent's right arm (at the wrist) to the left of your body.","Release your right hand and deliver a right back knuckle to opponent's right temple, followed by a right inward horizontal elbow strike to opponent's left jaw.","Have your right hand re-grab opponent's right wrist (to re-assist your left hand which is still grabbing) and step back (step through) to six o'clock as both of your hands whip opponent's right arm to the right of your body and down, forcing your opponent, face down, to the ground (like leap of death).","Left stomp to back of opponent's left elbow.","Shift and plant your left foot (after the stomp) slightly to your right (adjust your planting left foot to the proper distance needed) and immediately spin clockwise and deliver a right spinning back heel stomp to opponent's head.","Right front crossover and cover out twice."]
