["<li>1.  Standing naturally, have your right foot circle clockwise into a horse stance, planting it in back of an down on your opponent's right leg to buckle it.  As you circle your right leg, circle a right outward overhead elbow strike.  In sync with the planting of your right foot, have your elbow strike down and on top of your opponent's right forearm.  During this action have your left hand check your opponent's right shoulder.","</li><li>2.  This is a sophisticated transitional buckle that first travels downward, before rotating into a reverse bow that trips your opponent.  As you pivot into a right reverse bow, deliver a right thrusting heel palm strike to the right side of your opponent's mandible.  Your left hand is still checking your opponent's right arm.  (This should daze your opponent and begin to turn him counterclockwise.)","</li><li>3.  Have your right foot spring forward toward 10:30 into a right front twist stance.  As you spring forward, deliver a left outward handsword to your opponent's throat.  Your right hand contours down his right arm, acting as a sliding check, until it grabs and controls his right wrist.","</li><li>4.  Have your left foot step out toward 10:30 into a left neutral bow.  As you step out control manipulate your opponent by having your left hand hook around your opponent's neck.  This should further turn his head and body counterclockwise (from your point of view) so that he is face down near your left thigh.  Simultaneous with these actions, have your right hand assist in turning your opponent by applying a hammerlock on his right arm.  (Your opponent is falling toward the ground.)","</li><li>5.  Have your right foot slide clockwise toward 10:30 into a left neutral bow (facing your opponent at 4:30).  Be sure that you are in control maintenance of your opponent.  Without loss of momentum, push-drag reverse toward 10:30.  As you push-drag, yank his right arm toward you to dislocate his shoulder.  Your left hand assists your right hand in the dislocation.","</li><li>6.  Drop into a left close kneel stance, having your right knee smashing and sandwiching your opponent's face and head to the ground.","</li><li>7.  From the point of Contact of your right knee strike, gradually ascend into a left front crossover and cover out twice toward 9:00."]
