["Standing in a left neutral bow, step forward and to your left with your left foot (toward ten o'clock to get out of the line of attack). Simultaneously strike to the outside of opponent's right punch with your left inward block as your right arm hangs naturally to the right of your body.","With your left hand still guarding, strike to opponent's groin with a right upward vertical reverse hand sword while pivoting into a left forward bow.","Immediately step forward and to your left (to eleven o'clock) with your right foot (so as to buckle your opponent's right knee) into a right neutral bow as your right elbow strikes horizontally into opponent's right rib cage. Simultaneously have your left hand grab back of opponent's right knee and pull toward you.","With opponent now on his back (with his head facing between ten and eleven o'clock) have your right back knuckle strike down and out (from left to right) to inside of opponent's left knee to force his leg out, thus giving you a more desirable opening to the groin area. Your left hand should maintain grabbing opponent's right ankle.","Continue the action of the left back knuckle going out and then return with a right inward downward fingertip slice to opponent's groin area, while your left hand still maintains grab on opponent's right ankle.","Slide your left hand grab and shift it from the outside right heel to the top of opponent's toes while your right hand grabs outside of opponent's right heel.","Immediately push down on opponent's toes with your left heel of palm and pull up on opponent's right outside heel with your right hand and twist clockwise with both hands to snap opponent's right ankle. With the snap your opponent will turn from his back onto his stomach.","Release grabbing with both hands and left heel stomp to opponent's lower spine (stepping toward one and two o'clock).","Stand on opponent's spine with your left foot as your right leg closes to your left leg and then plants back and to the right to four o'clock.","Lift your left leg off of opponent's spine and replant it toward eleven o'clock as it pinches opponent's left kidney.","Drop into a left wide kneel as your left hand checks opponent's right shoulder blade and your right hand chops down to opponent's neck.","Immediately raise up and stomp upper spine of opponent with your right heel of foot (heel stomp).","Stand on opponent's upper spine with your right foot and plant your left foot toward eleven o'clock.","Cock your right foot and deliver a right (downward) back heel kick to opponent's head.","Right front crossover and cover out twice."]
