["Standing naturally and with hands at your sides pivot counter clockwise as you slide your left  foot to 2:00 o'clock into a left front rotating twist stance, as your left hand executes a left outward  parry (hooking with your palm up like carrying a tray). Be sure to have your center line move off  to the right of the line of fire.","Immediately switch your left hand to a grab to his hand (at the gun) and simultaneously execute  a right front snap ball kick to his groin with a right two-finger poke to his eyes.","Plant down right, toward 11:00 o'clock (to buckle the inside of the opponent's right knee) as  your right hand grabs his hand (to assist the left hand which is holding the gun) and yanks down  and slightly to your left, to pull him into a right slapping upward elbow strike to his chin.","Remove the gun from his right hand with your right hand while maintaining the grab with your  left, and immediately step back right to 6:00 o'clock and as you step, execute a right downward  outward diagonal strike with the butt of the gun to the right side of his head (your left hand checks  his right arm out to the left).","Now continue the flow of the gun back over forward and down, and as you come up with a right  knee kick to his sternum come down simultaneously with the butt of the gun to the back of his head.  6. With your right knee still at his sternum switch it to a right snapping instep kick to the groin  then with the leg still in the air, execute a right knife edge kick to the inside of his left knee.","With your right knife edge kick still in the air, go into a right front crossover as your right hand  strikes across to the left horizontally to hit the inside of your opponent's right elbow, forcing his  arm clear of your path.","At the very moment you plant into your crossover execute a right downward outward backward  strike with the butt of the gun to the head of the opponent.","Unpivot from the twist counterclockwise and as you execute a left spinning back kick to any  available opening, take the gun by the barrel with your left hand and cross out left toward 6:00  o'clock as you switch the gun to your right hand and step out to 6:00 o'clock with your right foot,  while having the barrel of the gun aiming at the opponent in the proper manner, having slipped  your left hand beside and below in the checking position (taking care so as not to have your hand  go in front of the barrel)."]
