["<li>1.  Your opponent approaches from 7:30, and delivers a right step through punch toward your head.  Hop toward 1:30 onto your right foot into a transitory right one-legged stance, as you immediately counter your opponent's punch with a left thrusting knife-edge kick to the outside of his right knee.  Your hands are positionally checking (to your left) in the Neutral Zone.  (This should stop your opponent's forward momentum, as well as force him to bend forward.)","</li><li>2.  Plant your left foot toward 7:30 (gauging the leg to obtain proper distance)  and immediately spin clock-wise as you deliver a right spinning stiff-leg sweep to the back of your opponent's right knee.  (This should cause his right knee to buckle to the ground).","</li><li>3.  Pivot your upper body clockwise and plant your right foot forward into a right neutral bow (facing 7:30).  Immediately have your left foot step forward (toward 7:30) into a left neutral bow as (1) your right hand gravitationally checks your opponent's right shoulder, (2) your left knee braces against his back, and (3) you deliver a left vertical punch to the right side of your opponent's jaw.  The force of your punch should carry your fist through, and in front of his face.","</li><li>4.  With your left knee checking your opponent's back, reverse the motion of your left hand and execute a left outward claw across the face of your opponent.  During the same flow of motion, deliver a right inward downward diagonal hammerfist strike to the left side of your opponent's jaw.  This strike should conclude with your right forearm dropping, as well as to the back of, your opponent's right shoulder to keep him in check.","</li><li>5.  Have your right foot slide clockwise and back toward 4:30 into a left neutral bow (facing 10:30).  With this action have your right hand (which is still t the left of your opponent's face) grab under your opponent's jaw.  As you pull with your right hand, execute a left heel palm strike to your opponent's right mastoid (as in Leap of Death).  The simultaneous pull and strike is for the purpose of snapping your opponent's neck.","</li><li>6.  Left front crossover, and cover out toward 4:30.","</li><li>7.  With your opponent still on his knees execute a right rear crossover followed by a left (counterclockwise) hooking heel kick to your opponent's face.  (Your opponent should fall to the ground.)","</li><li>8.  From the point of contact of your kick, again execute a left front crossover, and cover out twice in the direction of 4:30."]
