["Standing naturally with hands down and as opponent comes from 3:00 o'clock with a right  overhead club attack, step off right toward 2:00 with your right foot into a right neutral bow stance,  as you execute a left inward parry simultaneously with a right thrusting heel of palm thrust to his jaw.","Maintain your left parry hand as a check against his right upper arm, as you step through forward  with your left foot into a left close kneel stance toward 2:00 o'clock, to check his right knee with  your right knee, as you simultaneously execute a right vertical thrusting elbow to his right floating  ribs (actually your right arm just collapses down from the previous palm heel).","Circle your right hand out and down and execute a heel of palm claw into his groin.","Adjust your left loot slightly (gauging leg) toward 2:00 o'clock and as you slide your right hand  down his leg to grab his ankle, drop your left checking hand down to the back of his right knee,  and in the same motion swing your right fool back clockwise to 2:00 o'clock into a left forward bow  stance, as you yank and pull his right leg out straight and back beside your right hip.","Execute a right front crossover toward 8:00 o'clock into a right front low twist stance as you  drop the knee of opponent down and across your right knee to break it.","Execute a left inward palm slap to the inside of his right thigh to clear his leg off your knee and  immediately come up with a right toward inverted crane strike to his groin, immediately start to  pivot counter clockwise (facing toward 2:00 o'clock) while still looping your right hand up and over,  execute a right snapping upward heel hook strike, and as you plant back down (point of origin)  continue looping your right hand into a back shape of the crane strike to his groin.","Now switch your right hand to a check to his hips (in the center and below his waist), as you  left front crossover toward him, push him forward onto his hands and knees, and as you settle into  a left front twist stance deliver a left forward underhand shape of the crane strike to his groin.","Unpivot clockwise as you come up from your twist stance and you execute a left lifting heel  kick in between his legs to strike any available target (either groin, solar-plexus, or chin depending  on the position that the opponent is in at the time).","9.	With your left foot in the air, left front crossover and cover out twice toward 2:00 o'clock."]
