["Standing naturally, have your left foot step back toward 6 o'clock into a right neutral bow (facing 12 o'clock) as you execute a right inward block to the inside of your opponent's right punching arm.  Have your left hand positionally check in front of your solar plexus.","</li><li>2.  As your opponent delivers a left roundhouse punch, shuffle forward into a right forward bow, while delivering a right extended outward block to the inside of your opponent's left punching arm.  Simultaneous with your shuffle and block, execute a left thrusting vertical punch to your opponent's face.  (This should snap your opponent's head back and keep his depth zone in check.)","</li><li>3.  Immediately pivot counterclockwise) into a right neutral bow, as you execute a right thrusting inward handsword to the left side of your opponent's neck.  Again have your left hand positionally check in front of your solar plexus.  (This should stun your opponent.)","</li><li>4.  Without hesitation execute a left front crossover and while in a left front twist stance have your right hand circle counterclockwise, and diagonally down, to force your opponent's right arm against the right side of his body and him.  Your right elbow should positionally check your opponent's left arm at the same time.  Simultaneous with this action have your left hand circle clockwise and execute a left inward horizontal heel palm strike (finger tips pointing out with your left elbow anchored) to the right side of your opponent's jaw.  (This should daze your opponent.)","</li><li>5.  Have your right foot step out into a right neutral bow (toward 11:00 while facing 12 o'clock) to buckle the inside of your opponent's right knee.  With your left heel palm still braced against your opponent's right jaw have your right arm circle counterclockwise and execute a right inward horizontal elbow strike to the left side of your opponent's jaw.  (This action should sandwich your opponent's jaw and cause him to pass out.)","</li><li>6.  Immediately pivot counterclockwise (inplace) into a right reverse bow to further buckle the inside of your opponent's right leg and expose his groin.  While employing your right reverse bow, execute a right back hammerfist to your opponent's groin.  Your left hand should be checking over your right shoulder.  (Your opponent should bend forward at the waist.)","</li><li>7.  Right front crossover, and cover out toward 7:30.","</li><li>8.  Survey the outcome of your action.","</li><li>9.  Return by executing a left rear crossover followed by a right thrusting back heel kick to your opponent's stomach.  (Your opponent should fall to the ground at this point.)","</li><li>10.  From the point of contact of your right kick, execute a right front crossover, and cover out twice in the direction of 6 o'clock."]
