["<li>1.  Standing naturally, have your right foot step forward into a right neutral bow to the outside of your opponent's right leg.  As you step, have your left hand pin your opponent's right grabbing hand to your chest.  Simultaneous with these action, deliver a right upward elbow strike to your opponent's right shoulder at the head of the humerus.","</li><li>2.  Immediately convert your forward momentum into rotational momentum, as you pivot into a right reverse bow.  This is a strikedown that is counter balanced by having your right leg act as a trip to your opponent's right leg.  (Your opponent should be in pain from the strike and stunned by the impact of the fall.)","</li><li>3.  Your opponent will fall on his back with his head toward 6 o'clock.  As he is falling, continue to control his right wrist with your left hand.  Simultaneously have your right hand circle inside of his right arm (contouring with the back of your hand).  At the moment he makes contact with the ground, pivot into a left reverse bow.  In sync with your pivot have your right hand grab your opponent's right wrist, and twist it clockwise, applying great pressure on his right wrist and shoulder.  Simultaneous with these actions deliver a left underhand heel palm strike to your opponent's right elbow.  (This strike should break his right elbow and limit his retaliatory actions.)","</li><li>4.  Cock your left leg, as you have both of your hands grab your opponent's right arm.  Deliver a left knife-edge kick tot he right side of your opponent's neck.  As you kick, pull on your opponent's arm to cause a possible shoulder dislocation.  The two opposing forces will also enhance your kick to the side of your opponent's neck.","</li><li>5.  Have your left hand circle inside of your opponent's right arm (contouring with the back of your hand).  Plant your left foot toward 5 o'clock and immediately pivot into a left forward bow.  In sync with your pivot have your left hand grab your opponent's right wrist, and twist it counterclockwise, applying great pressure on his right wrist and shoulder.  (Your opponent's elbow at this point should be facing down and toward the ground).","</li><li>6.  While still maintaining your left hand grab, utilize the residual torque of your pivot to deliver a right kick using the right side of your shin (the peroneus longus muscle) to strike the back of your opponent's right elbow (to break it further).","</li><li>7.  From the point of contact of your right shin kick, deliver a right back scooping heel kick to your opponent's right ribcage or right kidney.  (This should snap your opponent's torso up.)","</li><li>8.  With your right foot passing through your opponent's ribs or kidney, and now cocked in the air, execute a right downward looping roundhouse kick to your opponent's solar plexus with the ball of your right foot.  Your left hand his still maintaining the grab of his right wrist.  (This should shock your opponent.)","</li><li>9.  From the point of contact of your right kick, execute a right front crossover sweep of your opponent's right arm, and cover out twice toward 4:30."]
