["With feet together and arms hanging naturally to your side, step back to 6 o'clock with your right foot into a left neutral bow as your right hand does an extended outward chop outside of opponent's right wrist. Simultaneously have the heel of your left palm strike in and against the outside of opponent's left elbow. While in a left neutral bow stance, your right foot should now be positioned to kick.","Deliver a right front snap kick to opponent's groin toward 2 o'clock.","While planting your right foot forward to 1 o'clock (have your right leg buckle and check opponent's right leg) execute a right two-finger horizontal eye poke to opponent's eyes.","Immediately hop onto your left foot to 10 o'clock into a right one legged stance as your right hand circles counter clockwise, hooks and parries in an overhead fashion to again strike outside of opponent's right wrist. Just as you did earlier, simultaneously have the heel of your left palm strike in and against the outside of opponent's left elbow. While now in a right one legged stance, your right foot should be cocked to your left knee in preparation for a kick toward 2 o'clock.","Deliver a right knife-edge kick to outside portion of opponent's right knee to cause opponent's right leg to buckle in toward himself.","Plant your right foot in back of opponent's right leg as you check his right arm with your left arm and again execute a right vertical finger thrust to opponent's eyes.","Have your right arm collapse and execute a right downward elbow strike to opponent's right kidney. Have your left hand circle clockwise and strike with a left inward hooking middle knuckle fist to opponent's left mastoid, making contact a fraction of a second after the elbow makes contact.","Have your right elbow continue the counter clockwise circle and execute a right inward horizontal elbow smash to opponent's right ribs or head, depending upon what is open. Left hand is guarding under the right and checking in the process.","Right front crossover and cover out twice toward 8 o'clock."]
