["Standing in a right neutral bow as first opponent (who is at 12 o'clock) delivers a left punch from the front, step forward and to your right (with your right foot) to 1 o'clock while executing a right inward-left outward block combination outside of opponent's left punch. Without loss of (circular) motion transform your right inward block into a right back knuckle strike to left ribs of first opponent (front opponent).","Slide your left foot counter clockwise to 2 o'clock checking opponent's arm with your left as it simultaneously claws and deliver a right overhead chop to back of opponent's neck.","Immediately cock your right foot to inside of your left knee (right one legged stance) and deliver a right side kick to back of first opponent's left knee. Have both of your hands and arms guarding wherever needed.","With opponent beginning to buckle, plant your right foot into a right neutral bow toward 6 o'clock and execute a two-hand push to first opponent's back and shove first opponent into second opponent toward 6 o'clock.","With second opponent (rear opponent) occupied, shift your right foot to your left into a right front twist stance and deliver a left roundhouse kick to head of second opponent as your left hand cocks horizontally to your right hip.","Plant your left foot forward (into a left neutral bow toward 6 o'clock) while delivering a left horizontal back knuckle strike to head of second opponent.","Right front crossover (into a right front twist stance) guarding and pushing down on second opponent's right arm with your left hand toward 6 o'clock while delivering a right back knuckle strike to head of first opponent toward 12 o'clock.  Immediately pivot counter clockwise with a looping stiff-arm back knuckle strike to head of second opponent still at 6 o'clock.","Follow-up with a left spinning back kick to solar plexus of second opponent at 6 o'clock.","Shoot your left foot to 12 o'clock (toward first opponent) as you deliver a low left snapping ball kick under jaw of first opponent.","</li><li>10. Left front crossover and cover out twice, positioning yourself so that you end up midway between opponent's (covering out toward 3 o'clock)."]
