["With feet together, step back with your right foot (into a left neutral bow) to 6 o'clock as your right hand delivers a right extended outward chop to outside of opponent's right wrist (punching hand of opponent) and immediately turns into a right hooking crane hand (grabbing or hooking opponent's right wrist).  Simultaneously strike to outside of opponent's right elbow with a left inward horizontal heel palm strike (to break opponent's elbow).","Shift (in place) into a left reverse bow continuing your right hand grab (or hook) as well as pressure on opponent's right elbow with your left heel palm and jerk opponent to your right toward 6 o'clock.","Immediately shift into a left forward or neutral bow (depending upon how close your opponent is to you) as your left back knuckle strikes horizontally to opponent's right ribcage with your right hand still maintaining grab (or hook).","Again shift (in place) into a left reverse bow restriking opponent's left elbow with your left heel palm (force is now in a downward motion) while your right hand jerks opponent's arm down toward the ground so as to force your opponent t the ground (face down).","Leap into the air with both feet cocked under you and with both of your hands cocked to your chest (palm up in the begging fashion).","Come down on opponent so that both heels of your feet strike to both of opponent's kidneys (right heel of foot to opponent's right kidney, left heel of foot to opponent's left kidney) and slide off to sides of kidneys.  Simultaneously have the heels of your palms strike to back of opponent's mastoids (right heel of palm to right mastoid and left heel of palm to left mastoid) to force opponent's face to hit and bounce on the ground.","From the reaction of your opponent's face hitting the ground and bouncing back up, slip both of your hands along opponent's face (after heel of palm strikes to opponent's mastoids) and under opponent's chin.","Immediately switch (in place) from a horse stance to a concave stance and pull up and toward you with both of your hands and arms (pulling up on opponent's chin) as you knees brace down and against opponent's back.  Pull and stretch your opponent's neck up and back to its very limit.","Without loss of motion, twist your opponent's head and neck clockwise (pulling up and against you opponent's chin with your right hand and pushing down on the back of your opponent's head with your left hand) to snap opponent's neck.","With your right hand cocked to your right ear (palm out) and your left hand pushing your opponent's head down, immediately follow up with a right inside downward (palm up) chop to bridge of opponent's nose.","Switch (in place) into a right close kneel and drop your left knee to opponent's upper spine (using the opponent's body as a springboard) with a left hand push to back of opponent's head and again force opponent's face to the ground (drop and spring into next move).","After bouncing on opponent's back spring up and leap, turning your body counter clockwise in mid-air and land with your left foot to the right of your opponent's body as a right downward roundhouse kick is delivered to your opponent's head (bend your left knee deeply upon right roundhouse kick delivery).","Right front crossover and cover out twice toward 9 o'clock."]
