["With feet together, step directly forward with your left foot (to twelve o'clock) into a left neutral bow facing straight ahead with your right hand sword cocked to your heart and your right palm up - checking with your left hand on your right shoulder.","Immediately pivot to your right on a forty-five degree angle (facing four o'clock) into a right forward bow, execute a right outward hand sword to throat.","Deliver a left kick to opponent's groin and chicken kick with a right ball kick to inside of opponent's right knee (to buckle). Your right hand in the meantime is held above your head.","As you plant your right foot (right neutral bow) toward four o'clock (assuming both of you were originally facing twelve o'clock) come down with a right chopping punch to rake across bridge of opponent's nose (on his left side) continuing on to a right hammer fist to left collar bone of opponent and down to opponent's right chest.","Immediately have your left foot crossover and back of your right leg (having your left rear crossing leg buckle opponent's left leg). Simultaneously strike outward and up (a modified outward strike) striking to bridge of opponent's nose (his right side) with your right fist continuing the outward and upward motion into a right upward elbow strike under opponent's chin. Both moves or strikes are done without any loss of motion.","With the right elbow now above your head begin to pivot counter clockwise and to your left into a right neutral bow and drop down (diagonally) with your right elbow to opponent's sternum. Complete the in place stance shift (into right neutral bow) and deliver a right downward hammer fist to opponent's groin.","Shift your left foot around and back (counter clockwise to four o'clock) into a left reverse bow to buckle opponent's left leg even further, your left hand hooks in the shape of the crane to the opponent's left shoulder (with your elbow anchoring) and assists in turning him around and keeps him from falling as you turn him around.","Pivot clockwise into a left neutral bow (facing five o'clock) and deliver a right knee kick to opponent's spine.","As you plant your right foot forward into a right neutral bow (toward five o'clock) cock and strike out with both of your heel of palms to back of opponent's shoulder blades forcing opponent face down so that his body is diagonal (with opponent's head at five o'clock and his feet at eleven o'clock).","Left rear crossover and deliver a right back heel stomp to opponent's testicles.","Right foot glides and slides over opponent's right thigh and calf before crossing over and covering out twice."]
