["Standing in a left neutral bow, with your hands raised, execute a right hooking downward outward parry (as opponent delivers a right knife thrust), down and outside of opponent's outer right wrist, redirecting it to 5 o'clock. Almost simultaneously with  your right hand parry, execute a left heel palm parry and grab immediately thereafter with the same hand.","Slide your right foot clockwise toward 1 o'clock (traveling about 180ยก into a left neutral bow (to buckle opponent's right leg) with your back facing your opponent and your left hand still grabbing). Simultaneously execute a right back elbow strike to opponent's right or left ribcage, depending upon how you line up to your opponent.","Immediately shift your right foot counter clockwise to 8 o'clock (into a right neutral bow) as your right hand now changes place with your left by grabbing opponent's right wrist (have your left hand form the shape of a crane and hook. on to left side of opponent's neck and throat. Without any hesitation (as if it was a single move) drop down into a left wide kneel as you pull your opponent down with both of your hands forcing back of opponent's right elbow onto your left knee in order to cause an arm break.","Have your left hand regrab opponent's right wrist and assist your right hand in twisting opponent's wrist counter clockwise as your left foot steps back to 9 o'clock (counter clockwise) into another left wide kneel facing 9 o'clock. Simultaneously have both of your hands force opponent's knife (if opponent is still holding on to the knife) into his throat. If opponent releases the knife on the arm break maintain the hold on opponent's right wrist with your left hand as your right hand grabs the knife and plunges it into opponent's throat.","Release your left hand grab and shift your left hand under (reverse if clockwise and palm up) opponent's right wrist and wrap opponent's left arm around your left leg, twist your left hand counter clockwise (placing great pressure on opponent's wrist) and up as your right heel of palm pushes down on opponent's outer right elbow to cause a right shoulder dislocation.","Release your right hand grab and shift your right hand under (reverse it counter clockwise and palm up) opponent's right wrist, and switch your stance to a left reverse bow as your right hand maintains the grab (on opponent's right wrist) and twists clockwise (placing great pressure on opponent's right wrist and shoulder). Simultaneously strike opponent's right elbow (after its release) with your left heel of palm (to break opponent's right elbow).","Cock your left leg and deliver a left heel stomp to right side of opponent's neck as both of your hands grab and pull up and toward you to cause further shoulder dislocation.","Force opponent's arm to the ground and left front crossover stomp on top of opponent's right wrist and cover out twice toward 5 o'clock."]
