["While in a right neutral bow, deliver a right downward inward block to right forearm of opponent's right uppercut. Your left hand is guarding at chest level.","Immediately shoot a left overhead claw to opponent's face while your right elbow stays close to your body.","Your right clenched fist then circles clockwise and becomes a right thrusting back knuckle strike to opponent's face.","Have your left hand (which was guarding at the sternum and solar plexus) execute a left heel of palm strike to opponent's chin ricocheting into a five finger eye thrust. At this point your right hand should then be guarding in place of the left hand.","From the ricocheting left five finger thrust to opponent's eyes time your next move so that they simultaneously counteract each other. When the left five finger thrust claws opponent's face on the way down, deliver a right half fist' strike (palm up) to opponent's throat. Continue the motion of your left hand and drop it down over your right elbow (like in 'Five Swords').","Shift your left foot toward four o'clock as your left hand claws out and to opponent's face with the action stopping at the face and have your right hand circle counter clockwise and deliver a back knuckle strike to opponent's solar plexus (have your right arm circle on the inside of your own left arm).","Again shift your left foot and move it toward one and two o'clock as your right back knuckle (after the hit) slides along the left rib cage of opponent continuing under opponent's left arm while your left hand checks opponent's left elbow. Immediately execute a left arm lock forcing your opponent to bend over as you drop down into a right wide kneel.","Step forward with your left foot toward six o'clock as your left hand slides down opponent's left forearm to his left wrist. At this point begin to place great pressure on opponent's arm (opponent's left arm at this point is in a hammerlock).","Shift your right foot clockwise to six o'clock (left neutral bow) and have your right hand now assist your left hand in grabbing opponent's left wrist and yank opponent's left arm down and toward you to dislocate opponent's left shoulder as opponent's face and body is forced to the ground (face down).","Leap up in the air and turn counter clockwise (facing nine o'clock) as you come down executing a right knee drop to back of opponent's neck.","Bounce on opponent's neck and leap up and turn clockwise (facing three o'clock) coming down with a left heel stomp to opponent's head.","</li><li>12. Left front crossover and cover out twice."]
