["While in a left neutral bow or standing naturally have your left foot move forward and to your left (between ten and eleven o'clock) you're still in a left neutral bow as your left hand (while open) inward parries outside of opponent's wrist (the hand with the knife).","While the overhead attack is still in motion, pivot to your right into a horse as your right hand assists your left in following the force of your opponent's knife hand. While still following the knife hand and without losing momentum, pivot to your left (into a left neutral bow) and jam the knife into your opponent's right thigh.","Release your right hand check and deliver a right inward horizontal elbow strike to opponent's sternum while shuffling forward (push drag).","With your left hand still pressing the knife against the thigh, have your left outward reverse tiger's mouth (palm up) choke your opponent at his adam's apple as your right hand switches places (palm down) to continue pressing the knife against your opponent's right thigh.","Immediately switch both of your hands so that your left forearm now presses your opponent's right arm as the hand of the same left arm grabs and squeezes your opponent's testicles. Simultaneously have your right hand (circle counter clockwise - palm down) hook and pinch opponent's eyes (crab hand pinch).","Step to 10 o'clock with your left foot as your right hand hooks inside of your left arm and down to check opponent's right arm as your left hand slides up your opponent's body (after releasing opponent's testicles) striking to opponent's throat with your left inner wrist.","Immediately switch your left inner wrist to a left hooking (shape of the crane) wrist as your right foot steps through to 10 o'clock dropping into a right kneel thus forcing your opponent over your right leg to cause a back break.","Almost simultaneous with the above move circle your right arm in a counter clockwise manner and deliver a right downward diagonal hammer fist across opponent's throat. (Knife should be released at this point.)","Deliver a left thrusting heel palm to opponent's jaw (fingers pointed up) striking and forcing opponent off of your right knee. (Right hand checking opponent's right shoulder.)","Right front crossover and cover out twice toward 4 o'clock."]
