["With feet together and both of your shoulders grabbed by two opponents flanking you, step back with your right foot to 6 o'clock (into a left neutral bow) as you circle both arms (your arms) out and back (in an obscure claw fashion) clawing opponent's faces (your right hand clawing the face of right opponent and your left hand clawing the face of your left opponent).","Continue to circle your arms around, over, and back and immediately step forward with your right foot to 12 o'clock (into a right neutral bow) as you deliver double uppercut punches so that your forearms and biceps strike under and against opponent's elbows to break both of them. (Your right arm under right opponent's left elbow and your left arm under left opponent's right elbow.)","Deliver double back knuckle strikes to ribs of opponents (your right back knuckle strikes to right opponent's left ribcage and your left back knuckle to left opponent's right ribcage).","Circle both of your hands back, around. in and grab both of opponent's heads (smashing opponent's heads together) as your left knee kicks up and between opponent's heads.","As you replant your left foot back (into a right neutral bow) have both of your hands execute twin pushdown on opponent's shoulders (acting as a check) then follow the contour of your opponent's bodies, traveling down the inner thighs of your opponent's legs that are closest to you. Have your hands form reverse hooks (reverse hooking wings) as they travel down to the ankles of both opponents. Grab both ankles and jerk them outward from under your opponents and immediately pull toward you.","While still maintains both ankle grabs (at least try to maintain grabs) deliver a right ball kick to groin of opponent to your left.","Plant your right foot toward 12 o'clock (into a right neutral bow) and execute a left roundhouse kick to sternum of opponent to your right.","From your left kick, left front crossover and cover out twice, keeping equal distance between opponents."]
