["While in a right neutral bow deliver a right inward downward strike and grab (with the same right hand) to inner right wrist of opponent as your left foot shifts to 4 o'clock.","Immediately shuffle (push drag) forward (with right hand still maintaining grab) and strike to opponent's groin with a left underhand heel strike and grab.","Shift your right foot back to 6 o'clock as your left hand assists your right hand in twisting your opponent's wrist clockwise, forcing opponent to bend forward and breaking opponent's right wrist, thus having opponent drop his knife.","Left front snap kick to opponent's left ribs and a right chicken kick to opponent's sternum.","As you plant your right foot forward into a right neutral bow, check opponent's right arm with your left hand and deliver a right underhand stiff-arm lifting back knuckle strike (vertically) driving upward underneath opponent's chin.","Switch your right hand (which is now above opponent's head) clockwise (palm up) and strike down vertically) to bridge of opponent's nose in a raking manner utilizing the back knuckle of your right hand.","Circle your right arm counter clockwise (starting a figure 8 pattern which should be visualized laying on its side) and strike opponent's left jaw hinge with your right hammer fist.","Continue the figure 8 pattern and deliver a right back knuckle to opponent's right jaw hinge.","With your opponent bending over have your right hand hook over (shape of the crane) and under opponent's right armpit, hooking opponent's right arm out and away from you, as you step through with the left foot into a left neutral bow toward 12 o'clock, executing a left vertical elbow strike to underside of opponent's right armpit.","As you drag or right rear crossover to 10 o'clock step out to 10 o'clock into a left reverse bow, buckling opponent's right leg out as you execute a left downward hammer fist to opponent's right ribcage while simultaneously striking with a right inward downward hammer fist (universal block) to opponent's mastoid.","Left front crossover and cover out twice toward 4 o'clock."]
