["Standing naturally, while your opponent pushes your left shoulder with his right hand, step forward and to your left with your right foot (to eleven o'clock) so as to cause a buckle from the inside of opponent's right knee. Simultaneously pin your opponent's right hand to your left shoulder with your left hand and strike to opponent's jaw with a right forward heel thrust.","Immediately drop your right hand and scrape opponent's right biceps and forearm while circling your right arm counter clockwise to execute the next strike. This action will check your opponent's right arm and force him to bend forward.","Continue circling your right arm counter clockwise and deliver a right inward horizontal elbow strike to opponent's left rib cage.","With your left hand still pinning and after following through with your first elbow shot, deliver a right outward horizontal elbow strike to opponent's right rib cage or solar plexus, followed by a right thrusting chop to shoulder.","Release your left hand and execute a left overhead five finger claw to opponent's face as you cock your right fist (clenched and palm up) under your right chest. (After your left claw delivery your left forearm is then utilized as a pinning check.)","Follow-up with a right thrusting back knuckle (delivered vertically and straight up) to opponent's jaw.","From the right back knuckle, left rear crossover (toward twelve o'clock) and deliver a right (underhand) back elbow strike to opponent's solar plexus. Have your left hand claw opponent's face in the process and then guard your own face area.","Have your right foot step out to one and two o'clock (thrust it and lock it out) as it buckles opponent's left knee from the inside out (at the moment of contact you should automatically be in a right reverse bow. Simultaneously strike down to opponent's groin with a right downward hammer fist or right heel of palm as your left hand still guards your face.","From the right reverse bow deliver a right knee kick to opponent's right inner knee.","Right from the kick go into a right front crossover and cover out twice."]
