["With feet together, step forward and to your left (toward eleven o'clock) with your right foot into a right neutral bow (to buckle opponent's right knee) as you strike up and to opponent's jaw with your right elbow. Your left hand is placed on top of opponent's right wrist for security reasons.","Pivot counter clockwise into a reverse left neutral bow as you deliver a right back elbow to opponent's solar plexus.","Left rear crossover and right reverse bow to buckle on inside of opponent's left knee. Simultaneously deliver a right downward hammer fist to opponent's groin. (Left hand is in high guard position.)","Have your left guarding hand Shin into a left hook (forming the shape of the crane). As your left hand hooks clockwise and to the left side of opponent's neck and pulls down, simultaneously execute a vertical upward back knuckle strike to opponent's face (to cause sandwiching effect).","Circle your right hand and hook it (forming the shape of the crane) counter clockwise to right side of opponent's neck and head and with both of your hands grab back of opponent's head and pull it down as you deliver a right knee kick to opponent's head (again causing another sandwiching effect).","Plant your right foot straight down from the knee kick so that it is almost in line with your left foot and immediately step back with your left foot as both of your arms pull and flip opponent over and onto his back.","With opponent now on his back with his head closest to you, leap up and counter clockwise in the air, dropping down into a left close kneel as your right knee drops and crosses opponent's right collar bone and throat. Simultaneous with the drop, execute a right downward vertical raking back knuckle slice across opponent's bridge of nose (traveling overhead, down, and toward you). Your left hand should be kept in a low guard position.","Immediately leap up and shift clockwise in the air, dropping down into a right close kneel as your left knee drops and crosses opponent's left collar bone and throat. Simultaneous with the drop, execute a left downward corkscrew punch to opponent's face.","Again leap up and pivot counter clockwise in the air and land with a right overhead downward roundhouse kick to opponent's sternum (kick is like leaping kick of 'Leap of Death').","Right front crossover and cover out twice."]
